[
  {
    "url": "https://finance.yahoo.com/news/jim-cramer-ge-aerospace-ge-090528167.html",
    "url_mobile": "",
    "title": "Jim Cramer on GE Aerospace ( GE ):  I Truly Love GE Aerospace Right Here  ",
    "seendate": "20250606T183000Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/jbLJytDWAVutC1XN1u3sDA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/e19c5b5226148461201b825c81ce7433",
    "domain": "finance.yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Jim Cramer on GE Aerospace (GE): “I Truly Love GE Aerospace Right Here” Syeda Seirut Javed June 5, 2025 2 min read GE We recently published a list of Jim Cramer’s Thoughts on These 12 Stocks . In this article, we are going to take a look at where GE Aerospace (NYSE:GE) stands against other stocks that Jim Cramer discusses. A caller inquired about GE Aerospace (NYSE:GE) during the episode. Cramer replied that he loves the stock here. “GE Aerospace… is about as good as it gets. That guy from June of last year, he knew that GE Aerospace was good. That guy’s so smart. I gotta get him on the show… I truly love GE Aerospace right here.” Jim Cramer on GE Aerospace (GE): “I Truly Love GE Aerospace Right Here” A technician in a power station monitoring the flow of energy generated by a gas turbine. GE Aerospace (NYSE:GE) develops and services aircraft engines and related systems for both commercial and defense sectors. The company provides advanced propulsion technologies, maintenance solutions, and components for a wide range of aviation applications. During the Mad Money episode aired on April 22, Cramer had many positive things to say about the company: “Let’s start with the best, GE Aerospace, because that’s the closest thing to a commercial aerospace pure play. It’s got the least defense exposure by far. Not coincidentally, it’s also the only one of these stocks that roared in response to earnings, jumping $10 and 83 cents. That’s more than 6%. Even though GE Aerospace posted a small revenue miss, they gave you a monster 22 cents earnings beat off a dollar 27 basis. Management said the total orders grew 12% in the quarter. That’s really good. Company reiterated its entire full-year forecast. Now, look, in normal environment, merely reiterating your outlook after such a big earnings beat would be, considered to be, let’s say, a big win but nothing that would make you go crazy about it but this time, it is huge. GE explicitly said that their outlook now includes the impact of the administration’s tariff policies, including less air travel. READ NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires . Disclosure: None. This article is originally published at Insider Monkey . View Comments Terms and Privacy Policy Privacy Dashboard More Info"
  },
  {
    "url": "https://www.aol.com/us-asks-australia-increase-defense-180207587.html",
    "url_mobile": "",
    "title": "US asks Australia to increase defense spending to 3 . 5 % of GDP",
    "seendate": "20250601T193000Z",
    "socialimage": "https://media.zenfs.com/en/aol_reuters_29/188b7a5013bd43906a8885b42fd2134e",
    "domain": "aol.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Kirsty Needham June 1, 2025 at 2:02 PM 25 Copied By Kirsty Needham WASHINGTON/SYDNEY (Reuters) -Australia's prime minister said on Monday his government would decide its defence capability needs before announcing defence spending, after U.S. Defence Secretary Pete Hegseth asked Australia to lift its defence budget to 3.5% of gross domestic product. \"What you should do in defence is decide what you need, your capability, and then provide for it,\" Prime Minister Anthony Albanese told reporters, adding his government had already committed to accelerate A$10 billion in defence spending for the next four years. \"We're continuing to lift up,\" he said, citing a 2.3% goal for 2033 previously set by his government. Hegseth and Australian Defence Minister Richard Marles discussed security issues including accelerating U.S. defence capabilities in Australia and advancing industrial base cooperation during a meeting on Friday, a Pentagon statement said on Sunday. \"On defence spending, Secretary Hegseth conveyed that Australia should increase its defence spending to 3.5 percent of its GDP as soon as possible,\" the statement said. The ministers' meeting on the sidelines of the Shangri-La Dialogue, Asia's premier security forum, is only the second between the security allies since U.S. President Donald Trump took office in January. Albanese, who was re-elected in May and is yet to meet Trump, did not raise defence spending in this year's national budget, saying his government had already announced a A$50 billion boost over a decade. Peter Dean, director of foreign policy and defence at the University of Sydney's United States Studies Centre, said Albanese was positioning ahead of his first meeting with Trump, where the pair are also expected to discuss tariffs. Albanese would want the decision on a defence boost to be seen as a sovereign one not imposed by Trump, after the election showed standing up for Australia was popular domestically, he said. Australia's defence spending in 1987 was around 3% of GDP or 10% of the national budget, compared to 2% of GDP or 6% of the budget in 2025, he said. \"To achieve self-reliance in the modern era, with the threat from China, and within our region, it is going to cost more money,\" Dean said. The U.S. would spend 3.5% of GDP on defence this year, he added. Australia has comitted to spend A$368 billion over three decades on the AUKUS programme to acquire and build nuclear powered submarines, and is also boosting missile acquisition and manufacture. (Reporting by Kirsty Needham and Christine Chen in Sydney, and Doina Chiacu in Washington; Editing by Caitlin Webber, Rod Nickel and Michael Perry)"
  },
  {
    "url": "https://www.yahoo.com/news/us-asks-australia-increase-defense-180207996.html",
    "url_mobile": "",
    "title": "US asks Australia to increase defense spending to 3 . 5 % of GDP",
    "seendate": "20250601T183000Z",
    "socialimage": "https://media.zenfs.com/en/reuters.com/98bc7503f39192ed05555973e9855ffe",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "FILE PHOTO: Memorial Day in Arlington, Virginia By Kirsty Needham WASHINGTON/SYDNEY (Reuters) -Australia's prime minister said on Monday his government would decide its defence capability needs before announcing defence spending, after U.S. Defence Secretary Pete Hegseth asked Australia to lift its defence budget to 3.5% of gross domestic product. \"What you should do in defence is decide what you need, your capability, and then provide for it,\" Prime Minister Anthony Albanese told reporters, adding his government had already committed to accelerate A$10 billion in defence spending for the next four years. Advertisement Advertisement Advertisement Advertisement \"We're continuing to lift up,\" he said, citing a 2.3% goal for 2033 previously set by his government. Hegseth and Australian Defence Minister Richard Marles discussed security issues including accelerating U.S. defence capabilities in Australia and advancing industrial base cooperation during a meeting on Friday, a Pentagon statement said on Sunday. \"On defence spending, Secretary Hegseth conveyed that Australia should increase its defence spending to 3.5 percent of its GDP as soon as possible,\" the statement said. The ministers' meeting on the sidelines of the Shangri-La Dialogue, Asia's premier security forum, is only the second between the security allies since U.S. President Donald Trump took office in January. Advertisement Advertisement Advertisement Advertisement Albanese, who was re-elected in May and is yet to meet Trump, did not raise defence spending in this year's national budget, saying his government had already announced a A$50 billion boost over a decade. Peter Dean, director of foreign policy and defence at the University of Sydney's United States Studies Centre, said Albanese was positioning ahead of his first meeting with Trump, where the pair are also expected to discuss tariffs. Albanese would want the decision on a defence boost to be seen as a sovereign one not imposed by Trump, after the election showed standing up for Australia was popular domestically, he said. Australia's defence spending in 1987 was around 3% of GDP or 10% of the national budget, compared to 2% of GDP or 6% of the budget in 2025, he said. Advertisement Advertisement Advertisement Advertisement \"To achieve self-reliance in the modern era, with the threat from China, and within our region, it is going to cost more money,\" Dean said. The U.S. would spend 3.5% of GDP on defence this year, he added. Australia has comitted to spend A$368 billion over three decades on the AUKUS programme to acquire and build nuclear powered submarines, and is also boosting missile acquisition and manufacture. (Reporting by Kirsty Needham and Christine Chen in Sydney, and Doina Chiacu in Washington; Editing by Caitlin Webber, Rod Nickel and Michael Perry) About Our Ads"
  },
  {
    "url": "http://thepointsguy.com/travel/military-travel-discounts/",
    "url_mobile": "",
    "title": "The best military travel deals for service members in 2025",
    "seendate": "20250527T061500Z",
    "socialimage": "https://thepointsguy.global.ssl.fastly.net/us/originals/2025/04/Active-duty-military-serviceman-talking-on-cell-phone-at-airport_Mark-Edward-AtkinsonTracey-Lee.jpg",
    "domain": "thepointsguy.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "ADVERTISEMENT Guides The best military travel deals for service members Tarah Chieffi Tarah Chieffi Senior writer As a senior writer for TPG, Tarah Chieffi helps readers travel better, more often and within their budget. May 26, 2025 • 14 min read Jump to section Facebook Twitter LinkedIn Copy URL Email The cards we feature here are from partners who compensate us when you are approved through our site, and this may impact how or where these products appear. We don’t cover all available credit cards, but our analysis, reviews, and opinions are entirely from our editorial team. Terms apply to the offers listed on this page. Please view our advertising policy and product review methodology for more information. Editor's Note This is a recurring post, updated regularly with new offers and information. Many airlines, hotels, theme parks and cruise lines pay year-round tribute to those who serve our country with various discounts and benefits. Sometimes these deals are available only to active-duty military personnel, and sometimes the perks extend to U.S. military veterans and their families. Related: The best credit cards for active-duty military members: Get waived annual fees No matter the form these military travel deals take, they all reflect the gratitude the travel industry feels toward those who have sacrificed so much to protect our country. Here are the perks that military members can take advantage of on their travels. Military hotel discounts Gaylord Palms Resort & Convention Center. TARAH CHIEFFI/THE POINTS GUY B Hotels & Resorts To honor military members, B Hotels & Resorts offers an exclusive \"B Saluted\" discount of 15% off regular rates and two welcome drinks per stay to military members, veterans and their families. B Hotels & Resorts has locations in Orlando, Fort Lauderdale and Marathon, Florida. Best Western Best Western properties across the U.S. offer discounted rates for veterans, military members and government personnel . Best Western's Service Rewards program — the hotel chain's award program tailored to military and armed forces members — unlocks even more member benefits, including an automatic upgrade to Gold status and bonus points on qualified stays. Choice Hotels Choice Hotels — including Comfort, Sleep Inn and Quality Inn hotels — extends a discounted rate for official and leisure travel to active-duty and retired military personnel, their dependents and members of several military associations. When you are searching for a hotel, open the drop-down \"Rate\" menu and choose \"Military/Veterans (Leisure)\" for leisure travel or \"Government/Military (Official Business Travel)\" for work travel. Active-duty military members, veterans and military spouses are eligible to join the Choice Privileges rewards program at the Lifetime Gold Elite level. Daily Newsletter Reward your inbox with the TPG Daily newsletter Join over 700,000 readers for breaking news, in-depth guides and exclusive deals from TPG’s experts Email address Sign up By signing up, you will receive newsletters and promotional content and agree to our Terms of Use and acknowledge the data practices in our Privacy Policy . You may unsubscribe at any time. Great Wolf Lodge Great Wolf Lodge offers up to 40% off nightly rates for active, retired and veteran military members through the Howling Heroes offer . The offer is valid for up to four guests per room. Hilton Federal and U.S. military employees qualify for military rates and discounts at participating Hilton properties. There are separate discounts for official military travel and leisure travel. For official military travel, check the box labeled \"Government and military rates\" for applicable rates. For leisure travel, visit Hilton's Military Family Rate page and search for your travel destination and dates. Hyatt Veterans, active-duty members and their immediate family members are eligible for a discount of 10%-15% off Hyatt's standard rate at participating hotels . To get the discount, use the offer code \"MILVET\" while booking. IHG The hotel chain behind brands such as InterContinental, Holiday Inn, Crowne Plaza and Kimpton offers a military rate at participating locations across the U.S., Canada, and Central and South America. The rate applies to active-duty military personnel, veterans, retired military personnel and their families. Marriott Bonvoy Marriott Bonvoy and its many brands have discounted federal, state and local government rates available to government and military personnel. To access the discounted rates, choose the \"Government & Military\" option from the \"Special Rates\" drop-down menu when searching for a stay. You'll get a list of all the Marriott Bonvoy properties in your chosen city that offer special rates and their eligibility requirements. Motel 6 Motel 6, along with its sister extended-stay brand Studio 6, offers a 10% discount on standard rates to active and retired military personnel and their families. Red Roof Active-duty military personnel, veterans and government employees are eligible for a 10% discount on official travel at any U.S. Red Roof location. The hotel chain also has a 10% discount on leisure travel for all government employees and military members, veterans and retirees. Wyndham Participating Wyndham properties offer discounts of up to 15% off their best available rate to active and retired military personnel, veterans and their families. Plus, qualifying military personnel and their spouses get automatic Gold-level status when they enroll in the Wyndham Rewards program and bonus Wyndham Rewards points for qualified stays. Military airline discounts and benefits GARY HERSHORN/GETTY IMAGES Alaska Airlines In some markets, Alaska Airlines offers military fares to active-duty military personnel and their dependents when you call Alaska Airlines at 800-252-7522 to purchase your tickets. The airline also offers discounts through the WeSalute+ program . Active-duty U.S. military personnel can board early, check up to five bags for free, receive 15% off inflight food purchases and receive complimentary day passes to visit an Alaska Lounge when traveling in uniform. All other active-duty military personnel can purchase a discounted day pass for $30. Allegiant Air U.S. active-duty and reserve military members, military veterans, members of the National Guard and their dependents get up to two pieces of checked baggage for free through the Allegiant Honors program . Also, the airline waives its typical fees for oversized checked baggage, a carry-on bag, getting a boarding pass printed at the airport, bringing a pet on board and seat assignments. Qualifying service members can also board their flights early. American Airlines American Airlines offers government or military fares in some markets , but you must call the airline at 800-433-7300 to book. Veterans and their families can access reduced fares by enrolling in the WeSalute+ program . Active-duty military personnel are also allowed Group 1 boarding privileges, and they can bring up to five free checked bags when traveling on orders and up to three free checked bags when traveling for leisure (weight restrictions apply). U.S. military personnel traveling in uniform on a same-day American flight can enter Admirals Club lounges with their immediate family — defined as a spouse, domestic partner and/or children under 18 — or up to two guests at most Admirals Club locations except for Airspace Lounge at San Diego International Airport (SAN) and Japan Airlines' Sakura Lounge at Honolulu's Daniel K. Inouye International Airport (HNL). Delta Air Lines Active-duty U.S. service members can call Delta Reservations at 800-221-1212 for discounted fares unavailable to the general public. Delta also offers priority boarding and free checked baggage to active-duty military members. The number of bags you are allowed is based on the type of travel and fare type, and you must adhere to the specified size and weight restrictions for baggage . Frontier Airlines Frontier typically charges for carry-on bags and checked baggage . However, active-duty armed forces, National Guard and Reserve members, their accompanying spouse and children can receive a free carry-on bag, two free checked bags and one free personal item . JetBlue Active-duty military personnel traveling for business or leisure are eligible for a 5% discount off base fares . If traveling on government-sponsored business, you can call 800-538-2583 to receive your discount and up to five free checked bags. This discount applies to you and your immediate family. U.S. active-duty military members, retired military members, veterans, National Guard and Reserve members, and their families enrolled in WeSalute+ can also get a 5% discount off base fares and up to two free checked bags. Southwest Airlines Special fares are available for military and government travelers , but you must call the airline at 800-435-9792 or visit the airport ticket counter to book them. Additionally, military members traveling on active duty (in or out of uniform) can board between the A and B groups and are exempt from the limit of two pieces of checked baggage. Spirit Airlines Active-duty U.S. military members and their accompanying spouse and/or children can board early, check two bags for free, and bring a carry-on item on their flight for free, in addition to their free personal item. United Airlines United offers an additional checked baggage allowance, priority boarding and United Club lounge access to active-duty military members traveling in uniform. U.S. military veterans, active-duty military members, National Guard and Reserve members, and their families are also eligible for a 5% discount on United-operated flights through the WeSalute+ program. Military train travel discounts Amtrak Active-duty U.S. military personnel, spouses and dependents are eligible for a 10% discount on the lowest available fare in select fare classes. Select \"Military\" for each eligible passenger during your ticket search on Fare Finder. Amtrak also welcomes uniformed military personnel to the front of the ticket line. Military theme park ticket discounts U.S. Air Force Thunderbirds fly over Epcot. DAVID ROARK/WALT DISNEY WORLD Busch Gardens and SeaWorld parks All U.S. SeaWorld, Busch Gardens, Aquatica and Sesame Place parks offer discounted tickets to active-duty military members and veterans through the Waves of Honor program. Disneyland Disneyland honors active and retired U.S. military personnel with discounted three- and four-day Disney Military Promotional Park Hopper tickets . The tickets include access to Disneyland and Disney California Adventure each day of your ticket, excluding blackout dates. Pricing starts at $295, and you must purchase tickets at a participating U.S. military base ticket office or through govx.com. Theme park reservations are required. Hotel discounts are also available by calling 800-453-4911. Dollywood Dollywood offers discounted tickets and annual passes to U.S. active or retired military members, veterans, military reservists, spouses and dependents. Holiday World Holiday World in Santa Claus, Indiana , offers discounted daily tickets and season passes to active, retired and veteran military members. To access this discount, purchase online or present your government ID at the park's ticket booth. Silver Dollar City Silver Dollar City offers a ticket discount to U.S. active or retired military personnel, veterans and military reservists, along with their spouses and dependent children (ages 4-17) living in their households. In addition to discounted tickets, Silver Dollar City invites all military members and veterans to help raise the American flag during the park's daily opening ceremony. Service members are also given a red, white and blue ribbon to wear in the park, allowing employees and guests to thank them for their service. Universal Orlando Resort Universal Orlando offers a Military Freedom Pass promotional ticket to all active-duty and retired service members. Ticket prices start at $210 for unlimited admission between now and Dec. 19, though blackout dates apply. Each eligible service member can purchase up to six promotional tickets and must buy them through a participating authorized military ticket and travel office. Military members can also purchase discounted tickets to the new Universal Epic Universe park. Universal Studios Hollywood Universal Studios Hollywood offers discounted tickets to active-duty, retired and eligible veteran military members, and their spouses and dependents. Additional on-base discounts are available, including a 12-month Military Pass. Walt Disney World Active and retired U.S. military personnel are eligible for discounted hotel rates and specially priced theme park tickets at Walt Disney World . Military members can purchase a Military Salute ticket with either Park Hopper or Park Hopper Plus starting at $399 for a four-day ticket, $419 for a five-day ticket and $439 for a six-day ticket. Blackout dates apply, and theme park reservations are required. Hotel stays can be booked by calling 407-939-7830. Tickets must be purchased at a participating U.S. military base ticket office. Military cruise benefits Margaritaville at Sea's Paradise cruise ship. MARGARITAVILLE AT SEA AmaWaterways AmaWaterways offers active and retired service members a special military discount of $250 off a river cruise when you use the code \"MIL250\" when booking. Carnival Cruise Line Carnival Cruise Line shows its appreciation for active and retired armed forces members with discounted cruise rates, onboard credits and reduced deposits . Additionally, some ships have a Heroes Tribute Lounge, and every ship holds a military appreciation gathering for service members and their families. Celebrity Cruises On select Celebrity Cruises sailings, active and retired military members can save $25 on inside and ocean-view cabins and $100 on veranda cabins and above. This discount applies to the first and second guests in the cabin. Disney Cruise Line Disney Cruise Line offers special rates to all military members, active and retired, and their spouses. Discounted rates are only available on select sailings. MSC Cruises MSC Cruises offers discounted fares to all active and retired U.S. military personnel , plus family members traveling with them. You can receive a discount of 5% on interior and ocean-view cabins, 10% on balcony and suite cabins, and a \"kids sail free\" promotion on select sailings. Margaritaville at Sea Margaritaville at Sea honors active and veteran military members with a free cruise through the Heroes Sail Free program. On select sailings, military members and an additional guest in the same cabin can get a free fare (taxes and fees are not included). A third and fourth guest can be added at the regular fare. On all other sailings, military members can save 20% off the retail fare for the first four guests in the cabin. Norwegian Cruise Line Norwegian Cruise Line's Military Appreciation program extends exclusive benefits to military members, veterans and their spouses. Members of the program receive a 10% discount on all cruise fares and up to a 35% discount on select sailings. Princess Cruises Veterans and active, retired and disabled military personnel can receive up to $250 free onboard spending money on select Princess Cruises sailings. You can use this onboard credit for specialty dining, onboard boutiques, shore excursions, spa treatments and more. Royal Caribbean Royal Caribbean offers military rates to active and retired personnel, veterans and their spouses. The discounted rates also apply to friends and family members staying in the same cabin as the eligible service member. The best way to access the discounted rate is by booking through a travel agent or directly with Royal Caribbean over the phone. Bottom line A host of benefits awaits travelers who serve or have served in the U.S. military. Because these military travel deals, their requirements, and the eligibility of family members, spouses and dependents vary, carefully research each military discount offer to avoid surprises. Many airlines, hotels and other businesses might ask for proof of eligibility, so don't leave home without the military ID, veteran ID, dependent ID, orders and/or other documentation you'll need to take advantage of the many travel offers. Related reading: Key travel tips you need to know — whether you're a beginner or expert traveler The best travel credit cards 6 real-life strategies you can use when your flight is canceled or delayed 8 of the best credit cards for general travel purchases Featured image by MARK EDWARD ATKINSON/TRACEY LEE/GETTY IMAGES Editorial disclaimer: Opinions expressed here are the author’s alone, not those of any bank, credit card issuer, airline or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities. TPG featured card Best for businesses with high spending Capital One Venture X Business Apply for Capital One Venture X Business Terms & restrictions apply. See rates & fees TPG Editor‘s Rating Open Editors rating Card Rating is based on the opinion of TPG‘s editors and is not influenced by the card issuer. 4.5 / 5 Go to review Apply now Apply for Capital One Venture X Business at Capital One 's secure site Rewards 2 - 10X miles details 2X miles 2 miles per dollar on every purchase 5X miles 5 miles per dollar on flights and vacation rentals booked through Capital One Business Travel 10X miles 10 miles per dollar on hotels and rental cars booked through Capital One Business Travel Intro offer Earn 150,000 bonus miles details Earn 150,000 bonus miles once you spend $30,000 in the first 3 months from account opening Annual Fee $395 Recommended Credit 740-850 Excellent more info Credit ranges are a variation of FICO® Score 8, one of many types of credit scores lenders may use when considering your credit card application. Why We Chose It The Capital One Venture X Business Card has all the Capital One Venture X Rewards Credit Card has to offer and more. It offers an incredible welcome bonus and requires an equally impressive spend to qualify. In addition, the card comes with premium travel perks like annual travel credit. Pros & Cons Pros The Capital One Venture X business card has a very lucrative welcome offer. In addition, the card comes with many premium travel perks such as an annual $300 credit for bookings through Capital One Business Travel. Business owners are also able to add employee cards for free. Cons The card requires significant spending to earn the welcome offer. Another drawback is that the annual travel credit can only be used on bookings made through Capital One Business Travel. More Details Earn 150,000 bonus miles once you spend $30,000 in the first 3 months from account opening Earn unlimited 2X miles on every purchase, everywhere—with no limits or category restrictions Earn 10X miles on hotels and rental cars and 5X miles on flights and vacation rentals booked through Capital One Business Travel With no preset spending limit, enjoy big purchasing power that adapts so you can spend more and earn more rewards Empower your teams to make business purchases while earning rewards on their transactions, with free employee and virtual cards. Plus, automatically sync your transaction data with your accounting software and pay your vendors with ease Redeem your miles on flights, hotels and more. Plus, transfer your miles to any of the 15+ travel loyalty programs Every year, you'll get 10,000 bonus miles after your account anniversary date. Plus, receive an annual $300 credit for bookings made through Capital One Business Travel Receive up to a $120 credit for Global Entry or TSA PreCheck®. Enjoy access to 1,300+ airport lounges worldwide, including Capital One Lounge locations and Priority Pass™ lounges, after enrollment Enjoy a $100 experience credit and other premium benefits with every hotel and vacation rental booked from the Premier Collection This is a pay-in-full card, so your balance is due in full every month Apply now Apply for Capital One Venture X Business at Capital One 's secure site Terms & restrictions apply. See rates & fees Best for businesses with high spending Capital One Venture X Business TPG Editor‘s Rating Open Editors rating Card Rating is based on the opinion of TPG‘s editors and is not influenced by the card issuer. 4.5 / 5 Go to review Rewards Rate 2X miles 2 miles per dollar on every purchase 5X miles 5 miles per dollar on flights and vacation rentals booked through Capital One Business Travel 10X miles 10 miles per dollar on hotels and rental cars booked through Capital One Business Travel Intro Offer Open Intro bonus Earn 150,000 bonus miles once you spend $30,000 in the first 3 months from account opening Earn 150,000 bonus miles Annual Fee $395 Recommended Credit Open Credit score description Credit ranges are a variation of FICO® Score 8, one of many types of credit scores lenders may use when considering your credit card application. 740-850 Excellent Why We Chose It The Capital One Venture X Business Card has all the Capital One Venture X Rewards Credit Card has to offer and more. It offers an incredible welcome bonus and requires an equally impressive spend to qualify. In addition, the card comes with premium travel perks like annual travel credit. View More Pros + cons More Details Pros The Capital One Venture X business card has a very lucrative welcome offer. In addition, the card comes with many premium travel perks such as an annual $300 credit for bookings through Capital One Business Travel. Business owners are also able to add employee cards for free. Cons The card requires significant spending to earn the welcome offer. Another drawback is that the annual travel credit can only be used on bookings made through Capital One Business Travel. Earn 150,000 bonus miles once you spend $30,000 in the first 3 months from account opening Earn unlimited 2X miles on every purchase, everywhere—with no limits or category restrictions Earn 10X miles on hotels and rental cars and 5X miles on flights and vacation rentals booked through Capital One Business Travel With no preset spending limit, enjoy big purchasing power that adapts so you can spend more and earn more rewards Empower your teams to make business purchases while earning rewards on their transactions, with free employee and virtual cards. Plus, automatically sync your transaction data with your accounting software and pay your vendors with ease Redeem your miles on flights, hotels and more. Plus, transfer your miles to any of the 15+ travel loyalty programs Every year, you'll get 10,000 bonus miles after your account anniversary date. Plus, receive an annual $300 credit for bookings made through Capital One Business Travel Receive up to a $120 credit for Global Entry or TSA PreCheck®. Enjoy access to 1,300+ airport lounges worldwide, including Capital One Lounge locations and Priority Pass™ lounges, after enrollment Enjoy a $100 experience credit and other premium benefits with every hotel and vacation rental booked from the Premier Collection This is a pay-in-full card, so your balance is due in full every month gtm--featured-card-10186"
  },
  {
    "url": "https://www.marketscreener.com/quote/stock/GE-AEROSPACE-4823/news/GE-Aerospace-Signs-Limited-Distribution-Agreement-with-United-Aero-Group-Expanding-CT7-T700-Engin-50028578/",
    "url_mobile": "",
    "title": "GE Aerospace : Signs Limited Distribution Agreement with United Aero Group , Expanding CT7 / T700 Engine Support",
    "seendate": "20250521T180000Z",
    "socialimage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
    "domain": "marketscreener.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "GE Aerospace : Signs Limited Distribution Agreement with United Aero Group, Expanding CT7/T700 Engine Support Published on 05/21/2025 at 01:37 pm EDT Publicnow Share GE Aerospace -0.39% LYNN, Mass. - May 21, 2025 - GE Aerospace signed a limited distribution agreement with United Aero Group (UAG) authorizing the company as a distributor for CT7/T700 engine parts and spares. This collaboration expands GE Aerospace's service capabilities, providing CT7/T700 operators with additional access to parts and maintenance solutions. As a trusted provider of aerospace aftermarket services, UAG will enhance the distribution of GE Aerospace parts and materials, extending coverage to areas not currently served by existing agreements. This partnership reinforces the operational readiness of customers worldwide. Through this collaboration, GE Aerospace continues to invest in customer support solutions that prioritize availability and readiness. \"This agreement with United Aero Group reflects our commitment to enhancing service and support for our customers,\" said Elissa Lee, executive director for commercial turboshaft engines at GE Aerospace. \"By expanding our distribution network, we are ensuring that operators of CT7 and T700 engines receive the high-quality, OEM-backed parts they need to maintain the highest level of safety and peak performance.\" With over 130 million flight hours, GE Aerospace's CT7/T700 family of engines resides in every environment an aircraft can operate. More than 25,000 engines have been delivered and power 15 types of military and civilian helicopters and fixed-wing aircraft across the globe. \"Our continued partnership with GE Aerospace strengthens UAG's role in supporting the global CT7/T700 operator base by providing direct access to OEM-authorized parts and components. This collaboration reinforces UAG's commitment to customer requirements, enabling the company to serve operators with a shared focus on quality and operational readiness. UAG is proud to join GE Aerospace in this strategic initiative,\" said Jamie Gelder, chief executive officer of UAG. About GE Aerospace GE Aerospace is a global aerospace propulsion, services, and systems leader with an installed base of approximately 45,000 commercial and 25,000 military aircraft engines. With a global team of approximately 53,000 employees building on more than a century of innovation and learning, GE Aerospace is committed to inventing the future of flight, lifting people up, and bringing them home safely. Learn more about how GE Aerospace and its partners are defining flight for today, tomorrow, and the future at https://www.geaerospace.com . About UAG United Aero Group specializes in distributing aircraft parts, managing repairs, and offering comprehensive support to both military and commercial operators worldwide. Through its global network of locations, UAG provides end-to-end solutions-from aircraft acquisitions and upgrades, to parts support, to composite blade repairs, and component services. Our mission is to deliver tailored solutions to keep your fleet mission-ready. https://www.unitedaerogroup.com Media Contact:Mandy MayfieldAmanda.Mayfield@geaerospace.com321 -442-1259 UAG Media ContactRaven Marcotteraven.marcotte@unitedaerogroup.com337 -577-3089 Attachments Original document Permalink Disclaimer GE Aerospace - General Electric Company published this content on May 21, 2025 , and is solely responsible for the information contained herein. Distributed via Public Technologies (PUBT) , unedited and unaltered, on May 21, 2025 at 17:36 UTC . © Publicnow - 2025 Share"
  },
  {
    "url": "https://www.army.mil/article/285642/texas_guard_pairs_with_united_arab_emirates_in_state_partnership_program",
    "url_mobile": "https://www.army.mil/article-amp/285642/texas_guard_pairs_with_united_arab_emirates_in_state_partnership_program",
    "title": "Texas Guard Pairs with United Arab Emirates in State Partnership Program",
    "seendate": "20250519T224500Z",
    "socialimage": "https://api.army.mil/e2/c/images/2025/05/19/8aa552d1/max1200.jpg",
    "domain": "army.mil",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "1 / 2 Show Caption + Hide Caption – SPP Logo (Photo Credit: National Guard Bureau) VIEW ORIGINAL 2 / 2 Show Caption + Hide Caption – NGB logo seal (Photo Credit: National Guard Bureau) VIEW ORIGINAL ABU DHABI, United Arab Emirates — The Texas National Guard and the United Arab Emirates will be paired in the Department of Defense National Guard Bureau State Partnership Program (SPP), the Defense Department announced in a Monday news release. The SPP, which formally welcomed the UAE as a member, “will bolster military modernization efforts and enhance cooperation in integrated air and missile defense, cybersecurity, disaster response and operational planning,” the news release said. The Pentagon also announced plans to create a Major Defense Partnership between the U.S. and UAE. Defense Secretary Pete Hegseth and UAE Minister of State for Defense Affairs Mohammed Mubarak Al Mazrouei signed a letter of intent to establish the comprehensive U.S.-United Arab Emirates Major Defense Partnership. The letter of intent, signed May 16 in a ceremony at the Ministry of Defense in Abu Dhabi, “represents a shared commitment to develop a structured roadmap that will guide enhanced military-to-military cooperation, joint capability development and long-term defense alignment between the two nations,” the news release said. “The two sides will explore a phased framework for advancing bilateral force readiness, interoperability and innovation-driven collaboration.” As part of this partnership, Hegseth announced a new strategic initiative between the U.S. Defense Innovation Unit and the UAE’s Tawazun Council. “This collaboration will deepen ties in defense innovation, facilitate joint research and development and expand industrial and investment partnerships across both defense ecosystems,” the news release said. “The designation of the UAE as a Major Defense Partner reflects a decades-long relationship anchored in mutual trust, shared objectives and a common commitment to regional and global security,” the news release said. “It builds on the longstanding record of both countries working side-by-side to counter threats, stabilize conflict zones and promote security and prosperity in the Middle East and beyond.” Joint Press Statement on U.S.-UAE Major Defense Partnership: https://www.defense.gov/News/Releases/Release/Article/4189772/joint-press-statement-on-us-uae-major-defense-partnership/ State Partnership Program: https://www.nationalguard.mil/Leadership/Joint-Staff/J-5/International-Affairs-Division/State-Partnership-Program/ http://www.nationalguard.mil https://www.facebook.com/TheNationalGuard https://x.com/USNationalGuard"
  },
  {
    "url": "https://www.investors.com/research/ibd-industry-themes/boeing-stock-ba-defense-stocks-lockheed-northrop/",
    "url_mobile": "",
    "title": "Boeing Stock , Defense Names Take Off , But No Thanks To Lockheed , Northrop",
    "seendate": "20250510T003000Z",
    "socialimage": "https://www.investors.com/wp-content/uploads/2019/10/Stock-defense-Naval-Strike-Missile-01-USN.jpg",
    "domain": "investors.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Dow Jones aerospace giant Boeing (BA) stock — along with fellow defense names Heico (HEI), Howmet Aerospace (HWM), Loar Holdings (LOAR) and GE Aerospace (GE) — headline this week's analysis of ideas from a particular industry. Meanwhile, industry powerhouses Lockheed Martin (LMT) and Northrop Grumman (NOC) continue to underperform. All of the stock picks come from Investor's Business Daily's Aerospace-Defense…"
  },
  {
    "url": "https://www.azom.com/news.aspx?newsID=64549",
    "url_mobile": "",
    "title": "PPG to Invest $380 Million to Build New U . S . Manufacturing Facility in Shelby , N . C . for Aerospace Coatings and Sealants",
    "seendate": "20250509T121500Z",
    "socialimage": "https://d12oja0ew7x0i8.cloudfront.net/images/news/ThumbForNews_64549_17467887515148455.jpg",
    "domain": "azom.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Rethinking E-Waste: A Conversation on Self-Healing Electronics Dr. Mohammad Malakooti This research presents a self-healing composite that enhances flexible electronics, focusing on sustainability and effective recycling to combat e-waste."
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-05/65314141-artermis-aerospace-artemis-aerospace-achieves-a-king-s-award-for-enterprise-008.htm",
    "url_mobile": "",
    "title": "Artermis Aerospace : Artemis Aerospace achieves a King Award for Enterprise",
    "seendate": "20250506T114500Z",
    "socialimage": "",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Nachrichten » Artermis Aerospace: Artemis Aerospace achieves a King's Award for Enterprise Push Mitteilungen PR Newswire 06.05.2025 13:24 Uhr 329 Leser Artikel bewerten: ( 2 ) Artermis Aerospace: Artemis Aerospace achieves a King's Award for Enterprise WISTON, England, May 6, 2025 /PRNewswire/ -- Artemis Aerospace has been honoured with a King's Award for Enterprise for International Trade. Artemis is one of 197 organisations nationally to be recognised with a prestigious King's Award for Enterprise. Announced today (Tuesday 6 th May), Artemis has been recognised for its excellence in international trade. A total of 199 awards have been announced with two companies being recognised with two awards. Employing 14 people, Artemis Aerospace was founded in 1999 and is a leading aviation component supplies and support service. Based in West Sussex, the company operates globally and has international hubs covering the US and Asia. Jim Scott, co-founder and Managing Director of Artemis Aerospace, said: \"This is a defining moment in the history of Artemis Aerospace. Having started the business with Deborah Scott [Finance Director of Artemis Aerospace] more than 25 years ago from our spare bedroom, we have worked tirelessly to shape the business into the global success it is today. This prestigious award recognises everything we and our much-valued staff have done to create a business that competes on the world stage at every level. We are incredibly proud to have been recognised and rewarded by the King's Award for Enterprise for international trade and look forward to continuing to provide and expand on the high-quality expertise and components solutions we deliver to the aviation industry.\" The King's Awards for Enterprise, previously known as The Queen's Awards for Enterprise, were renamed in 2023 to reflect His Majesty The King's desire to continue the legacy of HM Queen Elizabeth II by recognising outstanding UK businesses. The Award programme, now in its 59th year, is the most prestigious business award in the country, with successful businesses able to use the esteemed King's Awards Emblem for the next five years. Applications for King's Awards for Enterprise 2026 open on 6th May 2025. Notes to Editor: Artemis Aerospace offers an innovative approach to component solutions for the aviation sector. Established in 1999, the company has earned a reputation for outstanding customer service by solving problems and providing a range of realistic options that offer customers the flexibility and freedom to choose a solution that suits their timescale and budget. Its services include component supplies, component repairs, lessor support, flight simulation hardware support, consignment stock management and global aircraft logistics. With decades of expertise in global aviation logistics, the expert team works with trusted MROs, OEMs, and aftermarket suppliers around the world to offer 24/7 support to its global customer base. Artemis' headquarters are based near to Gatwick in London, UK with hubs operating in Los Angeles, Miami and Asia. Website: www.artemisaerospace.com Photo: https://mma.prnewswire.com/media/2680363/Artemis_Aerospace.jpg View original content to download multimedia:https://www.prnewswire.co.uk/news-releases/artemis-aerospace-achieves-a-kings-award-for-enterprise-302447155.html © 2025 PR Newswire Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/applied-aerospace-recognized-by-rtx-with-premier-performance-award-for-collaboration--customer-service-302444845.html",
    "url_mobile": "",
    "title": "Applied Aerospace Recognized by RTX with Premier Performance Award for Collaboration & Customer Service",
    "seendate": "20250502T124500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "STOCKTON, Calif. , May 2, 2025 /PRNewswire/ -- RTX, a business segment of Raytheon, recognized Applied Aerospace as one of its top performing industry suppliers. Applied Aerospace is a proven manufacturer of composite, metallic, and polymer solutions for commercial and military spacecraft, aircraft, and ground-based systems, and has been serving business segments of Raytheon as a supplier for over 20 years. Each year, as part of the RTX Performance+ Program, key suppliers are selected for their outstanding performance, contribution, and exceptional value. This award marks the fifth time Applied Aerospace has been identified as a top performer. RTX has recognized Applied Aerospace with a Premier Award for performance in 2024 and overall excellence in Collaboration & Customer Service. The Premier Award is an annual recognition platform for suppliers with superior performance that have provided exceptional value to RTX in one of the five key categories: Cost Competitiveness, Technology & Innovation, Business Management, Collaboration / Customer Service, and Sustainability. \"Listening to and delivering for our customers is a core tenant of the Applied Aerospace philosophy,\" said CEO Kevin Bidlack. \"We are truly honored to be recognized by RTX for Collaboration & Customer Service. We take great pride in meeting our customer's critical requirements and look forward to continuing to provide valued engineering and manufacturing solutions for the world's largest aerospace and defense company.\" About Applied Aerospace Aerospace systems demand precision engineering, expert manufacturing and unrelenting quality assurance. Government and commercial clients alike depend on Applied Aerospace solutions to perform at the velocities, forces, and temperatures of hypersonic and orbital flight. Applied Aerospace leverages an undeniable 70-year heritage in air, land, sea and space applications. By combining advanced engineering with proven techniques in composite and metallic manufacturing and assembly, Applied Aerospace builds fuselage and wing structures, actuated control surfaces, radomes, antennas and other complex solutions used in aviation, launch vehicles and spacecraft. Applied Aerospace is a portfolio company of Greenbriar Equity. For more information visit www.appliedaero.space Contact: Taylor Bloss , Marketing Manager [email protected] SOURCE Applied Aerospace 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.dailysabah.com/business/defense/turkiye-signs-defense-industry-specification-deal-with-uk",
    "url_mobile": "https://www.dailysabah.com/business/defense/turkiye-signs-defense-industry-specification-deal-with-uk/amp",
    "title": "Türkiye signs defense industry specification deal with united kingdom ",
    "seendate": "20250501T163000Z",
    "socialimage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2025/05/01/thumbs/1200x675/380391.jpg",
    "domain": "dailysabah.com",
    "language": "English",
    "sourcecountry": "Turkey",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Business Automotive Economy Energy Finance Tourism Tech Defense Transportation News Analysis Türkiye signs defense industry specification deal with UK by Anadolu Agency ISTANBUL May 01, 2025 - 2:32 pm GMT+3 Presidency of Defense Industries (SSB) President Haluk Görgün (L), Deputy Minister of National Defense Musa Heybet (R) and the U.K. Minister of Defense Procurement and Industry Maria Eagle sign the agreement, London, U.K., April 30, 2025. (AA Photo) by Anadolu Agency May 01, 2025 2:32 pm Türkiye and Britain signed the Türkiye-U.K. Defense Industry Council (TUDIC) Specification on Wednesday, which institutionalizes cooperation between the two countries in the defense industry field. Haluk Görgün, head of the Presidency of Defense Industries (SSB), Deputy Defense Minister Musa Heybet and Maria Eagle, U.K. minister for defense procurement and industry, met in London for the meeting, the SSB said on X. \"At the meeting, which was held with the will to deepen cooperation against the changing global security environment and common threats, a strong will was demonstrated further to advance the defense industry relations between the two countries,\" it said. Within the framework of the meeting hosted by Eagle, the TUDIC Specification, which institutionalizes the cooperation in the field of defense industry between the U.K. Defense Procurement and Industry Ministry, the Turkish National Defense Ministry and the SSB, was signed. \"We see this important meeting, which was held with the participation of Turkish and British defense industry companies, as an important step that will contribute to the further strengthening of the strategic defense industry partnership between Türkiye and the U.K.,\" it added. shortlink copied Last Update: May 01, 2025 5:32 pm KEYWORDS defense industry türkiye-uk relations türkiye united kingdom defense cooperation The Daily Sabah Newsletter Keep up to date with what’s happening in Turkey, it’s region and the world. SIGN ME UP You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Photos display devastation of 'disaster of century' in Türkiye PHOTOGALLERY"
  },
  {
    "url": "https://www.hurriyetdailynews.com/turkiye-inks-defense-industry-specification-deal-with-uk-208701",
    "url_mobile": "https://www.hurriyetdailynews.com/amp/turkiye-inks-defense-industry-specification-deal-with-uk-208701",
    "title": "Türkiye inks defense industry specification deal with united kingdom ",
    "seendate": "20250501T104500Z",
    "socialimage": "",
    "domain": "hurriyetdailynews.com",
    "language": "English",
    "sourcecountry": "Turkey",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Türkiye inks defense industry specification deal with UK ANKARA Ankara and London have signed the Türkiye -U.K. Defense Industry Council (TUDIC) Specification, which institutionalizes the cooperation between the two countries in the defense industry field. Haluk Görgün, head of the Turkish Defense Industries Secretariat, Turkish Deputy Defense Minister Musa Heybet and Maria Eagle, U.K. minister for defense procurement and industry, met in London for the meeting, Türkiye's Defense Industries Secretariat said on X. \"At the meeting, which was held with the will to deepen cooperation against the changing global security environment and common threats, a strong will was demonstrated to further advance the defense industry relations between the two countries,\" it said. Within the framework of the meeting hosted by Eagle, the TUDIC Specification, which institutionalizes the cooperation in the field of defense industry between the U.K. Defense Procurement and Industry Ministry, the Turkish Defense Ministry and the Defense Industries Secretariat, was signed. \"We see this important meeting, which was held with the participation of Turkish and British defense industry companies, as an important step that will contribute to the further strengthening of the strategic defense industry partnership between Türkiye and the U.K.,\" it added. In March, Turkish Defense Minister Yaşar Güler met with U.K. Defense Secretary John Healey, who paid an official visit to Ankara. During the meeting, regional defense and security issues were discussed. This visit came as the United Kingdom's Defense Ministry submitted a formal offer to Ankara for the procurement of 40 Eurofighter Typhoon jets, with Turkish authorities currently reviewing the proposal, Turkish defense sources stated on March 13. In December 2024, two Eurofighter jets from the U.K.'s Royal Air Force landed at a military base in Ankara, where Turkish authorities carried out an inspection. Additionally, Güler hosted the U.K.’s minister for defense procurement and industry during her visit to the Turkish capital. UK , deal ,"
  },
  {
    "url": "https://www.globenewswire.com/news-release/2025/04/25/3068506/28124/en/Singapore-s-Defense-Budget-to-Hit-21-6-Billion-by-2030-Driven-by-Advanced-Tech-Investments.html",
    "url_mobile": "",
    "title": "Singapore Defense Budget to Hit $21 . 6 Billion by 2030 , ",
    "seendate": "20250425T171500Z",
    "socialimage": "https://ml.globenewswire.com/Resource/Download/908fb457-7f8e-4a08-9081-5565e3dfb3d7",
    "domain": "globenewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Dublin, April 25, 2025 (GLOBE NEWSWIRE) -- The \"Singapore Defense Market - Size and trends, budget allocation, regulations, key acquisitions, competitive landscape and forecast, 2025-2030\" has been added to ResearchAndMarkets.com's offering. The report on Singapore Defense Market, spanning 2025 to 2030, anticipates a significant transformation in the strategic outlook of Singapore's defense landscape. Highlighting industry specifics, the report provides comprehensive insights into the market size, trends, budget allocation, regulatory environment, crucial acquisitions, and key players. Singapore's defense budget stands at an impressive $17.7 billion in 2025, showcasing a CAGR of 11.7% from 2021 to 2025. This upward trend underscores Singapore's dedication to fortifying its defense capabilities amidst evolving regional security challenges. Projections suggest the defense budget will grow to $21.6 billion by 2030, reflecting a CAGR of 4%, aligning with broader economic trends and the maturation of existing defense programs. A substantial focus has been placed on capital expenditure, with an average of 18.7% of the defense budget allocated for long-term assets. This strategic allocation highlights the country's commitment to modernizing its military arsenal and infrastructure. By 2025, capital expenditure reached $3.3 billion, with future estimates forecasting $4.1 billion by 2030. Key Highlights Singapore's strategic response to threats includes confronting terrorism from groups like Jemaah Islamiyah and engaging in international peace-building missions. Ongoing procurement programs include F-35B Lightning II, Multi-Role Combat Vessels (MRCVs), and Hunter AFV acquisitions. Scope This extensive analysis provides a nuanced view of Singapore's defense market over the next five years. Insights include: Defense Budget Assessment: Comprehensive analysis of budgetary allocations, key market drivers, and expenditure trends. Military Doctrine and Security Environment: Exploration of strategic alliances, geopolitical dynamics, and influencing factors on the security environment. Market Entry Strategy and Regulations: Insight into procurement policy, market regulations, and key defense procurement routes. Market Attractiveness and Emerging Opportunities: Evaluation of cumulative market values and high-value defense segments. Defense Platforms Import and Export Dynamics: Understanding of the value and volume contributions to imports and exports. Defense Platform Acquisitions: Current procurement schedules and rationales for major military platform acquisitions. Fleet Size: Detailed overview of current fleet sizes across military branches. Competitive Landscape: Profiles of leading defense companies, including detailed business overviews and financial outcomes. Reasons to Buy Identify promising investment avenues with trend analysis of the defense market. Understand underlying forces driving demand for defense and internal security sectors, identifying new opportunities. Enhance market comprehension through assessment of demand drivers, market trends, and technological advancements. Address major threats shaping the defense market, providing clarity on potential revenue expansions. Focus resources on ongoing governmental defense programs. Make informed business decisions with competitive insights into major defense equipment providers. Key Topics Covered: Executive Summary Defense Budget Assessment Defense Market Size Historic And Forecast Drivers Of Defense Expenditure Analysis Of Defense Budget Allocation Key Market Trends and Insights Military Doctrine and Security Environment Military Doctrine And Strategy Strategic Alliances and Geopolitics Political, Social and Economic Scenario Market Entry Strategy and Regulations Procurement Policy and Market Regulations Market Entry Routes Key Challenges Market Attractiveness and Emerging Opportunities Market Attractiveness By Defense Sector Top Defense Segments By Value Defense Platforms Import and Export Dynamics Defense Platforms Import Dynamics Defense Platforms Export Dynamics Defense Platform Acquisitions F-35B Next-Generation Armoured Fighting Vehicle (AFV) - Hunter AFV Multi-Role Combat Vessels (MRCVs) Invincible-class (Type 218SG) submarine Fleet Size Army Air Force Navy Competitive Landscape Defense Companies Operating In Singapore For more information about this report visit https://www.researchandmarkets.com/r/ekvrn1 About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends."
  },
  {
    "url": "https://www.theblaze.com/columns/opinion/how-dei-took-a-sledgehammer-to-the-us-militarys-war-ethos",
    "url_mobile": "",
    "title": "How DEI took a sledgehammer to the US military war ethos",
    "seendate": "20250425T041500Z",
    "socialimage": "https://www.theblaze.com/media-library/how-dei-took-a-sledgehammer-to-the-us-militarys-war-ethos.jpg?id=60022692&coordinates=0%2C84%2C0%2C85",
    "domain": "theblaze.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Photo by Smith Collection/Gado/Getty Images"
  },
  {
    "url": "https://www.theepochtimes.com/bright/to-the-moon-and-beyond-how-to-invest-in-the-aerospace-sector-5844968",
    "url_mobile": "",
    "title": "To the Moon and Beyond : How to Invest in the Aerospace Sector",
    "seendate": "20250424T160000Z",
    "socialimage": "https://img.theepochtimes.com/assets/uploads/2025/04/21/id5845030-shutterstock_1117210442-1080x720.jpeg",
    "domain": "theepochtimes.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Stocks To the Moon and Beyond: How to Invest in the Aerospace Sector The aerospace and defense sector is driven by innovation and benefits from long-term government contracts. 0 0 Copy Facebook X Truth Gettr LinkedIn Telegram Email Save Print ekapol sirachainan/Shutterstock Javier Simon 4/24/2025 | Updated: 4/24/2025 0:00 X 1 They say space is the final frontier. And even though America’s first space shuttle launched in the 1950s, leading aerospace companies today are still piercing deeper into the cosmos and stand at the forefront of cutting-edge technology that could seem out of this world. Many of these companies also have a reliable stream of revenue coming directly from the pocket of the Department of Defense. In fact, the U.S. Space Force’s top-secret plane made by Boeing recently made its safe return to Earth after spending more than 400 days in orbit, where officials said it had “broken new ground.” We had a problem loading this article. Please enable javascript or use a different browser. If the issue persists, please visit our help center. Share this article Leave a comment Javier Simon Author Javier Simon is a freelance personal finance writer for The Epoch Times. He specializes in retirement planning, investing, taxes, fintech, financial products and more. His work has been featured by major publications including Fox Business, The Motley Fool, NerdWallet, and Money Magazine. Author’s Selected Articles Should You Open a Roth IRA for Your Child? Nov 07, 2025 What Happens to Your Finances When You Die Without a Will? Nov 05, 2025 Top High-Yield ETFs to Boost Passive Income During Retirement Nov 03, 2025 Navigating the Risks in the S&P 500 Oct 31, 2025"
  },
  {
    "url": "https://www.investing.com/analysis/aerospace-giants-adjust-strategies-as-tariffs-disrupt-358-billion-market-200659828",
    "url_mobile": "https://m.investing.com/analysis/aerospace-giants-adjust-strategies-as-tariffs-disrupt-358-billion-market-200659828?ampMode=1",
    "title": "Aerospace Giants Adjust Strategies as Tariffs Disrupt $358 Billion Market",
    "seendate": "20250423T004500Z",
    "socialimage": "https://i-invdn-com.investing.com/redesign/images/seo/investingcom_analysis_og.jpg",
    "domain": "investing.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Get 100% ad-free experience Aerospace Giants Adjust Strategies as Tariffs Disrupt $358 Billion Market By The Tokenist Author Timothy Fries Stock Markets Published 04/22/2025, 03:54 PM Aerospace Giants Adjust Strategies as Tariffs Disrupt $358 Billion Market View all comments (3) 3 The Tokenist Articles ( 1265 ) | My Homepage Follow BA 0.21% GE -0.39% RTX 0.11% The aerospace industry in the United States is bracing for significant financial repercussions due to the trade tariffs imposed by President Donald Trump. Major players like Rtx Corp (NYSE: RTX ) and GE Aerospace (NYSE: GE ) are forecasting substantial fiscal impacts, with RTX predicting an $850 million hit and GE Aerospace estimating around $500 million. These tariffs, which include a 10% levy on certain imports and additional duties on steel and aluminum, are part of a broader shift in trade policies that affect U.S. manufacturers dependent on international supply chains. In response, GE Aerospace plans to counterbalance these costs through strategic savings and price hikes while maintaining its 2025 earnings outlook. CEO Larry Culp has actively engaged in discussions with Trump to address the aerospace sector’s trade surplus and explore the potential benefits of a tariff-free trading environment. As a traditionally duty-free industry, aerospace companies now face a cloud of uncertainty, with Boeing (NYSE: BA ) among those preparing to release quarterly results in this challenging economic climate. RTX, GE Aerospace Anticiate Substantial Impact from New Tariffs The imposition of new tariffs under former President Donald Trump has sent ripples through the U.S. aerospace industry, with major companies like RTX and GE Aerospace anticipating substantial financial impacts. RTX has projected an $850 million setback, while GE Aerospace estimates a $500 million hit due to these trade policies. These tariffs, which include a 10% levy on specific imports and additional duties on steel and aluminum, represent a significant shift in trade policy affecting U.S. manufacturers with global supply chain dependencies. In response to these challenges, GE Aerospace is implementing cost-saving measures and price increases to mitigate the financial burden, while still aiming to meet its 2025 earnings targets. RTX and GE Stock Brief The stock market has shown varied responses to the trade policy changes, with notable movements in the prices of RTX and GE Aerospace shares. RTX’s stock opened at $114.53 on April 22, 2025, down from the previous close of $126.12, and has fluctuated between a low of $113.97 and a high of $117.19 during the day so far. The company’s market capitalization stands at $156.95 billion, with a dividend yield of 2.0%. Meanwhile, GE Aerospace’s stock opened higher at $186.50 compared to the previous close of $178.35, reaching a high of $188.00 and a low of $182.215. The company’s market capitalization is $201.39 billion, with a dividend yield of 0.81%. Both companies have received positive recommendations from analysts, with RTX rated as a “Buy” and GE Aerospace as a “Strong Buy,” reflecting investor confidence despite the challenging economic environment. *** Neither the author, Tim Fries, nor this website, The Tokenist, provide financial advice. Please consult our website policy prior to making financial decisions. This article was originally published on The Tokenist. Check out The Tokenist’s free newsletter, Five Minute Finance , for weekly analysis of the biggest trends in finance and technology. Aerospace Giants Adjust Strategies as Tariffs Disrupt $358 Billion Market View all comments (3) 3 Latest comments Post Comment Guidelines Trade With A Regulated Broker Indices Commodities Bonds Stocks US 30 47,976.50 +48.5 +0.10% US 500 6,857.70 +11.1 +0.16% Dow Jones 47,927.96 +559.33 +1.18% S&P 500 6,846.62 +14.19 +0.21% Nasdaq 23,468.30 -58.87 -0.25% S&P 500 VIX 17.28 -0.32 -1.82% Dollar Index 99.405 +0.089 +0.09% Crude Oil WTI Futures 60.88 -0.16 -0.26% Brent Oil Futures 65.02 -0.14 -0.21% Natural Gas Futures 4.539 +0.011 +0.24% Gold Futures 4,128.62 +12.32 +0.30% Silver Futures 51.06 +0.316 +0.62% Copper Futures 5.0655 +0.0022 +0.04% US Soybeans Futures 1,133.88 +7.13 +0.63% U.S. 10Y 4.079 +0.009 +0.22% U.S. 30Y 4.681 -0.021 -0.45% U.S. 5Y 3.672 -0.038 -1.02% U.S. 3M 3.875 -0.002 -0.05% US 10Y T-Note Futures 112.94 -0.09 -0.08% Euro Bund Futures 129.23 0.00 0.00% 10-2 Yield Spread 31.32 +4.15 +15.27% AAPL 275.25 +5.82 +2.16% NVDA 193.16 -5.89 -2.96% GOOGL 291.31 +1.21 +0.42% TSLA 439.62 -5.61 -1.26% AMZN 249.10 +0.70 +0.28% NFLX 1,136.44 +16.37 +1.46% META 627.08 -4.68 -0.74% Most Popular Articles News Analysis Softbank Group shares tumble as Nvidia stake sale overshadows strong earnings By Investing.co ... Nov 12, 2025 Stock market today: S&P 500 closes higher, but Nvidia slip keeps gains in check By Investing.co ... Nov 12, 2025 BofA lists 16 stock opportunities away from AI By Investing.co ... Nov 11, 2025 S&P 500 to hit 7,100 by end-2025: Wells Fargo By Investing.co ... Nov 11, 2025 Gold prices near 3-week high; could reach $4,700/oz - UBS By Investing.co ... Nov 11, 2025 10 Beaten-Down Large-Cap Tech Stocks Offering Solid Upside Potential By David Wagner Nov 11, 2025 S&P 500: Wall Street Poised for Year-End Blast as Shutdown Progress Looms By Nigel Green Nov 10, 2025 3 Retail Stocks to Watch as Consumer Sentiment Weakens By Mike Zaccard ... Nov 11, 2025 Gold: $4K Breakout Faces First Real Test as Stocks and Sentiment Rise Together By Fawad Razaqz ... Nov 10, 2025 USD/JPY: Bulls Target Breakout Toward 159 After Testing Key Resistance Zone By Damian Nowis ... Nov 11, 2025 More News Market Movers Most Active Gainers % Losers % Name Last Chg. % Vol. NVDA 193.16 -2.96% 176.48 M AMD 237.52 -2.65% 61.34 M TSLA 439.62 -1.26% 60.53 M PLTR 190.96 -1.37% 49.82 M AAPL 275.25 +2.16% 46.21 M MSFT 508.68 +0.53% 17.98 M META 627.08 -0.74% 13.30 M Name Last Chg. % Vol. VTRS 11.20 +10.13% 11.95 M PSKY 16.74 +9.77% 15.86 M MRNA 26.41 +6.66% 11.71 M DXCM 58.13 +6.00% 9.74 M FDX 267.72 +5.45% 3.49 M MRK 90.95 +4.84% 12.58 M PFE 25.51 +4.57% 137.33 M Name Last Chg. % Vol. APP 594.91 -8.66% 7.45 M ENPH 30.84 -6.09% 8.31 M VST 179.16 -4.84% 4.22 M MU 241.11 -4.81% 22.62 M LRCX 159.18 -4.32% 9.14 M MRVL 89.33 -4.18% 13.54 M HPE 22.89 -4.15% 28.50 M Trending Stocks Name Last Chg. % Vol. NVDA 193.16 -2.96% 176.48M CRWV 88.39 -16.31% 76.90M NBIS 102.22 -7.03% 45.26M AMD 237.52 -2.65% 61.34M TSLA 439.62 -1.26% 60.53M Show more ProPicks AI AI-powered stock picks with a proven track record to beat the S&P 500 . Tech Titans Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Top Value Stocks Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Best of Buffett Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Energy Elite Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Financial Fortresses Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Quality Compounders Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Small-Cap Sprinters Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Healthcare Heroes Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Beat the S&P 500 Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Dominate the Dow Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Mid-Cap Movers Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Mexican Stock Exchange Leaders Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Best Brazilian Stocks Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Italian Market Elite Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy Alpha Germany Select Stocks in this Strategy aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa aaa aaaaaaa aaaa aaa Unlock Strategy _undefined_chat_widget_header Post Comment Guidelines Tools Calendars Economic Calendar Earnings Calendar Holiday Calendar US Economy Fed Rate Monitor Tool US Treasury Yield Curve More Tools Stock Screener Currency Converter Markets Ask WarrenAI New Stocks Picked by AI Watchlist Alerts Top Brokers New Breaking News Tools Install Our App Scan QR code to install app Risk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks. Before deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed. Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. Fusion Media and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website. It is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of Fusion Media and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website. Fusion Media may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers. © 2007- 2025 - Fusion Media Limited. All Rights Reserved."
  },
  {
    "url": "https://www.destructoid.com/ultimate-noob-defense-tier-list/",
    "url_mobile": "",
    "title": "Ultimate Noob Defense Noobs Tier List [ Heaven ] ",
    "seendate": "20250422T134500Z",
    "socialimage": "https://www.destructoid.com/wp-content/uploads/2025/04/noob-defense-tier-list.webp?quality=75",
    "domain": "destructoid.com",
    "language": "English",
    "sourcecountry": "Japan",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Image by Destructoid Category: Guides Roblox Ultimate Noob Defense Noobs Tier List [MAJOR UPD 1] Go from a noob to a pro by using only the best Noobs in Noob Defense! Matija Stojkovic | Published: Apr 28, 2025 06:17 am Just like in every other TD Roblox title, the variety of units you can use in Noob Defense is huge. Because of that, it can be hard to decide which Noobs to bring with you into the battle. So, to help you use your Coins wisely and clear stages efficiently, we prepared the following Noob Defense tier list below. Recommended Videos Table of Contents Noob Defense Tier List Noob Defense Noobs List How to Get New Noobs in Noob Defense Noob Defense Tier List FAQs Noob Defense Tier List A tier list of all Noobs in Noob Defense – Image via TierMaker S -tier: Sakura Samurai Noob, Bassist Noob, Rich Noob, Upgrade Engineer Noob, King of the Empire Noob, Fallen Angel Noob, Engineer Noob A -tier: Gladiator Angel Noob, Fallen Devil Noob, Lifesaver Noob, Angel Noob, Devil Noob, Samurai Noob B -tier: Hyper Laser Noob, Sniper Noob, Mafia Boss Noob, Laser Noob, Katana Noob C -tier: Gunslinger Noob, Assassin Noob, Slammer Noob, Pyromancer Noob D -tier: King Noob, Swordsman Noob, Fighter Noob, Soldier Noob, Noob When making the Noob Defense tier list, we ranked all Noobs currently available from best to worst depending on how useful they are overall for all game modes. Mainly, we used the DPS and the utility certain Noobs provide as the main ranking metrics. Noob Defense Noobs List Below is a list of all Noobs in Noob Defense sorted by their position on the tier list. We included some of their strengths and weaknesses as well to give more context on why we ranked them the way we did. Noob Pros & Cons Tier + Insane DPS + Very good range − Expensive S + Buffs the damage and cooldowns of nearby towers − Very expensive S + Excellent farm unit S + Very good overall S + Very high DPS + Decent range − Expensive to place S + Very good range + Amazing damage S + All-around good unit − Worse version of the Upgrade Engineer Noob S + Very good in the late-game + Decent support unit − Very short range A + Very high DPS + Decent range − Short range − Expensive A + Excellent support − Not that useful early on A + Good range + High DPS + Buffs nearby units A + Good DPS and range − Small AoE A + Decent DPS and range − A bit expensive to place and upgrade A + Good damage + Excellent range B + Amazing range + One of the best early-game units − Small AoE B + Decent range and damage − Falls off in the late-game B + Good range and damage + Very good early on B + Good early-game unit + Decent DPS − Small range B + Decent DPS and range − Only good in the early game C + Good single-target DPS − Small AoE and low range C + Decent DPS − Very low range C + Decent support unit − Low DPS C + Decent farm unit for the early-game − Really not that good in the current meta D − Low damage and range D + Ok DPS − Very low range D + Decent range − Low DPS D − Basically useless D How to Get New Noobs in Noob Defense The Noobs available on the banner in Noob Defense rotate every hour. You can get new Noobs in Noob Defense by summoning them using Coins or by completing special limited event stages . Each pull costs you 100 Coins , and the banner with available Noobs rotates every hour. So, if you want to get most of the Noobs, you will have to check every hour to see which ones are currently on the banner. That sums up our Noob Defense tier list. Now, you are ready to clear every stage in Noob Defense with ease. If you want to claim some free Coins and start rolling for new Noobs right away, then make sure to check out our Noob Defense codes . Noob Defense Tier List FAQs What are the best late-game Noobs in Noob Defense? The best late-game Noobs are Sakura Samurai Noob , Upgrade Engineer Noob , and King of the Empire Noob . What are good Noobs for the early game? Excellent early-game Noobs are the Sniper Noob , Mafia Boss Noob , and the Katana Noob . Post Tag: guides Roblox Destructoid is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy Join The Conversation More Stories To Read Category: Guides How to complete Untended Garden in ARC Raiders Arka Sarkar Arka Sarkar Category: Guides Today’s Spanish Wordle answer (November 2025) Kristina Timotic Kristina Timotic Category: Guides Board Kings: Board Dice Games free rolls (November 2025) Kristina Timotic Kristina Timotic Category: Guides Contexto answers (November 2025) Ana Mitic and others Ana Mitic and others Category: Guides Globle answer today (November 2025) Ana Mitic and others Ana Mitic and others Category: Guides Today’s Jumble answer (November 2025) Danilo Grbovic and others Danilo Grbovic and others Category: Guides How to complete Out of the Shadows in ARC Raiders Arka Sarkar Arka Sarkar Category: Guides FC 26 maintenance countdown (November 7): When will the servers come back Arka Sarkar Arka Sarkar Related Content Category: Guides All FC 26 UEFA Primetime players and release countdown Arka Sarkar Arka Sarkar Category: Guides How to complete A Warm Place to Rest in ARC Raiders Arka Sarkar Arka Sarkar Category: Guides All Witchful Thinking Star Path duties and rewards in Disney Dreamlight Valley Kacee Fay Kacee Fay Related Content Category: Guides All FC 26 UEFA Primetime players and release countdown Arka Sarkar Arka Sarkar Category: Guides How to complete A Warm Place to Rest in ARC Raiders Arka Sarkar Arka Sarkar Category: Guides All Witchful Thinking Star Path duties and rewards in Disney Dreamlight Valley Kacee Fay Kacee Fay Related Content Category: Guides All FC 26 UEFA Primetime players and release countdown Arka Sarkar Arka Sarkar Category: Guides How to complete A Warm Place to Rest in ARC Raiders Arka Sarkar Arka Sarkar Category: Guides All Witchful Thinking Star Path duties and rewards in Disney Dreamlight Valley Kacee Fay Kacee Fay Author Close Matija Stojkovic Digital Content Producer Matija's been obsessed with getting better at games for as long as he can remember. Whether it's climbing to Challenger in League of Legends or losing sleep over games like Hearts of Iron IV and Europa Universalis IV, he's always trying to min-max in everything he plays. On Roblox, he puts that same mindset into games like Anime Adventures, Anime Rangers X, and Anime Card Clash by diving deep into the mechanics to figure out what actually works. When he's not grinding games, he's probably watching anime or messing around on his electric guitar, trying (and occasionally failing) to nail anime openings and 90's Japanese rock'n' roll. twitter facebook"
  },
  {
    "url": "https://markets.financialcontent.com/stocks/quote?Symbol=321:41906723",
    "url_mobile": "",
    "title": "Invesco Aerospace & Defense ETF ( NYSE : PPA ) Stock Quote",
    "seendate": "20250421T184500Z",
    "socialimage": "",
    "domain": "markets.financialcontent.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Recent Quotes View Full List My Watchlist Create Watchlist Indicators Nasdaq Composite Standard & Poors 500 Gold Crude Oil Markets Stocks ETFs Tools Markets: Overview News Currencies International Treasuries Invesco Aerospace & Defense ETF (NY: PPA ) 154.81 -0.06 (-0.04%) Official Closing Price Updated: 8:00 PM EST, Nov 11, 2025 Add to My Watchlist Quote Overview Detailed Quote Charting Historical Prices News All News News Headlines Press Releases Research Quarterly Reports Insider Filings Other Filings Price and Volume Detailed Quote Volume 94,806 Open 154.74 Bid (Size) 154.03 (1,600) Ask (Size) 156.21 (1,600) Prev. Close 154.87 Today's Range 153.85 - 155.37 52wk Range 100.39 - 160.37 Shares Outstanding 410,700 Dividend Yield 1.18% Intraday 1 Week 1 Month 3 Month 1 Year 3 Year 5 Year Top News More News Why Boeing Stock Is Gaining Today October 14, 2025 Boeing edges higher on solid Q3 deliveries, conditional EU okay for the Spirit deal, and new PAC-3 seeker contracts. Via Benzinga US, Finland Strike Deal For 11 New Icebreaker Ships To Counter Russia, China In Arctic: 'We Need These Ships Very Badly' October 10, 2025 The United States and Finland have reached a deal for the U.S. Coast Guard to acquire up to 11 new icebreaker ships, a step intended to strengthen America's presence and security in the Arctic. Via Benzinga Performance YTD +35.3% +35.3% 1 Month -0.2% -0.2% 3 Month +4.8% +4.8% 6 Month +20.3% +20.3% 1 Year +24.3% +24.3% More News Read More Why 3 Defense ETFs Are Beating Wall Street Expectations With NATO On High Alert September 17, 2025 Via Benzinga Topics ETFs Lockheed Martin Counters Boeing's F-47 Victory With Cost-Effective F-35 Upgrade Using Sixth-Gen Technology September 13, 2025 Via Benzinga Boeing Faces Prolonged Strike As St. Louis Workers Reject Third Contract Proposal: Report September 12, 2025 Via Stocktwits Lutnick Says ‘Monstrous Discussion’ In Washington On Potential US Stake In Lockheed Martin, Other Defense Firms August 26, 2025 Via Stocktwits US Defense ETFs Could Gain Ground As Europe's War Premium Deflates August 20, 2025 Via Benzinga Topics ETFs Rocket Lab Stock Hits Record High After Citi Hikes Target Citing Neutron Momentum And Government Demand July 14, 2025 Via Stocktwits Boeing Stock Hits 15-Month High On Price Target Hike, Thai Tariff Deal Chatter July 09, 2025 Via Stocktwits Topics Government World Trade NATO's New 5% Target For Defense A Win for Trump; Carney Turns To Critical Minerals June 26, 2025 Via Benzinga Topics Government BlackRock Bets Big On Defense Companies Amid Escalating Geopolitical Tensions: Palantir, Lockheed Martin, Northrop Grumman Among Stocks In Focus June 24, 2025 Via Benzinga As US Equity Funds Bleed $18 Billion, Sector ETFs Offer Tactical Opportunities: XLK, XLI, ROBO In Focus June 20, 2025 Via Benzinga Topics ETFs Boeing Gets 3-Year Extension From FAA To Perform Specific Safety Checks In-House Under Strict Oversight May 29, 2025 Via Stocktwits Sikorsky Taps Lockheed Martin To Bolster S-92 Helicopter Support April 25, 2025 Via Benzinga Trump Calls On Boeing to 'Default' China Over Aircraft Returns April 24, 2025 Via Stocktwits Topics Economy Government World Trade Lockheed Can Unlock Significant F-35 Growth Potential With This Clever Pivot: Analyst April 23, 2025 Via Benzinga Defence Industry Stocks: The Greatest Investment Opportunity Since COVID? April 21, 2025 Via Talk Markets Topics ETFs Stocks / Equities Jacobs Secures Long-Term Air Force Deal To Lead Military Environmental Projects April 16, 2025 Via Benzinga EXCLUSIVE: This Defense Stock Could Hit $170 'Before Year-End,' Expert Explains Why March 18, 2025 Via Benzinga Defense Stocks In Focus As Trump Freezes Ukraine Military Aid: Here's A List Of Top Global Defense ETFs To Watch March 05, 2025 Via Benzinga Topics ETFs Government Trump May Stop All Military Aid To Ukraine After Tense Exchange With Zelenskyy: Report February 28, 2025 Via Benzinga Topics Government 4 ETFs In The Crosshairs As Defense Cuts Loom — Is It Time To Play Offense? February 19, 2025 Via Benzinga Topics ETFs Government CAE Stock Flies High After Q4 Revenue Beat, Board Overhaul: Retail’s Unswayed February 14, 2025 Via Stocktwits Northrop Grumman Stock Falls After 2025 Outlook, Q4 Sales Fails To Impress Wall Street, Retail’s Bearish January 30, 2025 Via Stocktwits Trump Cabinet Pick For Homeland Security, Kristi Noem, Begins Senate Confirmation Hearings January 17, 2025 Via Benzinga Topics Government Frequently Asked Questions Is Invesco Aerospace & Defense ETF publicly traded? Yes, Invesco Aerospace & Defense ETF is publicly traded. What exchange does Invesco Aerospace & Defense ETF trade on? Invesco Aerospace & Defense ETF trades on the New York Stock Exchange What is the ticker symbol for Invesco Aerospace & Defense ETF? The ticker symbol for Invesco Aerospace & Defense ETF is PPA on the New York Stock Exchange What is the current price of Invesco Aerospace & Defense ETF? The current price of Invesco Aerospace & Defense ETF is 154.81 When was Invesco Aerospace & Defense ETF last traded? The last trade of Invesco Aerospace & Defense ETF was at 11/11/25 08:00 PM ET What is the market capitalization of Invesco Aerospace & Defense ETF? The market capitalization of Invesco Aerospace & Defense ETF is 63.58M How many shares of Invesco Aerospace & Defense ETF are outstanding? Invesco Aerospace & Defense ETF has 64M shares outstanding. Stock Quote API & Stock News API supplied by www.cloudquote.io Quotes delayed at least 20 minutes. By accessing this page, you agree to the Privacy Policy and Terms Of Service . © 2025 FinancialContent. All rights reserved."
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65156264-dine-development-corporation-ddc-executive-named-dayton-business-journal-aerospace-defense-awards-honoree-200.htm",
    "url_mobile": "",
    "title": "Diné Development Corporation : DDC Executive Named Dayton Business Journal Aerospace & Defense Awards Honoree",
    "seendate": "20250418T150000Z",
    "socialimage": "https://stats.nwe.io/x/im?ref=WyI0djh4aWoiXQ&hit%2Csum=WyJlNWdxZCIsImU0eGFiIiwiNHY4eGlqIiwiNHY4eGlrIl0",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Nachrichten » Diné Development Corporation: DDC Executive Named Dayton Business Journal Aerospace & Defense Awards Honoree Push Mitteilungen ACCESS Newswire 18.04.2025 16:26 Uhr 513 Leser Artikel bewerten: ( 2 ) Diné Development Corporation: DDC Executive Named Dayton Business Journal Aerospace & Defense Awards Honoree Diné Development Corporation is pleased to announce that Dan Riggs, Chief Growth and Strategy Officer, has been named an Aerospace & Defense Award honoree by the Dayton Business Journal . DAYTON, OHIO / ACCESS Newswire / April 18, 2025 / Diné Development Corporation (DDC),?a Navajo Nation-owned IT, engineering, professional, and environmental solutions provider, is pleased to announce that Dan Riggs, Chief Growth and Strategy Officer, has been named an Aerospace & Defense Award honoree by the Dayton Business Journal . Dan Riggs DBJ Aerospace & Defense Award Dan Riggs DBJ Aerospace & Defense Award Riggs was one of seven Dayton-area business leaders selected for his outstanding influence in advancing the aerospace and defense industry. His leadership has been pivotal in positioning DDC as a growing force in the defense sector, particularly in support of the U.S. Air Force, DISA, and other key government customers. Under his strategic vision, DDC has significantly expanded its defense market presence, advanced its reputation as a premier provider of high-end IT and engineering, and strengthened its role in delivering mission-essential solutions in support of national defense initiatives. \"Over the past five years, Dan has played a central role in shaping our strategic direction and driving significant growth in the defense sector,\" stated Austin Tsosie, DDC Chief Executive Officer. \"His leadership, insight, and dedication have positioned DDC as a trusted DOD partner. This recognition is a well-deserved reflection of his impact not only on DDC, but also on the entire Dayton defense community.\" \"I'm honored to be recognized among such accomplished leaders in the aerospace and defense community,\" commented Dan Riggs. \"This recognition is a testament to the dedication of the entire DDC team to delivering high-impact solutions in support of our customers' critical missions. Our continued focus on expanding our defense footprint while penetrating into the aerospace market has been both purposeful and rewarding. I look forward to advancing our mission as we support our valued customers throughout the Dayton region and across the broader defense and aerospace landscape.\" Contact Information Katie von Allmen Senior Marketing Manager katie.vonallmen@ddc-dine.com SOURCE: Diné Development Corporation (DDC) © 2025 ACCESS Newswire Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://www.india.com/news/india/worlds-most-powerful-nations-list-released-us-at-top-indias-rank-will-fill-you-with-pride-china-pakistan-global-firepower-russia-south-korea-united-kingdom-france-7764054/",
    "url_mobile": "https://www.india.com/news/india/worlds-most-powerful-nations-list-released-us-at-top-indias-rank-will-fill-you-with-pride-china-pakistan-global-firepower-russia-south-korea-united-kingdom-france-7764054/amp/",
    "title": "World most powerful nations list released , US is at top , India rank will fill you with pride , China and Pakistan are ... ",
    "seendate": "20250418T123000Z",
    "socialimage": "https://static.india.com/wp-content/uploads/2025/04/QT-military-BEFUN.jpg",
    "domain": "india.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Tahir Qureshi Tahir Qureshi is a senior sub-editor at India.com with an experience of about two decades. He holds a master’s in English literature and a PG (Diploma) in Mass Communication. He has come to online j ... Read More"
  },
  {
    "url": "https://thehill.com/policy/defense/5252419-dod-suspensions-third-official/",
    "url_mobile": "https://thehill.com/policy/defense/5252419-dod-suspensions-third-official/amp/",
    "title": "Third top Defense Department official placed on leave amid leak probe",
    "seendate": "20250416T210000Z",
    "socialimage": "https://thehill.com/wp-content/uploads/sites/2/2025/03/AP25080629763168_222826-e1743079789430.jpg",
    "domain": "thehill.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Defense Third top Defense Department official placed on leave amid leak probe by Filip Timotija - 04/16/25 3:54 PM ET by Filip Timotija - 04/16/25 3:54 PM ET Share ✕ LinkedIn LinkedIn Email Email Suspensions at the Defense Department have continued, with a third top Pentagon official being placed on administrative leave amid an ongoing investigation into information leaks at the department. Colin Carroll, chief of staff to deputy secretary of Defense Steve A. Feinberg, was placed on administrative leave on Wednesday, a U.S. defense official told The Hill. The department did not have any more information to share. Carroll’s suspension came just a day after two of Defense Secretary Pete Hegseth’s advisers were suspended and escorted out of the Pentagon . On Tuesday, the Defense Department suspended and escorted out Dan Caldwell, Hegseth’s senior adviser, and Darin Selnick, the department’s deputy chief of staff. Both Caldwell and Selnick previously worked at Concerned Veterans for America, a nonprofit group previously headed by Hegseth. Carroll, a U.S. Marine Corps intelligence officer, previously worked at Anduril Industries, a defense contractor that specializes in autonomous systems, according to his LinkedIn. He also worked at Applied Intuition, a software company headquartered in California. Carroll deployed to Afghanistan four times as part of Operation Enduring Freedom. He graduated from the United States Naval Academy with an aerospace engineering degree and got his master’s degree from Georgetown University’s Walsh School of Foreign Service. The Defense Department said in March that it kicked off an investigation into “recent unauthorized disclosures of national security information.” “This investigation will commence immediately and culminate in a report to the Secretary of Defense,” Hegseth’s chief of staff Joe Kasper wrote in a March 21 memo. “The report will include a complete record of unauthorized disclosures within the Department of Defense and recommendations to improve such efforts.” Caldwell, a Marine Corps veteran, was a public policy adviser at Defense Priorities, a foreign policy-focused think tank. Selnick, a retired Air Force officer, worked as a senior adviser to the Concerned Veterans for America from 2019 to 2024. Add as preferred source on Google Tags AIr Force Defense Department DoD Donald Trump Marine Corps pentagon Pete Hegseth Trump administration Copyright 2025 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Share ✕ LinkedIn LinkedIn Email Email More Defense News See All Defense UK suspends some intelligence sharing with US over boat strike concerns in major break by Filip Timotija 4 hours ago Defense / 4 hours ago Defense WWII veteran looks back at a century of life and seeing the end of the war by Jack Kessler 8 hours ago Defense / 8 hours ago Defense Obama surprised flight of veterans, families as they arrive in DC by Max Rego 10 hours ago Defense / 10 hours ago Defense Pentagon’s largest aircraft carrier arrives in Latin American region as tensions with Venezuela ramp up by Filip Timotija 11 hours ago Defense / 11 hours ago See All Video/Hill.TV See all Hill.TV See all Video Rising Rising: November 11, 2025 by TheHill.com 11/11/25 12:07 PM ET Rising / 10 hours ago Rising Rising: November 10, 2025 by TheHill.com 1 day ago Rising / 1 day ago Rising Rising: November 7, 2025 by TheHill.com 4 days ago Rising / 4 days ago See all Hill.TV See all Video Top Stories See All Court Battles Supreme Court extends SNAP payment pause over Jackson’s objection by Zach Schonfeld 4 hours ago Court Battles / 4 hours ago See All Most Popular Who could qualify for Trump’s suggested $2K tariff rebate? What’s happened ... Northern lights possible in much of US amid severe storm watch: What to know Jeffries, Democrats will offer 3-year extension of ObamaCare subsidies Federal THC ban send hemp companies scrambling The VA’s disability evaluation is failing veterans What to know about Trump’s $2K tariff check proposal Supreme Court extends SNAP payment pause over Jackson’s objection Deal to reopen government slowed by Paul objection on hemp language Live updates: House eyes Wednesday vote to end shutdown; justices keep SNAP ... Trump bristles as ‘affordability’ takes center stage Watchdog group asks for investigation into Lindsey Halligan over Comey, James ... Why a handful of Democratic senators decided to end the shutdown What’s in the Senate deal to reopen government? Schumer stares down progressive fury over handling of shutdown Fetterman knocks Democrats ‘celebrating crazypants’ Marjorie Taylor Greene California Republican criticizes Johnson’s handling of redistricting These are the 8 Senate Democrats who voted to end the shutdown Live updates: Bill to end government shutdown passes Senate, heads to House Load more"
  },
  {
    "url": "https://www.newsweek.com/japan-defense-budget-hike-us-trump-support-2060522",
    "url_mobile": "",
    "title": "US Ally Boosts Military Spending After Pressure From Trump",
    "seendate": "20250416T193000Z",
    "socialimage": "https://d.newsweek.com/en/full/2628416/us-defense-secretary-pete-hegseth-visits-japan.jpg",
    "domain": "newsweek.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "... By Ryan Chan China News Reporter Share Newsweek is a Trust Project member Japan, a key United States treaty ally, is expected to spend nearly 2 percent of its GDP on defense this year, as it faces pressure from the Trump administration. Newsweek reached out to the White House for comment. Why It Matters The U.S. signed a security treaty with Japan , which gives it the right to maintain a military presence there, protecting the ally. Japan also forms part of the First Island Chain , a U.S. containment strategy to restrict Russian and Chinese access to the Pacific Ocean. Last month, President Donald Trump questioned this security relationship, saying the treaty is not reciprocal as Japan does not have to \" protect us .\" On Wednesday, he announced that he will meet with Japanese officials to negotiate on trade and \" the cost of military support .\" Under Secretary of Defense for Policy Elbridge Colby suggested that Japan, which he called a \"vital ally,\" should boost its defense spending to 3 percent of GDP on defense \"as soon as possible,\" citing threats posed by China and North Korea. What To Know During a press conference on Tuesday, Japanese Defense Minister Gen Nakatani announced that the country will spend approximately 9.9 trillion yen ($70 billion) on defense, equivalent to 1.8 percent of GDP, for fiscal year 2025, from April 1 to March 31. Japan had spent about 1.4 percent and 1.6 percent of GDP on defense for fiscal years 2023 and 2024, respectively, or 6.8 trillion yen ($47 billion) and 7.95 trillion yen ($56 billion). Tokyo aims to boost its defense budget to 2 percent of GDP by fiscal year 2027. However, Nakatani said the latest ratio is based on GDP three years earlier, which would drop to the previous fiscal year level when compared to an estimated GDP for the current fiscal year. ... Japan's Kyodo News reported that increasing defense spending enables Japan to acquire counterstrike capabilities for striking enemy territory directly. This comes as China is modernizing its military power rapidly while North Korea continues its nuclear and missile programs. Before the Japanese government released its national security strategy policy guidelines in 2022, Japan's defense budget was limited to only 1 percent of GDP, or 5 trillion yen ($35 billion), by its constitution, which renounces war and puts the country on a pacifist course. Last week, Trump announced that the Pentagon 's budget would be raised to a record high of $1 trillion to build a strong military. \"You've got a lot of bad forces out there now,\" he said. What People Are Saying Japanese Defense Minister Gen Nakatani said at a press conference: \"As I have repeatedly stated, what is important about the drastic strengthening of defense capabilities is the content of the defense capabilities, and it is important for Japan to proceed with its own judgment and responsibility.\" President Donald Trump said: \"We have to protect Japan—and, by the way, they make a fortune out of us economically. We have to protect Japan, but under no circumstances do they have to protect us.\" U.S. Under Secretary of Defense for Policy Elbridge Colby said: \"Japan's strategic shift is critical and most welcome, but it is inadequate. Japan is moving toward spending approximately 2% of GDP on defense by 2027. This is manifestly inadequate.\" What Happens Next It remains to be seen whether the U.S. will pressure Japan to boost its defense spending further. Tokyo may choose to purchase military hardware from Washington to reduce the pressure. Request Reprint & Licensing Submit Correction View Editorial & AI Guidelines Add Newsweek as a preferred source on Google to see more of our trusted coverage when you search. Recommended For You News Russia ‘Human’ Robot Falls on Stage During Debut 3 min read News Venezuela’s Military Plans Revealed if US Attacks 3 min read World Black Soldiers Removed From WW2 Memorial Sparks Fury From Family 5 min read World Colombian President Floats New Latin American Union 3 min read World Photos Show US Ally Flexing Naval Power at North Korea 3 min read World Cargo Plane Crash: Videos Show Spiralling C-130 Fall From Sky 3 min read Related Podcasts Top Stories World Black Soldiers Removed From WW2 Memorial Sparks Fury From Family 5 min read News Gavin Newsom Reacts to Report of Trump’s New California Oil Drilling Plan 1 min read News Why Israel Is Still Striking Gaza and Lebanon After Ceasefires 9 min read News California Push for Transgender Sports Inclusivity May Face Olympic Setback 5 min read U.S. Donald Trump’s Negative Approval Rating Breaks Unwanted Record 5 min read NFL Disney Suffers $30 Million-Plus Loss Amid ESPN, YouTube TV Dispute 3 min read Trending Social Security New Bill Would Increase Social Security Payments: Full List of Cosponsors 4 min read Weather Winter Storm Warning as 10 Inches of Snow To Hit 4 min read NWS Winter Storm Warnings as 15 Inches of Snow To Strike 8 min read Social Security Social Security Bill May Increase Benefits by $200 Per Month 4 min read Live Blog Trump Says ‘Only People That Hate Our Country’ Want Government Shutdown to Continue 2 min read Opinion Opinion Conventional Wisdom: The Beginning of the End of the Shutdown Edition 3 min read Opinion Veterans Are an Untapped Workforce Essential to America’s Future | Opinion 5 min read Opinion The High Stakes of Open Enrollment—Why You Shouldn’t Forgo Coverage | Opinion 4 min read Opinion This May Be the End of the Democrats | Opinion 5 min read Opinion What if Climate Policy Started with Health—and Grew the Economy? | Opinion 5 min read"
  },
  {
    "url": "https://www.military.com/discounts/best-retail-military-discounts.html",
    "url_mobile": "https://www.military.com/discounts/best-retail-military-discounts.html?amp",
    "title": "The Best Retail Military Discounts",
    "seendate": "20250416T180000Z",
    "socialimage": "https://images01.military.com/sites/default/files/styles/full/public/2025-04/AP25067197476708.jpg",
    "domain": "military.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "An American flag flies outside a Costco Warehouse in Cranberry, Pa., Friday, March 7, 2025. (Gene J. Puskar/AP Photo) Military.com | By Heather Sweeney Updated October 09, 2025 Whether you’re buying necessities or splurging on something fun, shopping is so much easier when great deals lower the totals on your receipts. That’s why military families love the following retailers that offer deals and discounts exclusively for them. Keep in mind that some stores offer military discounts online and require verification of your military status, while others are only in-store discounts redeemed by presenting a military ID. Happy shopping! Costco This membership warehouse club has just about everything you could possibly need. From groceries to furniture to pharmacy items, Costco is perfect for one-stop shopping. And if you’re an active-duty military member, a Reservist or National Guard, a veteran, a military family member or a Gold Star family, you can get a $40 digital Costco Shop Card by joining Costco as a new Executive Member and enrolling in auto renewal of your annual membership. New Gold Star Members get a $20 digital Costco Shop Card. Home Depot and Lowe’s Whether you prefer Home Depot or Lowe’s for your home and garden needs, you’re in luck because both offer a 10% military discount every day. You can use these discounts online and in-store, but be aware that both stores require you to complete online verification of your military status before shopping. They also may have restrictions on eligible items, so be sure to read the fine print on what qualifies for the discounts. Kohl’s Kohl’s is a popular destination when shopping for clothes, shoes, jewelry and accessories, home and bedding, toys and more. And active-duty military members, veterans and their immediate families get a 15% discount on qualifying purchases made on Mondays. This discount is available in stores only. Michaels If you’re looking for art supplies, custom framing or holiday home decor, Michaels is the place to go. Get a 15% military discount both online and in stores every day after registering through your Michaels Rewards account. DEVIL-DOG Dungarees With a long history of supporting the military, DEVIL-DOG Dungarees sells jeans, shirts and other casual pants for men. They offer a 20% military discount off your entire purchase online after verification. Kirkland’s Kirkland’s has a wide variety of home decor, from rugs and curtains, to bed and bath, to kitchen and dining. Shop in-store and get a 10% military discount on all purchases with a military ID every day. This deal can even be applied with other promotions and discounts. Target Military shoppers love Target’s annual 10% military discount for Veterans Day . And while Target doesn’t offer a year-round discount, it does offer a special deal when you get its credit card. Get $50 when you’re approved for a Target Circle credit, debit or reloadable card and spend $50. Plus save an extra 5% every day. Stay Up-to-Date With Military Discounts Want the scoop on military discounts? From travel to phones and everything in between, troops, military families and veterans can stay on top of military discounts. Become a Military.com subscriber and get full access through our newsletter. Story Continues Related Topics: Deals and Discounts Active Duty Veterans National Guard Family and Spouse By Heather Sweeney About Heather Sweeney Heather Sweeney is a content editor at Military.com. She started writing about her life as a military spouse in 2010 on her popular blog, Riding the Roller Coaster . She joined Military.com’s SpouseBuzz team in 2012 and has been covering military discounts since 2013. Her debut memoir Camouflage: How I Emerged from the Shadows of a Military Marriage will be released in October 2025. Read Full Bio © Copyright 2025 Military.com. All rights reserved. This article may not be republished, rebroadcast, rewritten or otherwise distributed without written permission. To reprint or license this article or any content from Military.com, please submit your request here ."
  },
  {
    "url": "https://www.foxnews.com/us/bryan-kohberger-defense-aims-create-illusion-renewed-bid-toss-evidence-fmr-fbi-agent",
    "url_mobile": "https://www.foxnews.com/us/bryan-kohberger-defense-aims-create-illusion-renewed-bid-toss-evidence-fmr-fbi-agent.amp",
    "title": "Bryan Kohberger case : Fmr FBI agent says defense is trying to create  illusion  ",
    "seendate": "20250416T091500Z",
    "socialimage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/03/2023-06-27t214212z_1625175935_rc2vr1azae2u_rtrmadp_3_idaho-students-court-1-e1741272367981.jpg",
    "domain": "foxnews.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "close Video Former FBI agent says Bryan Kohberger defense is trying to create 'illusion' with renewed bid to toss evidence A former FBI agent told Fox News Digital that Bryan Kohberger's defense is trying to create an \"illusion\" with its new bid to toss evidence. Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. By entering your email and pushing continue, you are agreeing to Fox News' Terms of Use and Privacy Policy , which includes our Notice of Financial Incentive . Please enter a valid email address. By entering your email and pushing continue, you are agreeing to Fox News' Terms of Use and Privacy Policy , which includes our Notice of Financial Incentive . NEW You can now listen to Fox News articles! Bryan Kohberger's defense team is trying to create an \"illusion\" for future jurors with a new effort to get certain evidence tossed, a former FBI special agent said. Kohberger is charged with first-degree murder in the deaths of four students at the University of Idaho, including Kaylee Goncalves, 21; Xana Kernodle, 20; Madison Mogen, 21; and Ethan Chapin, 20. The former Washington State University student was also charged with one felony count of burglary. During an April 9 hearing, Judge Steven Hippler issued several rulings on motions filed by the defense. Hippler agreed partially to a motion from defense attorneys that would have blocked prosecutors from using words such as \"psychopath\" and \"sociopath\" during the trial. He cautioned, however, that the defense's request is similar to asking for \"an order that says the state shall not commit prosecutorial misconduct.\" Hippler said the word \"murderer\" could be used during closing arguments, but said terms like \"sociopath\" and \"psycho-\" can't be used unless an expert evaluation determines that these words describe Kohberger. WHAT WENT BRYAN KOHBERGER'S WAY — AND WHAT DIDN'T — AT EVIDENCE MOTIONS HEARING Bryan Kohberger enters the courtroom for a hearing Tuesday at the Latah County Courthouse in Moscow, Idaho, U.S. June 27, 2023. (August Frank/Pool via REUTERS) A doctor being used as a witness by the defense also agreed to hand over her findings on Bryan Kohberger's psychological state following a motion to preclude the death penalty based on the former Washington State University student's autism diagnosis. Kohberger's defense team also asked for \"inflammatory evidence\" to be left out of the trial, such as excessive use of crime scene pictures, but Hippler said he expects the evidence to reflect the \"brutal and horrific\" nature of the murders. A request from defense attorneys to have Kohberger's 2020 DeSales University essay about crime scene handling excluded from the trial was denied. SIGN UP TO GET TRUE CRIME NEWSLETTER During the hearing on April 9, defense attorneys also pushed to have audio from the 911 call made by the victim's roommate excluded from the trial. Hippler said he'd consider only allowing a redacted version of the call to be aired during the trial, but said he'll likely allow the 911 call audio to be played. Hippler said he'd rule on some motions after the hearing. Former FBI special agent Jonathan Gilliam told Fox News Digital that he thinks Kohberger's defense team is focused on creating doubt for future jurors. \"It's important to realize that [the defense] are not focused on his guilt or innocence. They're focused on showing or creating the illusion that the prosecution does not have a strong enough case to convict,\" Gilliam said. \"Whether or not these defense attorneys believe that Bryan Kohberger didn't murder these four individuals or not is irrelevant to the defense.\" IDAHO PROSECUTORS SAY THEY WILL CALL ‘A FEW’ OF BRYAN KOHBERGER’S FAMILY MEMBERS TO TESTIFY AT TRIAL Bryan Kohberger appears in court in Moscow, Idaho on Thursday, Oct. 26, 2023. Kohberger appeared in court in an attempt to overturn his grand jury indictment for the 2022 murders of four college students in their home. (Kai Eiselein/Pool) Anne Taylor, an attorney representing Bryan Kohberger, who is accused of killing four University of Idaho students in November 2022, arrives at a hearing in Latah County District Court, Wednesday, Sept. 13, 2023, in Moscow, Idaho. (AP Photo/Ted S. Warren, Pool) \"[The defense is] trying to influence the court so that the court ends up creating a barrier or a hurdle for the prosecution,\" he added. During the April 9 hearing, defense attorney Anne Taylor attempted to argue that the prosecution is intentionally slow-walking discovery, but later admitted that all requests from the defense have been provided. FOLLOW THE FOX TRUE CRIME TEAM ON X Gilliam said this was another attempt from Taylor to try and delay the process even more. \"They have been able to stall it over and over again,\" Gilliam said of Taylor's courtroom tactics. \"And I wonder if they're trying to do that, to put distance enough where they can get a more sympathetic jury, where they hope that some of the evidentiary stuff can be thrown out because maybe it's not as crystal clear as the prosecution wants.\" WATCH: Kohberger's team ‘throwing everything' at the wall, expert says Video Former homicide detective and Fox News contributor Ted Williams told Fox News Digital that Kohberger's defense team is trying to do everything they can to poke holes in the prosecution's arguments. CLICK HERE TO GET THE FOX NEWS APP Madison Mogen, top left, smiles on the shoulders of her best friend, Kaylee Goncalves, as they pose with Ethan Chapin, Xana Kernodle, and two other housemates in Goncalves' final Instagram post, shared the day before the four students were stabbed to death. (@kayleegoncalves/Instagram) A watchman parked outside 1122 King Road on Dec. 11, 2022, four weeks after four students were stabbed to death inside. (Michael Ruiz/Fox News Digital) \"What they're doing is they're throwing any and everything they can against the wall and they're hoping that something will stick,\" Williams said. \"But there's overwhelming evidence that put Bryan Kohberger not only in the house, but evidence that show that it's more likely than not that he is the killer of these four young students.\" GET REAL-TIME UPDATES DIRECTLY ON THE TRUE CRIME HUB A jury trial is scheduled for Aug. 11. Fox News Digital's Michael Ruiz contributed to this report. Adam Sabes is a reporter for Fox News Digital. Story tips can be sent to Adam.Sabes@fox.com and on Twitter @asabes10. True Crime The hottest stories ripped from the headlines, from crime to courts, legal and scandal. Arrives Weekly By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use , and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter!"
  },
  {
    "url": "https://www.yahoo.com/news/asu-named-military-friendly-school-173000406.html",
    "url_mobile": "",
    "title": "ASU named  Military Friendly School , wins Gold Award",
    "seendate": "20250415T200000Z",
    "socialimage": "https://media.zenfs.com/en/klst_san_angelo_articles_638/8451a020d57e764457927bf1726db0b7",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "SAN ANGELO, Texas (Concho Valley Homepage) — Angelo State University announced on April 15 that Victory Media had designated the university a “Military Friendly School” for the 16th time. While maintaining this title, ASU also received a Gold Award for ranking among the top of over 80 U.S. institutions that were awarded the “Military Friendly School” in the Large Public University category for 2025-2026. According to a press release from ASU, the university is one of five Texas institutions to win the Gold Award for this category for 2025-2026. “Earning Military Friendly Gold status is one of the distinctions we are most proud of because it makes a tangible impact on our student body,” said ASU President Ronnie Hawkins Jr. “We now have over 2,100 military-affiliated students enrolled at ASU, an increase of more than 750 students in the last year alone. Advertisement Advertisement Advertisement Advertisement ASU Percussion Ensemble set for spring concert performance The director of affiliated military and veteran services shared that the team strives to make sure military-affiliated students meet or exceed their goals while studying at ASU. “At Angelo State, we stress the importance of teamwork and shared responsibility in achieving our common mission,” said Phillip Nichelson, director of affiliated military and veteran services. “The entire ASU team works together to accomplish the mission of collective success for our military and veteran students and their families. We strive to ensure that during their time at ASU, our military-affiliated students will meet or exceed their expectations and satisfy their vision and their goals for the future.” An annual list of top Military Friendly Schools is provided to service members and their families to help them select the best university, college, or trade school that helps ensure a student’s success in the classroom and after graduation. Advertisement Advertisement Advertisement Advertisement Each year, U.S. institutions are evaluated using public data sources and responses from the proprietary Military Friendly School surveys. According to ASU, over 1,8000 schools completed the annual survey and only 830 were awarded the Military Friendly School designation. Angelo State student lands NSA internship in Maryland “Being a Military Friendly School lets our veterans, active duty military and their families know that we appreciate their service to our nation and are committed to their academic and career success,” said ASU President Hawkins. “It also shows potential military-affiliated students that wherever in the world they may live or be stationed, the best way to go is to go as a Ram!” Visit the Military Friendly website to see the complete 2025-2026 list. Advertisement Advertisement Advertisement Advertisement Copyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. For the latest news, weather, sports, and streaming video, head to ConchoValleyHomepage.com. About Our Ads"
  },
  {
    "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/04/ukraine-250411-dod01.htm",
    "url_mobile": "",
    "title": "Readout of Secretary of Defense Pete Hegseth Engagement With the Ukraine Defense Contact Group",
    "seendate": "20250412T123000Z",
    "socialimage": "",
    "domain": "globalsecurity.org",
    "language": "English",
    "sourcecountry": "Syria",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "April 11, 2025 Release Readout of Secretary of Defense Pete Hegseth's Engagement With the Ukraine Defense Contact Group In-Depth Coverage Chief Pentagon Spokesman Sean Parnell provided the following readout: Secretary of Defense Pete Hegseth virtually attended a UK- and German-led Ukraine Defense Contact Group (UDCG) today, April 11th. He joined ministers of defense and chiefs of defense from nearly 50 nations. They discussed progress towards achieving an enduring peace to the war in Ukraine and European nations leading efforts to support Ukraine's defense. https://www.defense.gov/News/Releases/Release/Article/4153078/ NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"
  },
  {
    "url": "https://www.globenewswire.com/news-release/2025/04/11/3060084/0/en/Reporting-on-transactions-in-Danish-Aerospace-Company-A-S-shares-by-persons-discharging-managerial-responsibilities-and-persons-closely-associated-with-them.html",
    "url_mobile": "",
    "title": "Reporting on transactions in Danish Aerospace Company A / S  ",
    "seendate": "20250411T131500Z",
    "socialimage": "https://ml-eu.globenewswire.com/Resource/Download/21ac1bc4-2814-440b-b8d3-c7178808429a",
    "domain": "globenewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "COMPANY ANNOUNCEMENT Odense, April 11, 2025 Company Announcement no. 55 – April 11, 2025 Reporting on transactions in Danish Aerospace Company A/S’ shares by persons discharging managerial responsibilities and persons closely associated with them Danish Aerospace Company A/S Company reg. (CVR) no.: 12 42 42 48 Danish Aerospace Company A/S (“ DAC ” or the “ Company ”) has received notification pursuant to article 19 of the Market Abuse Regulation (EU) no. 596/2014 of the below transaction related to shares in DAC made by persons discharging managerial responsibilities in DAC and/or persons closely associated with them. M. Goldschmidt Capital A/S, closely associated person to Søren Bjørn Hansen, Deputy Chair of the Board of Directors, has made the transactions described in the attached notification on the dates set out therein. Please see the attached files for further details. For further information, please contact: Danish Aerospace Company A/S: Thomas A.E. Andersen, CEO Mobile: +45 40 29 41 62 Certified Adviser: Baker Tilly Corporate Finance P/S Poul Bundgaards Vej 1 DK-2500 Valby Tel.: +45 33 45 10 00 www.bakertilly.dk About Danish Aerospace Company A/S Danish Aerospace Company A/S is a high-tech company operating in the area of advanced medical instrumentation and other engineering fields primarily within space applications. Our products are based on many years of specialized research and development. These consist of developing, integrating, and applying new as well as established medical technologies to the challenges of functioning and remaining reliable in space. These products and services bring the potential of space research and experience from space operations down to Earth for the benefit of all Mankind. Danish Aerospace Company A/S employs engineers and technicians who deliver full engineering, production and technical services for our customers. We have specialized in customer specific design, development, manufacturing, certification, maintenance, testing, and operations. The company has developed five generations respiratory equipment for spaceflight, cycle ergometers for astronauts’ countermeasures, adapted several commercial medical equipment for spaceflight and has participated in the development of the minus eighty-degree Celsius freezers. The Company’s quality system is certified in obligation to BS EN ISO 9001:2015, BS EN 9100:2018 technical equivalent to AS9100D that are the acknowledged standard in the area. Note: This is a translation of the corresponding company announcement in Danish. In case of discrepancies between the Danish wording and the English translation, the Danish wording prevails. Attachment PDMR notification - M. Goldschmidt Capital A_S"
  },
  {
    "url": "https://charter97.org/en/news/2025/4/10/636449/",
    "url_mobile": "https://qmt6jx.c97.org/en/news/2025/4/10/636449/",
    "title": "AFP : Pentagon Chief Will Join Ramstein Meeting Via Video Link",
    "seendate": "20250410T131500Z",
    "socialimage": "https://i.c97.org/ai/618555/aux-head-1731474678-20240326_media_2.jpg",
    "domain": "charter97.org",
    "language": "English",
    "sourcecountry": "Belarus",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "The Ukraine Defense Contact Group meeting will take place tomorrow in Brussels. U.S. Secretary of Defense Lloyd Austin will participate in the Ukraine Defense Contact Group meeting in the Ramstein format on Friday, April 11, via video link, AFP reports citing a Pentagon representative, as quoted by Kyiv Post . \"Secretary Austin plans to virtually participate in the UDCG meeting on Friday, April 11,\" the AFP source said. The Ukraine Defense Contact Group meeting in the Ramstein format will take place on April 11 in Brussels. Ukrainian President Volodymyr Zelensky stated that the meeting will discuss, among other things, strengthening Ukraine's air defense. The issue of contingents and new defense packages will also be raised. On April 3, Defense News, citing sources in the U.S. administration, reported that U.S. Secretary of Defense Lloyd Austin would not participate in the upcoming Ukraine Defense Contact Group Ramstein meeting on April 11 in Brussels. PATREON Support the website Write your comment 7 You can support the website Charter97.org MULTI-CURRENCY ACCOUNT FOR ASSISTANCE: Bank's name: Bank Millennium S.A. Address: ul. Stanislawa Zaryna, 2A, 02-593, Warszawa IBAN: PL97116022020000000216711123 SWIFT: BIGBPLPW Name of the account holder: Fundacja “KARTA ‘97” Purpose/title of payment: Donation for statuary aims You can contact us by the e-mail charter97@gmail.com Follow Charter97.org social media accounts Facebook YouTube X.com vkontakte ok.ru Instagram RSS Telegram"
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65073017-brooqly-inc-brooqly-inc-dba-dynamic-aerospace-systems-appoints-fedex-leader-in-logistics-to-board-of-directors-200.htm",
    "url_mobile": "",
    "title": "BrooQLy , Inc .: BrooQLy Inc . dba Dynamic Aerospace Systems Appoints FedEx Leader in Logistics to Board of Directors",
    "seendate": "20250409T163000Z",
    "socialimage": "https://www.finanznachrichten.de/chart-fedex-corporation-aktie-intraklein-tradegate.png",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Aktien » Nachrichten » FEDEX AKTIE » BrooQLy, Inc.: BrooQLy Inc. dba Dynamic Aerospace Systems Appoints FedEx Leader in Logistics to Board of Directors Push Mitteilungen FEDEX CORPORATION WKN: 912029 | ISIN: US31428X1063 | Ticker-Symbol: FDX Tradegate 11.11.25 | 21:00 231,75 Euro +0,30 % +0,70 Branche Logistik/Transport Aktienmarkt S&P 100 S&P 500 DJ Transportation 1-Jahres-Chart 5-Tage-Chart Realtime Geld Brief Zeit 231,10 231,60 11.11. 230,55 231,40 11.11. Nachrichten Analysen Kurse Chart Xetra-Orderbuch ACCESS Newswire 09.04.2025 18:02 Uhr 890 Leser Artikel bewerten: ( 2 ) BrooQLy, Inc.: BrooQLy Inc. dba Dynamic Aerospace Systems Appoints FedEx Leader in Logistics to Board of Directors New Independent Member from FedEx to Advise on Autonomous Logistics for Dynamic Deliveries Division PHOENIX, ARIZONA / ACCESS Newswire / April 9, 2025 / BrooQLy Inc., doing business as Dynamic Aerospace Systems (DAS) (OTC PINK:BRQL), is thrilled to announce the appointment of Jorge L. Torres to its Board of Directors. Torres, Vice President of Operations of FedEx México, joins the Board as an independent director, bringing over 30 years of industry expertise to support the growth of the company's Dynamic Deliveries division. Since 2012, Torres has overseen one of Latin America's most complex logistics networks. Under his leadership, FedEx successfully integrated Multipack. Recognized as one of Mexico's most trusted and influential logistics leaders, Torres has a proven track record of operational excellence, innovation, and employee engagement. \"We are excited to welcome Jorge L. Torres to our Board of Directors,\" said the current Board in a joint statement. \"His extensive experience at FedEx and deep understanding of logistics operations make him an exceptional strategic advisor. Jorge's insights will be instrumental as we expand our Dynamic Deliveries division and pioneer autonomous delivery technologies at scale.\" Torres holds an MBA from EGADE Business School and is widely regarded for his leadership. His appointment reflects Dynamic Aerospace's focus on building a world-class board to drive innovation and operational excellence. The Dynamic Deliveries division of DAS focuses on developing autonomous logistics technologies to enhance efficiency, reliability, and sustainability in aerospace and delivery operations. Jorge will provide strategic guidance on integrating autonomous systems into real-world logistics frameworks, leveraging his extensive industry knowledge. BrooQLy Inc. dba Dynamic Aerospace Systems continues to strengthen its leadership team as it drives innovation in the aerospace sector. The addition of Jorge follows the recent appointment of Ron J. Rich, a Honeywell Aerospace executive, underscoring DAS's commitment to assembling a world-class board to support its ambitious growth plans. About BrooQLy Inc. dba Dynamic Aerospace Systems (DAS) BrooQLy Inc., operating as Dynamic Aerospace Systems (OTC PINK:BRQL), is a forward-thinking aerospace company dedicated to advancing autonomous systems and next-generation aerospace technologies. With its Dynamic Deliveries division, DAS is redefining logistics through innovative, scalable solutions that address the evolving needs of the global market. www.dynamicaerosystems.com Media Contact: Shannon Rigney, VP: IR@dynamicaerosystems.com Links: LinkedIn Profile - Jorge L. Torres https://www.linkedin.com/in/jorgeltorresa/ His professional profile detailing his role as Vice President of Operations of FedEx Mexico and career highlights. SOURCE: BrooQLy, Inc. © 2025 ACCESS Newswire Nachrichten zu FEDEX CORPORATION Zeit Aktuelle Nachrichten 00:35 FedEx Projects Earnings Growth, Operational Resilience Ahead of Holiday Season Di FedEx Forecast Buoys Investor Confidence Di ROUNDUP/Aktien New York Schluss: Dow weiter erholt - Nasdaq-Stimmung getrübt NEW YORK (dpa-AFX) - Nach einem starken Wochenauftakt wegen der Aussicht auf einen Kompromiss im US-Haushaltsstreit ist es am Dienstag an den US-Börsen durchwachsen weiter gegangen. Die größer werdende... ► Artikel lesen Di FedEx stellt Gewinnwachstum in Aussicht und zerstreut Sorgen vor schwachem Weihnachtsgeschäft Di FedEx rallies after issuing favorable guidance amid the holiday rush Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://news.ku.edu/news/article/all-ku-campuses-named-2025-2026-top-military-friendly-schools",
    "url_mobile": "",
    "title": "Featured news and headlines",
    "seendate": "20250409T133000Z",
    "socialimage": "https://news-archive-assets.ku.edu/data/51/86/01jrbeqe89m7fzz9cekthz3gvt.jpg",
    "domain": "news.ku.edu",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "All KU campuses named 2025-2026 top Military Friendly Schools A KU ROTC student stands vigil in front of the Campanile. Credit: KU Marketing Wed, 04/09/2025 author April Blackmon Strange Share Share by Email Share on LinkedIn Share on Facebook Share on Twitter LAWRENCE — All University of Kansas campuses have received top rankings among Tier 1 research institutions in the annual “Military Friendly Schools” survey, the longest-running review of college and university investments in serving military-affiliated students. The KU School of Medicine-Wichita campus was named the No. 8 Military Friendly and No. 8 Military Spouse Friendly School, and the KU Lawrence campus was ranked the No. 9 Military Friendly and No. 9 Military Friendly Spouse School. KU Medical Center, the School of Medicine and Nursing-Salina campus and the Edwards Campus in Overland Park all earned Gold designations as Military Friendly Schools and Military Spouse Friendly Schools. Institutions earning the Military Friendly School designation were evaluated using public data sources and survey information. More than 1,800 institutions participated in the 2025-2026 survey, with 830 earning special awards for going above the standard. “I believe this is the first time all schools’ campuses were considered for separate designations,” said April Blackmon Strange, director of the Lt. Gen. William K. Jones Military-Affiliated Student Center. “And to have every KU campus receive high rankings is a testament to the university’s dedication to serving our more than 2,200 veterans, service members, spouses, dependents and ROTC students.” The Military Friendly Schools list is created each year based on extensive research using public data sources from more than 8,800 schools nationwide, input from student veterans and responses to the proprietary, data-driven Military Friendly Schools survey from participating institutions. The survey questions, methodology, criteria and weighting were developed with the assistance of an independent research firm and an advisory council of educators and employers. The survey is administered for free and is open to all postsecondary schools that wish to participate. Rankings and survey criteria are available online and will be published in G.I. Jobs magazine's May and October issues. The Military-Affiliated Student Center at KU — a nearly 3,000 square foot center in Summerfield Hall — serves as a centralized resource for KU’s military-affiliated community. It includes a lounge with 24-7 access, study spaces, headquarters for the KU Student Veterans of America student organization, VA Work Study opportunities, staff to help with GI Bill benefits, military tuition assistance and more. The university is one of just 104 campuses nationwide to have the Department of Veterans Affairs VetSuccess on Campus program with a dedicated VA VSOC counselor. In addition to the center, KU has several scholarships and an emergency fund for military-affiliated students as well as a Veterans Upward Bound program . KU also has a series of National Defense Initiatives facilitating education programming, research development and strategic partnerships. This includes being one of more than 50 universities to have all branches of ROTC and one of eight universities designated as a Department of Defense Language Training Center , which educates hundreds of service members in strategic languages and regional area studies. In 2024, the KU School of Law received a $1.6 million federal grant to establish a free legal aid clinic dedicated to serving veterans – the first of its kind in the state. The clinic is expected to open later this year. The KU Edwards Campus has a Veterans and Student Leadership Lounge. Additional KU academic programs and certificates are available both on Fort Leavenworth and in Leavenworth for military and civilians in the area. KU also has a 4,000-member Veterans Alumni Network . Wed, 04/09/2025 author April Blackmon Strange Media Contacts April Blackmon Strange Lt. Gen. William K. Jones Military-Affiliated Student Center 785-864-6715 ablackmon@ku.edu Share Share by Email Share on LinkedIn Share on Facebook Share on Twitter"
  },
  {
    "url": "https://www.asiaone.com/asia/south-korea-says-it-fires-shots-after-north-korean-soldiers-cross-demarcation-line",
    "url_mobile": "",
    "title": "South Korea says it fires shots after North Korean soldiers cross demarcation line",
    "seendate": "20250408T121500Z",
    "socialimage": "https://media.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Apr2025/0408_NKOREA.jpg?itok=S76WbV9g",
    "domain": "asiaone.com",
    "language": "English",
    "sourcecountry": "Singapore",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "asia South Korea says it fires shots after North Korean soldiers cross demarcation line South Korea's military said that it had fired warning shots after North Korean soldiers violated the military demarcation line before returning. PHOTO: Reuters file"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-unveils-enhanced-self-service-solutions-at-passenger-terminal-expo-302420845.html",
    "url_mobile": "",
    "title": "RTX Collins Aerospace unveils enhanced self - service solutions at Passenger Terminal Expo",
    "seendate": "20250408T110000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Integrated, end-to-end airport solution enables a seamless travel experience MADRID , April 8, 2025 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX ) business, has unveiled enhancements to its SelfServ™ platform, an integrated Common Use Self Service (CUSS) solution designed to streamline both the passenger travel experience and airport operations. Integrating both check-in and bag drop, SelfServ empowers passengers to manage their own journey through Collins' new user-friendly kiosks. When combined with the SelfPass™ biometric identity solution, passengers can enroll their biometrics at the kiosk to enable secure and seamless processing at each touchpoint, from check-in and bag drop to security and boarding. As a common use offering, SelfServ enables airlines to share the same infrastructure, thereby reducing costs and improving space utilization within the airport. Carriers can also optimize their staffing by allowing a single agent to oversee multiple kiosks or bag drops, rather than dedicating an agent to each traditional desk. \"What sets SelfServ apart from other solutions is its integration within a broader portfolio of self-service and biometric technology solutions, allowing passengers to navigate the airport with ease,\" said Nicole White, vice president and general manager of Connected Aviation at Collins Aerospace. \"These lasted advancements represent a major step forward in our commitment to enhancing the passenger experience and helping airports and airlines meet the growing demand for more efficient operations and cost-effective travel solutions.\" Currently, more than 100 airlines are certified with the SelfServ platform, benefiting from its robust and scalable capabilities. Additionally, SelfServ is supported by a wide range of managed services offerings from Collins Aerospace, which help airports manage IT resources more effectively and mitigate associated risks. Collins is hosting demonstrations of its integrated self-service solutions and new kiosk at Passenger Terminal Expo in Madrid, Spain . About Collins Aerospace Collins Aerospace, an RTX business, is a leader in technologically advanced and intelligent solutions for the global aerospace and defense industry. Collins Aerospace has the extensive capabilities, comprehensive portfolio and broad expertise to solve customers' toughest challenges and to meet the demands of a rapidly evolving global market. About RTX RTX is the world's largest aerospace and defense company. With more than 185,000 global employees, we push the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2024 sales of more than $80 billion , is headquartered in Arlington, Virginia . For questions or to schedule an interview, please contact [email protected] SOURCE RTX 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.yahoo.com/news/south-korea-says-fires-shots-093151157.html",
    "url_mobile": "",
    "title": "South Korea says it fires shots after North Korean soldiers cross demarcation line",
    "seendate": "20250408T103000Z",
    "socialimage": "",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "SEOUL (Reuters) - South Korea's military said on Tuesday that it had fired warning shots after North Korean soldiers violated the military demarcation line before returning. \"Our military conducted warning broadcasts and warning shots after about 10 North Korean soldiers crossed the military demarcation line (MDL) in the eastern area of the demilitarised zone (DMZ) around 5:00 pm local time,\" the Joint Chiefs of Staff (JCS) said in a text message to reporters. \"Our military is closely monitoring the North Korean military's activity and taking necessary measures according to the operational procedures,\" JCS said. Advertisement Advertisement Advertisement Advertisement Some of the North Korean soldiers were armed, according to the South Korean military. The crossing, however, may have been by a mistake during reconnaissance activity ahead of planned work in the area, the Yonhap News Agency reported, citing a military official. On Monday, the South's military said about 1,500 North Koreans were working on barbed wire installations and land work in the demilitarised zone, as the North was conducting military exercises. In June 2024, there were at least three incidents of North Korean soldiers crossing the line amid an uptick in activity near the demarcation line. Advertisement Advertisement Advertisement Advertisement South Korea's acting President Han Duck-soo said on Friday the government would maintain a steadfast readiness posture against North Korea provocations, after the Constitutional Court ousted impeached President Yoon Suk Yeol. The two Koreas are still technically at war after their 1950-53 war ended in an armistice, not a peace treaty. (Reporting by Joyce Lee and Jihoon Lee; Editing by Andrew Cawthorne and Kim Coghill) About Our Ads"
  },
  {
    "url": "https://markets.financialcontent.com/stocks/quote?Symbol=321:2578429549",
    "url_mobile": "",
    "title": "Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF ( NYSE : EUAD ) Stock Quote",
    "seendate": "20250404T134500Z",
    "socialimage": "",
    "domain": "markets.financialcontent.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Recent Quotes View Full List My Watchlist Create Watchlist Indicators Nasdaq Composite Standard & Poors 500 Gold Crude Oil Markets Stocks ETFs Tools Markets: Overview News Currencies International Treasuries Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF (NY: EUAD ) 43.89 -0.59 (-1.33%) Official Closing Price Updated: 8:00 PM EST, Nov 11, 2025 Add to My Watchlist Quote Overview Detailed Quote Charting Historical Prices News All News News Headlines Press Releases Research Quarterly Reports Insider Filings Other Filings Price and Volume Detailed Quote Volume 121,998 Open 43.63 Bid (Size) 42.00 (700) Ask (Size) 43.90 (100) Prev. Close 44.48 Today's Range 43.63 - 44.01 52wk Range 24.24 - 47.64 Shares Outstanding N/A Dividend Yield 0.05% Intraday 1 Week 1 Month 3 Month 1 Year 3 Year 5 Year Top News More News EUAD vs. WDEF: Which ETF Is Best for a New Era of European Defense Spending? October 15, 2025 European defense spending is experiencing a renaissance. Yes, there are ETFs for that. Via The Motley Fool Topics ETFs US, Finland Strike Deal For 11 New Icebreaker Ships To Counter Russia, China In Arctic: 'We Need These Ships Very Badly' October 10, 2025 The United States and Finland have reached a deal for the U.S. Coast Guard to acquire up to 11 new icebreaker ships, a step intended to strengthen America's presence and security in the Arctic. Via Benzinga Performance YTD +79.9% +79.9% 1 Month -2.1% -2.1% 3 Month +4.7% +4.7% 6 Month +19.6% +19.6% 1 Year +68.1% +68.1% More News Read More 2 International ETFs Your Portfolio May Be Missing October 09, 2025 Via The Motley Fool Topics Artificial Intelligence ETFs Government Defense ETFs Find A New Weapon: The Algorithm September 23, 2025 Via Benzinga Topics Artificial Intelligence ETFs Law Of Unintended Consequences Hitting Stock Market, French Nuclear Weapons To Defend Europe March 06, 2025 Via Benzinga Why 3 Defense ETFs Are Beating Wall Street Expectations With NATO On High Alert September 17, 2025 Via Benzinga Topics ETFs Rocket Lab And Kratos Are Setting Defense ETFs On Fire July 12, 2025 Via Benzinga Topics Artificial Intelligence ETFs Trump Sparks New Chapter In Transatlantic Trade War: What The US Buys From Europe May 23, 2025 Via Benzinga Topics Government World Trade Tuttle Capital's Select STOXX Europe Aerospace & Defense ETF Surpasses $500 Million in Assets Under Management May 06, 2025 Via Newsfile Topics ETFs Leveraged ETFs Soar As Investors Seek 'Amplified Exposure And Quicker Returns:' Rate Bets, Tech Mania, And Geopolitical Shifts Drive Demand May 05, 2025 Via Benzinga Topics Artificial Intelligence ETFs Trump's Latest Move Could Wipe Out Gains In These 3 ETFs April 04, 2025 Via Benzinga Topics Government World Trade Frequently Asked Questions Is Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF publicly traded? Yes, Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF is publicly traded. What exchange does Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF trade on? Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF trades on the New York Stock Exchange What is the ticker symbol for Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF? The ticker symbol for Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF is EUAD on the New York Stock Exchange What is the current price of Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF? The current price of Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF is 43.89 When was Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF last traded? The last trade of Spinnaker ETF Series Select STOXX Europe Aerospace & Defense ETF was at 11/11/25 08:00 PM ET Stock Quote API & Stock News API supplied by www.cloudquote.io Quotes delayed at least 20 minutes. By accessing this page, you agree to the Privacy Policy and Terms Of Service . © 2025 FinancialContent. All rights reserved."
  },
  {
    "url": "https://www.iefimerida.gr/english/mitsotakis-unveils-greeces-defense-overhaul-parliament",
    "url_mobile": "https://www.iefimerida.gr/english/mitsotakis-unveils-greeces-defense-overhaul-parliament?amp",
    "title": "Mitsotakis Unveils Greece Defense Overhaul in Parliament , Focuses on Technology and Domestic Industry",
    "seendate": "20250402T071500Z",
    "socialimage": "https://www.iefimerida.gr/sites/default/files/styles/medium_article_image/public/2025-04/mitsotakis-bouli.jpg?itok=2doQGJgr",
    "domain": "iefimerida.gr",
    "language": "English",
    "sourcecountry": "Greece",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "ENGLISH Mitsotakis Unveils Greece’s Defense Overhaul in Parliament, Focuses on Technology and Domestic Industry Credit: Giannis Panagopoulos/EUROKINISSI NEWSROOM IEFIMERIDA.GR 02/04/2025 08:57 Greek Prime Minister Kyriakos Mitsotakis is presenting the country’s long-term defense strategy and armament program to Parliament today, outlining a military transformation driven by technological advancements and modern warfare. Mr. Mitsotakis will emphasize two main pillars: strengthening national defense through ongoing and planned military procurements, and integrating cutting-edge technology into the armed forces. ΤΟ ΑΡΘΡΟ ΣΥΝΕΧΙΖΕΙ ΜΕΤΑ ΤΗΝ ΔΙΑΦΗΜΙΣΗ Key upgrades include drones, advanced radar systems, missile and anti-submarine defense, and the \"Achilles Shield\" anti-drone air defense system, a project involving collaboration with Israel. The second pillar focuses on cyber defense and modern cyber warfare tactics, drawing lessons from the war in Ukraine. The government plans to enhance military capabilities through collaborations with research institutions and Greek defense firms, fostering innovation and developing domestically produced weapons systems. A key principle of the revamped program is the active participation of Greece’s domestic defense industry. Mr. Mitsotakis is expected to declare that \"no procurement will take place without Greek-made components or Greek workforce involvement.\" International defense contractors will be required to partner with local industries, including Hellenic Aerospace Industry, shipyards, and Greek Defense Systems. The government is reviewing a proposal from French defense giant Group Naval to establish a production line in Greece. ΤΟ ΑΡΘΡΟ ΣΥΝΕΧΙΖΕΙ ΜΕΤΑ ΤΗΝ ΔΙΑΦΗΜΙΣΗ Mr. Mitsotakis will also address internal party concerns following the initial exclusion of security forces from recent military salary increases. He is expected to outline a broader package of measures and explain the timing and rationale behind the pay raises announced by Defense Minister Nikos Dendias. He will stress the importance of defense and stability in Greece’s geopolitical strategy, while acknowledging the need for continued economic growth. While Mr. Mitsotakis will present the broad outlines of the defense program, classified details will be shared in a closed-door briefing for Parliament’s Defense and Foreign Affairs Committee, led by Mr. Dendias, in the coming weeks. By Yiannis Kantellis Ακολουθήστε το στο Google News και μάθετε πρώτοι όλες τις ειδήσεις Δείτε όλες τις τελευταίες Ειδήσεις από την Ελλάδα και τον Κόσμο, στο ΔΙΑΒΑΣΤΕ ΠΕΡΙΣΣΟΤΕΡΑ KYRIAKOS MITSOTAKIS ΡΟΗ ΕΙΔΗΣΕΩΝ"
  }
]