[
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Ghana-ready-to-partner-with-Saudi-Arabia-for-energy-security-Energy-Minister-1928750",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Ghana-ready-to-partner-with-Saudi-Arabia-for-energy-security-Energy-Minister-1928750",
    "title": "Ghana ready to partner with Saudi Arabia for energy security",
    "seendate": "20240502T090000Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/629/62904706.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 05 01 → Article 1928750 Business News of Wednesday, 1 May 2024 Disclaimer Source: classfmonline.com 2024-05-01 Ghana ready to partner with Saudi Arabia for energy security - Energy Minister « Prev Next » Comments (11) Listen to Article Share: Energy Minister, Dr. Matthew Opoku Prempeh and Minister for Energy of Saudi Arabia, Prince Al Saud The Minister of Energy, Dr. Matthew Opoku Prempeh , has expressed Ghana’s readiness to partner with Saudi Arabia in the quest to ensure energy security for the country. Energy security, he noted, is within the overarching context of Ghana’s economic growth. Dr Prempeh said this at a meeting with the Minister for Energy of Saudi Arabia, Prince Abdulaziz bin Salman bin Abdulaziz Al Saud, on the margins of the World Economic Forum’s Special Meeting in Riyadh, Saudi Arabia. The forum was on the theme, “Global Collaboration, Growth and Energy for Development”. Dr Prempeh’s participation at the forum was on the invitation of the Saudi Energy Minister. Discussions: The discussions with the Saudi Energy Minister were on potential collaboration in the energy sectors of the two countries, with a focus on Oil for Sustainability Programme, clean cooking initiatives as well as areas within the power sector value chain. Deepening frontiers Emphasising his visit to Riyadh, Dr Prempeh said, “I believe it will further deepen the frontiers of Ghana’s bilateral relations with the Kingdom of Saudi Arabia and I have no doubt, it will have far-reaching benefits for our energy future.” The forum As global warming continues at critical rates and energy access disparities persist, experts are increasingly sounding the alarm around the need to accelerate a sustainable and comprehensive energy transition. Catalysing the energy transition was a central theme of the Forum which took place from 28 to 29 April 2024. The gathering convened leading energy experts from across sectors to identify financial, technological and policy solutions aimed at scaling up the use of clean energy solutions while ensuring equitable growth. The meeting was also attended by dozens of energy ministers and commissioners from around the world, many of whom participated in public sessions. Related Articles: 37,000 football fields of forests lost each year – Report Private sector must be seen as a partner, not a competitor - Alex Dadey Trade-based money laundering topping the agenda GoldBod Jewellery gets new board; tasked to add value to Ghana's gold BoG's gold reserves hit 38.04 tonnes in October 2025 Read all related articles Comments: This article has 11 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/chinas-new-energy-industry-provides-world-with-high-quality-production-capacity-302131378.html",
    "url_mobile": "",
    "title": "China new energy industry provides world with high - quality production capacity",
    "seendate": "20240430T101500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "BEIJING , April 30, 2024 /PRNewswire/ -- A report from People's Daily Today, countries around the world are facing the challenges brought by climate change. Over 130 countries and regions have set carbon neutrality targets, and the development of new energy industries and the achievement of green and low-carbon transformation are common aspirations. In Thailand , Chinese electric vehicle brands are known by more and more people, and several Chinese car companies are expected to achieve localized production. In Kazakhstan , Chinese enterprises have turned wind into a resource, enabling the small town of Zhanatas with a population of only about 20,000 to catch up with the wave of new energy development. In Brazil , Chinese companies are investing in solar photovoltaic, onshore wind power, and hydropower projects, providing a stable source of clean electricity. China's continuous provision of high-quality new energy products is effectively promoting global green and low-carbon transformation. China is an important participant, contributor and trailblazer in the global climate governance process. It is also a significant producer of green products and a key engine driving global energy transformation. China has been vigorously promoting the development of ecological civilization and actively developing the new energy industry, demonstrating its determination and action in addressing climate change. The export of electric vehicles, lithium batteries, photovoltaic products, and more from China has not only enriched global supply and alleviated inflation but also provided significant support for countries to achieve carbon reduction goals and accelerate green transformation. According to the International Energy Agency's 2023 market report on renewable energy, global annual renewable capacity additions reached 510 gigawatts last year, growing at a faster rate than any other time in the past 30 years, and China was the largest driving force for the growth. Data released by China's National Energy Administration last year showed that over the past decade, China contributed over 40 percent to the growth in the world's non-fossil energy consumption. In 2022, China's exports of wind and solar power products helped other countries reduce carbon dioxide emissions by nearly 600 million tons. World Meteorological Organization secretary-general Celeste Saulo pointed out that comprehensive participation from major countries like China is necessary in addressing climate change. China adheres to open development and shares advanced green technologies with the world, significantly improving the accessibility of technology. From a global perspective, green and low-carbon development is a major direction of the innovation in energy technology. Through continuous research and efforts, China has become a global leader in several new energy technologies and equipment manufacturing. It has built the world's largest clean power supply system, with its hydropower, wind power, solar power, and biomass capacities consistently ranking first in the world for years. China's new energy generation technology is at the forefront globally, effectively driving down the costs of wind and solar power generation. Tim Gould , chief energy economist at the International Energy Agency, said that China possesses unique advantages in the development and application of clean energy technologies. China has achieved fruitful results in a number of major engineering projects, providing strong technological support for global energy transformation. China is actively promoting international cooperation in the field of new energy, aiming to build a new model of green and low-carbon energy transformation for mutual benefit. So far, China's overseas investment in non-fossil energy has surpassed that in fossil energy, leading to the successful completion of several landmark projects in clean, efficient, and high-quality green energy cooperation. China is steadily advancing the development of a green Belt and Road and has engaged in green energy project cooperation with over 100 countries and regions, providing strong support for their green and low-carbon energy development. China has proposed the Belt and Road Energy Partnership and has set up six regional energy cooperation platforms, promoting the establishment of global clean energy partnerships. These efforts have played an important role in promoting global clean energy transformation and ensuring global energy security. Erik Solheim , vice chairman of the Belt and Road Initiative International Green Development Coalition and former under-secretary-general of the United Nations, believes that China has made significant contributions to global renewable energy development, bringing innovation that drives economic development and green and low-carbon transformation to other developing countries. China's continuous provision of high-quality capacity in the new energy industry has made significant contributions to global green development, and it has been widely welcomed by the majority of countries worldwide. China will continue to inject strong impetus into global clean energy development through its products, technologies, and solutions, thereby making greater contributions to countries in achieving green development and building a clean and beautiful world. SOURCE People's Daily 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://electrek.co/2024/04/29/nevada-battery-energy-storage-where-a-coal-plant-used-to-be/",
    "url_mobile": "",
    "title": "Nevada put big battery energy storage where a coal plant used to be",
    "seendate": "20240430T010000Z",
    "socialimage": "https://i0.wp.com/electrek.co/wp-content/uploads/sites/3/2024/04/nevada-bess.jpg",
    "domain": "electrek.co",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Nevada utility NV Energy’s largest battery energy storage system sits on a former coal-fired power plant site and will save customers a lot of money. Swiss-US battery energy storage specialist Energy Vault (NYSE: NRGV) built the 220 MW/440 MWh grid-tied Reid Gardner Battery Energy Storage System (BESS) in Moapa, Nevada, 50 miles northeast of Las Vegas. Energy Vault will maintain the system. The new BESS is on the site of the former 557-megawatt (MW) coal-fired Reid Gardner Generating Station, which was demolished in 2019. It’s a two-hour energy storage system that stores and dispatches excess wind and solar power. It’s charged and discharged daily and dispatches stored renewable energy at peak consumption hours to help meet demand. Advertisement - scroll for more content NV Energy CEO Dough Cannon explained to local TV network KTNV: The hours that [NV Energy] really get concerned about are from about 5 pm to 9 pm. Because what happens, at that point, is the solar energy has really started to ramp off as the sun’s going down. And so, we have often had to go out to the market, the energy market, and buy energy to meet the needs between 5 pm and 9 pm. Over the last couple of years, on average, we’ve paid $250 a unit of energy during those hours. We look at a project like this, and this can deliver energy for closer to $100 an hour a unit of energy. Top comment by Luis Alejandro Masanti Liked by 7 people Both… the closed coal plant… and the storage plant… need to be connected to the grid. If they put the storage in another place… they would need to build a new connection to the grid. Just ‘logical’ place. View all comments The Inflation Reduction Act covered 40% of the project’s $250 million cost. Cannon told KTNV that thanks to the new BESS, the utility’s customers would see a 15-20% reduction in their bills by the end of 2024. Read more: US, other G7 countries to phase out coal by early 2030s If you live in an area that has frequent natural disaster events, and are interested in making your home more resilient to power outages, consider going solar and adding a battery storage system. To make sure you find a trusted, reliable solar installer near you that offers competitive pricing, check out EnergySage , a free service that makes it easy for you to go solar. They have hundreds of pre-vetted solar installers competing for your business, ensuring you get high quality solutions and save 20-30% compared to going it alone. Plus, it’s free to use and you won’t get sales calls until you select an installer and share your phone number with them. Your personalized solar quotes are easy to compare online and you’ll get access to unbiased Energy Advisers to help you every step of the way. Get started here . –ad* FTC: We use income earning auto affiliate links. More. Stay up to date with the latest content by subscribing to Electrek on Google News . You’re reading Electrek— experts who break news about Tesla , electric vehicles, and green energy , day after day. Be sure to check out our homepage for all the latest news, and follow Electrek on Twitter , Facebook , and LinkedIn to stay in the loop. Don’t know where to start? Check out our YouTube channel for the latest reviews."
  },
  {
    "url": "https://finance.yahoo.com/news/average-electricity-bill-costs-state-230016264.html",
    "url_mobile": "",
    "title": "Here What the Average Electricity Bill Costs in Your State",
    "seendate": "20240429T001500Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/3M72oN6OC2I0ccCI2z3cBw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/gobankingrates_644/de688d6905b4a017cd969fd94f368695",
    "domain": "finance.yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Here Are the Average Electricity Bill Costs in Your State ©Shutterstock.com Heather Taylor June 17, 2025 7 min read Depending on the state you live in, you may be spending much less or a lot more money on your monthly electric billing statement. Explore More: What Is the Estimated Median Income for the Upper-Middle Class in 2025? Discover Next: 6 Popular SUVs That Aren't Worth the Cost -- and 6 Affordable Alternatives Using data from the U.S. Energy Information Administration, GOBankingRates was able to determine each state’s average monthly electric bill costs. Additional factors analyzed include average monthly power consumption and the difference in percentage from the national monthly average. Take a look at every state’s average electric bill costs . DenisTangneyJr / iStock.com Alabama Average monthly bill: $162.67 Average monthly consumption: 1,112.27 kWh % difference from the national average: 18.9% Try This: 6 Easy and Affordable Home Renovation Tips From Joanna Gaines See More: 7 Savvy Ways To Budget for Home Remodeling Projects in 2025 Jacob Boomsma / Getty Images/iStockphoto Alaska Average monthly bill: $137.88 Average monthly consumption: 576.95 % difference from the national average: 0.8% Be Aware: Fidelity Says This Is a Surprising Risk of Holding Too Much Cash — Do You Have Too Much? dszc / Getty Images Arizona Average monthly bill: $148.44 Average monthly consumption: 1,058.92 % difference from the national average: 8.5% Sean Pavone / Getty Images/iStockphoto Arkansas Average monthly bill: $128.51 Average monthly consumption: 1,048.88 % difference from the national average: -6.1% zorazhuang / iStock/Getty Images California Average monthly bill: $144.81 Average monthly consumption: 490.74 % difference from the national average: 5.8% Sean Pavone / Getty Images/iStockphoto Colorado Average monthly bill: $94.65 Average monthly consumption: 662.02 % difference from the national average: -30.8% That’s Interesting: 7 Best Kirkland Signature Items for the Upper Middle Class To Buy From Costco traveler1116 / Getty Images/iStockphoto Connecticut Average monthly bill: $202.74 Average monthly consumption: 678.46 % difference from the national average: 48.2% DenisTangneyJr / Getty Images Delaware Average monthly bill: $138.04 Average monthly consumption: 877.51 % difference from the national average: 0.9% Ultima_Gaina / Getty Images Florida Average monthly bill: $168.35 Average monthly consumption: 1,107.08 % difference from the national average: 23% ferrantraite / iStock.com Georgia Average monthly bill: $141.67 Average monthly consumption: 1,034.85 % difference from the national average: 3.5% See More: I’m a Financial Advisor: My Wealthiest Clients All Do These 3 Things anouchka / Getty Images Hawaii Average monthly bill: $213.23 Average monthly consumption: 502.98 % difference from the national average: 55.8% Bret-Barton / Getty Images/iStockphoto Idaho Average monthly bill: $106.65 Average monthly consumption: 964.78 % difference from the national average: -22.1% xavierarnau / Getty Images Illinois Average monthly bill: $105.11 Average monthly consumption: 669.18 % difference from the national average: -23.2% Story Continues ©iStock.com Indiana Average monthly bill: $130.90 Average monthly consumption: 876.24 % difference from the national average: -4.3% Discover Next: Here’s How Much You Need To Earn To Be ‘Rich’ in Every State pabradyphoto / Getty Images Iowa Average monthly bill: $112.60 Average monthly consumption: 846.19 % difference from the national average: -17.7% digidreamgrafix / Getty Images/iStockphoto Kansas Average monthly bill: $117.91 Average monthly consumption: 881.01 % difference from the national average: -13.8% Kirkikis / Getty Images Kentucky Average monthly bill: $125.80 Average monthly consumption: 994.34 % difference from the national average: -8.1% Larry Gibson / Getty Images/iStockphoto Louisiana Average monthly bill: $142.96 Average monthly consumption: 1,237.86 % difference from the national average: 4.5% Learn More: The Cheapest Place To Buy a Home in Every State Sean Pavone / Getty Images/iStockphoto Maine Average monthly bill: $153.56 Average monthly consumption: 559.98 % difference from the national average: 12.2% Peeter Viisimaa / Getty Images/iStockphoto Maryland Average monthly bill: $148.45 Average monthly consumption: 894.43 % difference from the national average: 8.5% DenisTangneyJr / Getty Images/iStockphoto Massachusetts Average monthly bill: $165.55 Average monthly consumption: 559.15 % difference from the national average: 21% DenisTangneyJr / Getty Images Michigan Average monthly bill: $113.62 Average monthly consumption: 602.97 % difference from the national average: -17% Trending Now: The Living Wage a Family of Four Needs in All 50 States culbertson / Getty Images/iStockphoto Minnesota Average monthly bill: $110.78 Average monthly consumption: 751.93 % difference from the national average: -19% SeanPavonePhoto / Getty Images/iStockphoto Mississippi Average monthly bill: $153.07 Average monthly consumption: 1,157.32 % difference from the national average: 11.9% Sean Pavone / Getty Images/iStockphoto Missouri Average monthly bill: $126.09 Average monthly consumption: 1,002.50 % difference from the national average: -7.9% Indigoai / Getty Images/iStockphoto Montana Average monthly bill: $109.50 Average monthly consumption: 873.24 % difference from the national average: -20% For You: 3 Signs You’ve ‘Made It’ Financially, According to Financial Influencer Genesis Hinckley Davel5957 / Getty Images/iStockphoto Nebraska Average monthly bill: $111.52 Average monthly consumption: 995.62 % difference from the national average: -18.5% DenisTangneyJr / Getty Images Nevada Average monthly bill: $145.62 Average monthly consumption: 873.68 % difference from the national average: 6.4% DenisTangneyJr / Getty Images New Hampshire Average monthly bill: $168.79 Average monthly consumption: 599.55 % difference from the national average: 23.3% DenisTangneyJr / Getty Images New Jersey Average monthly bill: $113.21 Average monthly consumption: 639.46 % difference from the national average: -17.3% Find Out: Do You Have a $2K Quarter? Look Closely Before You Spend This 2004 Coin DenisTangneyJr / Getty Images New Mexico Average monthly bill: $91.20 Average monthly consumption: 658.64 % difference from the national average: -33.4% FilippoBacci / Getty Images/iStockphoto New York Average monthly bill: $125.80 Average monthly consumption: 565.53 % difference from the national average: -8.1% Kruck20 / iStock.com North Carolina Average monthly bill: $127.79 Average monthly consumption: 988.57 % difference from the national average: -6.6% DenisTangneyJr / Getty Images North Dakota Average monthly bill: $117.69 Average monthly consumption: 1,069.01 % difference from the national average: -14% Explore More: 6 Disney Collectibles You Can Flip for a Profit Sean Pavone / Getty Images/iStockphoto Ohio Average monthly bill: $124.68 Average monthly consumption: 810.59 % difference from the national average: -8.9% peeterv / Getty Images Oklahoma Average monthly bill: $129.10 Average monthly consumption: 1,068.73 % difference from the national average: -5.7% benedek / Getty Images Oregon Average monthly bill: $117.66 Average monthly consumption: 924.08 % difference from the national average: -14% Sean Pavone / Getty Images/iStockphoto Pennsylvania Average monthly bill: $143.10 Average monthly consumption: 790.52 % difference from the national average: 4.6% Read More: Costco, Walmart and Other Stores With Perks Retirees Need To Be Taking Advantage Of SeanPavonePhoto / Getty Images/iStockphoto Rhode Island Average monthly bill: $149.78 Average monthly consumption: 554.43 % difference from the national average: 9.5% Craig McCausland / Getty Images South Carolina Average monthly bill: $139.91 Average monthly consumption: 1,022.47 % difference from the national average: 2.2% DenisTangneyJr / Getty Images South Dakota Average monthly bill: $126.31 Average monthly consumption: 1,024.86 % difference from the national average: -7.7% Sean Pavone / iStock.com Tennessee Average monthly bill: $135.22 Average monthly consumption: 1,109.15 % difference from the national average: -1.2% Find Out: I’m a Retired Boomer — Here Are 10 Things I Always Buy From Dollar Tree To Save Money benedek / Getty Images/iStockphoto Texas Average monthly bill: $165.82 Average monthly consumption: 1,146.36 % difference from the national average: 21.2% DenisTangneyJr / Getty Images Utah Average monthly bill: $84.97 Average monthly consumption: 758.82 % difference from the national average: -37.9% SeanPavonePhoto / iStock.com Vermont Average monthly bill: $117.11 Average monthly consumption: 562.52 % difference from the national average: -14.4% DenisTangneyJr / Getty Images/iStockphoto Virginia Average monthly bill: $141.63 Average monthly consumption: 993.19 % difference from the national average: 3.5% Discover More: 6 Popular Collectibles That Have Skyrocketed in Value Sean Pavone / Getty Images/iStockphoto Washington Average monthly bill: $107.35 Average monthly consumption: 977.46 % difference from the national average: -21.5% DavidByronKeener / Getty Images/iStockphoto West Virginia Average monthly bill: $138.56 Average monthly consumption: 986.18 % difference from the national average: 1.3% Ron and Patty Thomas / Getty Images/iStockphoto Wisconsin Average monthly bill: $111.06 Average monthly consumption: 658.08 % difference from the national average: -18.8% DenisTangneyJr / Getty Images Wyoming Average monthly bill: $99.24 Average monthly consumption: 865.81 % difference from the national average: -27.5% Methodology: For this study, GOBankingRates analyzed electricity costs in each state to find the average costs. Each state was analyzed using U.S. Energy Information Administration’s data on the average monthly power used, average cost per kilowatt hour, number of customers and average monthly bill. The difference in dollar and percent from the national average monthly cost was calculated for each state. The data was broken up by end use, representing residential and commercial customers. All data was collected on and is up to date as of Feb. 19, 2025. More From GOBankingRates 7 McDonald's Toys Worth Way More Today 4 Companies as Much as Tripling Prices Due To Tariffs The 10 Most Reliable SUVs of 2025 Warren Buffett: 10 Things Poor People Waste Money On This article originally appeared on GOBankingRates.com : Here Are the Average Electricity Bill Costs in Your State View Comments Terms and Privacy Policy Privacy Dashboard More Info"
  },
  {
    "url": "https://www.businessinsider.com/top-10-energy-stocks-to-buy-best-performing-sector-2024-4",
    "url_mobile": "",
    "title": "Top 10 Energy Stocks to Buy As Best - Performing Sector in 2024",
    "seendate": "20240428T131500Z",
    "socialimage": "https://i.insider.com/662c19a00dfb1341e9fff680?&format=jpeg",
    "domain": "businessinsider.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Business Insider tells the innovative stories you want to know"
  },
  {
    "url": "https://www.theguardian.com/australia-news/live/2024/apr/05/australia-news-live-richard-marles-defence-spending-anthony-albanese-gaza-aid-worker-deaths-nsw-extreme-weather-deluge",
    "url_mobile": "https://amp.theguardian.com/australia-news/live/2024/apr/05/australia-news-live-richard-marles-defence-spending-anthony-albanese-gaza-aid-worker-deaths-nsw-extreme-weather-deluge",
    "title": "Australia news live : NSW braces for up to 300mm deluge ; IDF investigation into airstrike on aid convoy to be released in next 24 hours",
    "seendate": "20240404T211500Z",
    "socialimage": "https://i.guim.co.uk/img/media/282488d0c1cf0c9f6d92e442b5ca4f0769dda3b6/0_42_1553_932/master/1553.jpg?&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=9d589735fb1b81900564529043fae885",
    "domain": "theguardian.com",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "And that’s where we’ll leave you this evening. Here’s a wrap of what we learned today: The Department of Foreign Affairs and Trade has confirmed that two Australians are reported missing after the earthquake in Taiwan. Major flooding could threaten parts of Sydney with drivers warned to avoid non-essential travel as a deadly storm brings intense rainfall along the eastern seaboard. The Albanese government has released its national energy performance strategy to drive a high-energy performance economy, help consumers take control of their energy use and save on bills. Extra police from South Australia have been called to Alice Springs to help manage the ongoing youth curfew, due to end on Wednesday. The New South Wales shadow health minister, Matt Kean, has resigned from the Coalition for Conservation over its stance on nuclear energy. A New South Wales police operation that resulted in a man being shot dead by the force while suffering psychosis was significantly “flawed” , an inquest has found. The findings from an IDF investigation into the killing of seven aid workers, including Australian Zomi Frankcom, in an Israeli airstrike, will be made public on Saturday, according to Col Peter Lerner from the Israel Defense Forces. The Northern Territory’s attorney general is urging the nation’s leaders to put last year’s voice referendum result behind them and move to forge treaties with Indigenous people because “the time for sorry business is over”. Asbestos has been located at a second park in Melbourne’s Hosken Reserve in Coburg North. The defence minister, Richard Marles , has signalled that next month’s budget is likely to contain cuts to some programs within his portfolio Mona Foma, the Tasmanian summer festival run by the Museum of Old and New Art, has become the latest casualty of the Australian festival circuit, with Mona head David Walsh announcing on Friday that the festival “ends here”."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/duke-energy-to-implement-new-powerpair-pilot-program-for-pairing-home-solar-installations-with-battery-energy-storage-302108692.html",
    "url_mobile": "",
    "title": "Duke Energy to implement new PowerPair pilot program for pairing home solar installations with battery energy storage",
    "seendate": "20240404T190000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Customers could receive up to $9,000 as a one-time incentive to help lower the cost of installing solar and battery storage Programs explore new ways to help manage low carbon grids of the future CHARLOTTE, N.C. , April 4, 2024 /PRNewswire/ -- Duke Energy (NYSE: DUK ) is implementing PowerPair SM , a new incentive-based pilot program for installing home solar generation with battery energy storage in its Duke Energy Carolinas and Duke Energy Progress service areas in North Carolina . The company received approval from the North Carolinas Utility Commission (NCUC) for the program on January 11, 2024 . The one-time incentive-based program, designed to help make a home solar plus battery system more affordable for customers, offers up to $9,000 in incentives for residential customers who install a solar plus battery system. The total incentive is based on the type of solar array and battery installed. PowerPair was designed in collaboration with numerous stakeholder groups pursuant to the direction of the NCUC. \"PowerPair gives Duke Energy an added tool to provide more reliability to solar energy which in turn benefits all customers as North Carolina grows in population,\" said Lon Huber , Duke Energy senior vice president, Pricing and Customer Solutions. \"And by participating, customers are helping to support the state's clean energy goals.\" Some PowerPair customers and customers with existing battery storage may also participate in the company's expanded demand response programs. The Power Manager ® and EnergyWise ® Home programs will now include the newly approved battery control option, available in July. By enrolling, customers allow Duke Energy to temporarily adjust the system's operating setting a minimum of 30 times per year up to a maximum of 36 times per year, to provide stored electricity back to the grid. Participants receive a bill credit each month for enrolling a qualifying battery storage system and meeting program requirements, including internet connectivity. Customers may opt out of four events per year and still be eligible to receive bill credits. \"As we continue to strengthen our grid and bring clean energy resources online, our customers are important partners in our clean energy future – and can receive upfront and potential ongoing financial incentives for coupling solar power and battery storage on their residential systems,\" said Huber. \"These programs enable Duke Energy to maximize the use of popular consumer technologies to support the overall energy grid.\" Participants in the pilot will have two enrollment options. They can enroll in the PowerPair pilot on a residential solar choice rider (RSC) or through a net metering bridge rider (NMB) and receive a one-time incentive of up to $9,000 . NMB customers will be required to enroll in the new Power Manager and EnergyWise Home Battery Control option. They will receive the additional monthly bill credits for their participation. To help ensure incentive equity, PowerPair pilot participants will initially be selected through a random selection process (RSP), which will open May 10 . The RSP window for the PowerPair program will be four weeks in length, allowing customers time to apply on the Duke Energy website. Customers can sign up to receive program updates, view the approved battery vendor list and view information on equipment eligibility (not all systems will be eligible) at duke-energy.com/PowerPair . Participating PowerPair customers must employ a Duke Energy Trade Ally, a solar and battery installer that has been approved by Duke Energy. Customers can use the Company's Find It Duke program to locate approved companies knowledgeable about the program. Installers may apply to become a Duke Energy Trade Ally here . Ranked fourth in the nation for overall solar power, North Carolina has approximately 45,000 customers who generate power with solar panels with a total capacity of about 350 megawatts. The expanded demand response offerings will add to the existing 100 megawatts of residential flexible winter capacity in North Carolina. Duke Energy Duke Energy (NYSE: DUK ), a Fortune 150 company headquartered in Charlotte, N.C. , is one of America's largest energy holding companies. The company's electric utilities serve 8.4 million customers in North Carolina , South Carolina , Florida , Indiana , Ohio and Kentucky , and collectively own 54,800 megawatts of energy capacity. Its natural gas unit serves 1.7 million customers in North Carolina , South Carolina , Tennessee , Ohio and Kentucky . Duke Energy is executing an ambitious clean energy transition, keeping reliability, affordability and accessibility at the forefront as the company works toward net-zero methane emissions from its natural gas business by 2030 and net-zero carbon emissions from electricity generation by 2050. The company is investing in major electric grid upgrades and cleaner generation, including expanded energy storage, renewables, natural gas and advanced nuclear. More information is available at duke-energy.com and the Duke Energy News Center . Follow Duke Energy on Twitter , LinkedIn , Instagram and Facebook , and visit illumination for stories about the people and innovations powering our energy transition. Contact: Logan Kureczka 24-Hour: 800.559.3853 Twitter: @DE_LoganK SOURCE Duke Energy 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/a-stronger-electric-grid-enhanced-customer-services-and-environmental-obligations-are-some-of-the-drivers-of-duke-energys-indiana-rate-request-302108607.html",
    "url_mobile": "",
    "title": "A stronger electric grid , enhanced customer services and environmental obligations are some of the drivers of Duke Energy Indiana rate request",
    "seendate": "20240404T170000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Electric grid security and investments to serve a growing state are also key parts of the request Voluntary 'time-of-use' rates proposed to help manage customer bills PLAINFIELD, Ind. , April 4, 2024 /PRNewswire/ -- A modernized electric grid more resistant to power outages, hundreds of miles of new power lines, environmental responsibilities, increased electric grid security and new systems for customer convenience are some of the key parts of Duke Energy's Indiana rate request submitted to state utility regulators. \"Since our last base rate increase in 2020, we've invested $1.6 billion in our electric grid, power plants and overall system on behalf of our customers, including advanced technology that has helped prevent more than 185,000 power outages,\" said Duke Energy Indiana President Stan Pinegar . \"We know that utility costs can be a major part of a household and business's budget and that customers expect us to do our part to keep bills as low as possible,\" Pinegar said. \"We have kept our day-to-day operating costs flat since 2020 while we make long-term investments to serve customers. We also are proposing voluntary, 'time-of-use' rates to help manage customer bills. Fortunately, fuel costs for our electricity production have declined, and residential customer bills are about 25% lower than they were in late 2022.\" Filed April 4 with the Indiana Utility Regulatory Commission, the request is for an overall average bill increase of approximately 16%, which, if approved, would be added to bills in two steps, approximately 12% in 2025 and about 4% in 2026. The annual revenue increase would be $492 million . The increase will vary among consumers depending on the cost to serve different types of customers, such as residential and business. The total monthly impact of the two steps for a residential customer using 1,000 kilowatt-hours a month would be about 19%, or $27.63 . As a regulated business, Duke Energy's rates can only be changed after approval from state utility regulators, so there is no immediate impact from this request. There will be extensive public proceedings, including opportunities for customer input. A regulatory decision is possible in early 2025. To help customers manage their electric bills, Duke Energy is proposing time-of-use rates where customers can shift some of their power use to times of day when energy is less expensive. If the program is approved, it would be voluntary for residential, commercial and industrial customers interested in participating. Investments, improvements and upgrades Some of the components of Duke Energy's request include: Duke Energy is adding state-of-the-art sensors to its Indiana power lines. Much like the GPS in a car that can identify an accident ahead and reroute a driver around the incident, the technology can quickly identify power outages and alternate energy pathways to restore service faster for customers when an outage occurs. For a video of how the technology works, visit Self Healing Technology - Duke Energy (duke-energy.com) The company is hardening its system against severe weather to reduce power outages, including changing wood poles to steel, undergrounding power lines in targeted, outage-prone areas, and rebuilding miles of overhead lines. When last spring's tornadoes ripped through Indiana , steel structures on Duke Energy's Indiana system withstood the weather. In the wake of physical attacks to the electric grid nationally, the company is taking steps to improve physical security and protections at some of its key infrastructure delivering power to Indiana communities. Indiana's economy is growing, and Duke Energy expects to have more than 60,000 new residential and business customers by 2025. The company is adding 345 miles of new power lines and infrastructure to serve them. Federal rules require changes to the way we manage coal ash generated from electricity production and stored at our power plant sites. Duke Energy is closing its Indiana ash basins responsibly and in compliance with environmental regulations. The company needs to keep pace with evolving customer needs and expectations and has installed new systems, such as the ability for customers to initiate service at a new location online and receive service the same day. Energy assistance and bill management In addition to the proposed time-of-use rates, Duke Energy has more than a dozen energy assistance and bill-lowering tools, including: Usage Alerts that send customers a notification of how much electricity they are using and its cost so they can make adjustments before their billing period ends. Free Home Energy House Calls , where energy professionals assess a home for efficiency and provide homeowners with a toolkit of energy saving devices. Budget Billing, which helps ease the impact of higher seasonal bills by leveling out monthly payments. Interest-free payment plans for customers needing flexibility. Share the Light program funded by Duke Energy shareholders for qualifying customers who may be struggling to pay their energy bills. For more information about these programs and others, visit: duke-energy.com/LowerMyBills . There is also more information on this rate request at duke-energy.com/IN-Rates . Duke Energy Indiana Duke Energy Indiana, a subsidiary of Duke Energy, provides about 6,800 megawatts of owned electric capacity to approximately 900,000 customers in a 23,000-square-mile service area, making it Indiana's largest electric supplier. Duke Energy Duke Energy (NYSE: DUK ), a Fortune 150 company headquartered in Charlotte, N.C. , is one of America's largest energy holding companies. The company's electric utilities serve 8.4 million customers in North Carolina , South Carolina , Florida , Indiana , Ohio and Kentucky , and collectively own 54,800 megawatts of energy capacity. Its natural gas unit serves 1.7 million customers in North Carolina , South Carolina , Tennessee , Ohio and Kentucky . Duke Energy is executing an ambitious clean energy transition, keeping reliability, affordability and accessibility at the forefront as the company works toward net-zero methane emissions from its natural gas business by 2030 and net-zero carbon emissions from electricity generation by 2050. The company is investing in major electric grid upgrades and cleaner generation, including expanded energy storage, renewables, natural gas and advanced nuclear. More information is available at duke-energy.com and the Duke Energy News Center . Follow Duke Energy on Twitter , LinkedIn , Instagram and Facebook , and visit illumination for stories about the people and innovations powering our energy transition. Contact: Angeline Protogere Office: 317.838.1338 | 24-Hour: 800.266.3853 SOURCE Duke Energy 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.thedailystar.net/opinion/views/news/energy-price-hikes-make-clean-energy-compelling-bangladesh-3581516",
    "url_mobile": "https://www.thedailystar.net/opinion/views/news/energy-price-hikes-make-clean-energy-compelling-bangladesh-3581516?amp",
    "title": "Energy price hikes make clean energy compelling for Bangladesh",
    "seendate": "20240404T071500Z",
    "socialimage": "",
    "domain": "thedailystar.net",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Views Views Energy price hikes make clean energy compelling for Bangladesh Thu Apr 4, 2024 07:00 AM Last update on: Thu Apr 4, 2024 12:45 PM Shafiqul Alam Thu Apr 4, 2024 07:00 AM Last update on: Thu Apr 4, 2024 12:45 PM Photo: Reuters The Bangladesh government recently increased power tariffs for all consumer categories due to the upheavals caused by a significant gap between power generation costs and corresponding revenue. It also revised the natural gas price for power generation. While inflationary pressures will likely remain high in the wake of electricity and gas price hikes, different energy consumers will now find clean energy investment more compelling. A brief survey of around 40 industries by the Institute for Energy Economics and Financial Analysis (IEEFA) indicates that the industry sector has significant untapped energy efficiency potential. This is despite the fact that a good number of the surveyed industries have already installed efficient lights, motors and fans, variable-frequency drives, waste heat recovery boilers, etc. However, a considerable proportion of the surveyed industries are not utilising waste heat produced by their captive generators. Only a small number of industry samples use engine jacket water in chillers and water heaters. If all industries gradually install waste heat recovery boilers and start using engine jacket water in chillers and water heaters, they can save significant energy consumption per annum on an aggregate basis. For all latest news, follow The Daily Star's Google News channel. Read more What to make of Petrobangla’s new oil and gas exploration tender? The survey also finds that cutting costs and reaching sustainability targets are the two main drivers influencing industrial energy efficiency investment. Therefore, the recent increase in electricity tariffs—around 9.9 percent per kilowatt-hour (kWh) for medium and large industries—and gas price—2.5 percent per cubic metre for captive power generation —will likely motivate industries to foster energy efficiency further. Bangladesh's household sector consumed 55.69 percent of the grid electricity produced in FY2022-23. As such, increasing energy efficiency in this sector holds significant importance. Although many households are already accustomed to buying efficient appliances, 120W ceiling fans are still in the market when energy-efficient 35W ceiling fans are available. Perhaps people who can purchase efficient fans are unaware of the economics of using fans that consume less energy. A ballpark assessment shows that the payback period of a 35W ceiling fan costing Tk 6,490 has now come down to 3.3 years for a household with a monthly energy consumption of around 150kWh (assumptions: 10 hours of operation for 310 days a year and five percent VAT on energy bills). The payback period was 3.5 and 4.1 years in March 2023 and December 2022, respectively. Similarly, the payback for the same fan is now 3.1 years for a household consuming around 250kWh of energy per month. Such a financial return should motivate households to use ceiling fans with lower wattage. Households battling high energy tariffs should, therefore, assess the energy consumption of different appliances and their respective purchase prices to make prudent investment decisions. The recent power tariff adjustment is a boon for rooftop solar expansion, both in industries and commercial buildings. They can now enjoy more savings per kWh of energy. While the first movers had less savings, the lucrative rooftop solar should now make inroads into all industries and commercial buildings with enough space and load-bearing capacity. Regulatory intervention will further catalyse the accelerated adoption of energy efficiency measures and rooftop solar. The Sustainable and Renewable Energy Development Authority (SREDA), established in 2014 on the back of the growing need to promote renewable energy and energy efficiency in Bangladesh, has notable tasks ahead. As the combined rooftop solar capacity, under both net-metered and non-net-metered systems , is less than 200MW, SREDA can take a more proactive role through its solar help desk to assess what holds back industries and other establishments from investing in rooftop solar systems. Likewise, if SREDA organises periodic knowledge exchange events on successful energy efficiency projects, it can tempt designated energy consumers and industries to gradually implement the remaining low-hanging energy efficiency measures and beyond. Tellingly, SREDA should monitor the status of the mandatory submission of energy auditin g reports by different industrial sub-sectors applicable from 2023 and 2024, respectively. For households, the awareness level of energy efficiency should go beyond the general understanding that energy-efficient appliances save energy. Instead, they need to grasp that an appliance with the lowest wattage among its peers and serving the same needs is the most energy-efficient. Energy labels can help consumers choose the most efficient appliance. SREDA should coordinate with the government's Power Division to promptly approve and enforce the standards and labelling regulations. While energy efficiency and rooftop solar offer green energy investment opportunities, challenges in accessing finance or limited financing lead to negative knock-on effects. The Bangladesh Bank's refinancing scheme of Tk 400 crore ($36.44 million) is the least costly loan facility on offer for which environment-friendly projects of 70 categories compete. The rooftop solar financing facility of the Infrastructure Development Company Limited (IDCOL) is just a fraction of what the sector needs. Likewise, IDCOL's credit line of $256.5 million for RMG and textile sector energy efficiency, supported by the Green Climate Fund, is not enough. Conversely, the commercial banks' ability to deploy funds for loans at current market rates would not garner the interest from industries or commercial buildings. Read more We need smart policymaking, not smart blame games in the energy sector It is therefore necessary to mobilise finance at scale, drawing on the window of opportunities that different multilateral development banks offer. The Bangladesh Bank may create a dedicated low-cost financing scheme for rooftop solar like it developed for the brick kiln sector, supported by the Asian Development Bank (ADB). In the throes of energy sector challenges, rooftop solar and energy efficiency would help Bangladesh manage the situation better. And if the country can advance energy efficiency and rooftop solar, taking a sectoral approach, it will end up with manifold larger benefits than one may think of. The investment signal is favourable as Bangladesh is already in the high energy cost regime and tariffs will rise further. Shafiqul Alam is lead energy analyst at the Institute for Energy Economics and Financial Analysis (IEEFA). Views expressed in this article are the author's own. Follow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission . Related topic: energy price hike in Bangladesh solar rooftop in Bangladesh clean energy use in Bangladesh power tariffs in Bangladesh electricity price hike in Bangladesh natural gas price hike in Bangladesh energy efficiency in Bangladesh Click to comment Comments Comments Policy"
  },
  {
    "url": "https://www.thedailystar.net/opinion/views/news/energy-price-hikes-makes-clean-energy-compelling-bangladesh-3581516",
    "url_mobile": "https://www.thedailystar.net/opinion/views/news/energy-price-hikes-makes-clean-energy-compelling-bangladesh-3581516?amp",
    "title": "Energy price hikes makes clean energy compelling for Bangladesh",
    "seendate": "20240404T040000Z",
    "socialimage": "",
    "domain": "thedailystar.net",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Views Views Energy price hikes make clean energy compelling for Bangladesh Thu Apr 4, 2024 07:00 AM Last update on: Thu Apr 4, 2024 12:45 PM Shafiqul Alam Thu Apr 4, 2024 07:00 AM Last update on: Thu Apr 4, 2024 12:45 PM Photo: Reuters The Bangladesh government recently increased power tariffs for all consumer categories due to the upheavals caused by a significant gap between power generation costs and corresponding revenue. It also revised the natural gas price for power generation. While inflationary pressures will likely remain high in the wake of electricity and gas price hikes, different energy consumers will now find clean energy investment more compelling. A brief survey of around 40 industries by the Institute for Energy Economics and Financial Analysis (IEEFA) indicates that the industry sector has significant untapped energy efficiency potential. This is despite the fact that a good number of the surveyed industries have already installed efficient lights, motors and fans, variable-frequency drives, waste heat recovery boilers, etc. However, a considerable proportion of the surveyed industries are not utilising waste heat produced by their captive generators. Only a small number of industry samples use engine jacket water in chillers and water heaters. If all industries gradually install waste heat recovery boilers and start using engine jacket water in chillers and water heaters, they can save significant energy consumption per annum on an aggregate basis. For all latest news, follow The Daily Star's Google News channel. Read more What to make of Petrobangla’s new oil and gas exploration tender? The survey also finds that cutting costs and reaching sustainability targets are the two main drivers influencing industrial energy efficiency investment. Therefore, the recent increase in electricity tariffs—around 9.9 percent per kilowatt-hour (kWh) for medium and large industries—and gas price—2.5 percent per cubic metre for captive power generation —will likely motivate industries to foster energy efficiency further. Bangladesh's household sector consumed 55.69 percent of the grid electricity produced in FY2022-23. As such, increasing energy efficiency in this sector holds significant importance. Although many households are already accustomed to buying efficient appliances, 120W ceiling fans are still in the market when energy-efficient 35W ceiling fans are available. Perhaps people who can purchase efficient fans are unaware of the economics of using fans that consume less energy. A ballpark assessment shows that the payback period of a 35W ceiling fan costing Tk 6,490 has now come down to 3.3 years for a household with a monthly energy consumption of around 150kWh (assumptions: 10 hours of operation for 310 days a year and five percent VAT on energy bills). The payback period was 3.5 and 4.1 years in March 2023 and December 2022, respectively. Similarly, the payback for the same fan is now 3.1 years for a household consuming around 250kWh of energy per month. Such a financial return should motivate households to use ceiling fans with lower wattage. Households battling high energy tariffs should, therefore, assess the energy consumption of different appliances and their respective purchase prices to make prudent investment decisions. The recent power tariff adjustment is a boon for rooftop solar expansion, both in industries and commercial buildings. They can now enjoy more savings per kWh of energy. While the first movers had less savings, the lucrative rooftop solar should now make inroads into all industries and commercial buildings with enough space and load-bearing capacity. Regulatory intervention will further catalyse the accelerated adoption of energy efficiency measures and rooftop solar. The Sustainable and Renewable Energy Development Authority (SREDA), established in 2014 on the back of the growing need to promote renewable energy and energy efficiency in Bangladesh, has notable tasks ahead. As the combined rooftop solar capacity, under both net-metered and non-net-metered systems , is less than 200MW, SREDA can take a more proactive role through its solar help desk to assess what holds back industries and other establishments from investing in rooftop solar systems. Likewise, if SREDA organises periodic knowledge exchange events on successful energy efficiency projects, it can tempt designated energy consumers and industries to gradually implement the remaining low-hanging energy efficiency measures and beyond. Tellingly, SREDA should monitor the status of the mandatory submission of energy auditin g reports by different industrial sub-sectors applicable from 2023 and 2024, respectively. For households, the awareness level of energy efficiency should go beyond the general understanding that energy-efficient appliances save energy. Instead, they need to grasp that an appliance with the lowest wattage among its peers and serving the same needs is the most energy-efficient. Energy labels can help consumers choose the most efficient appliance. SREDA should coordinate with the government's Power Division to promptly approve and enforce the standards and labelling regulations. While energy efficiency and rooftop solar offer green energy investment opportunities, challenges in accessing finance or limited financing lead to negative knock-on effects. The Bangladesh Bank's refinancing scheme of Tk 400 crore ($36.44 million) is the least costly loan facility on offer for which environment-friendly projects of 70 categories compete. The rooftop solar financing facility of the Infrastructure Development Company Limited (IDCOL) is just a fraction of what the sector needs. Likewise, IDCOL's credit line of $256.5 million for RMG and textile sector energy efficiency, supported by the Green Climate Fund, is not enough. Conversely, the commercial banks' ability to deploy funds for loans at current market rates would not garner the interest from industries or commercial buildings. Read more We need smart policymaking, not smart blame games in the energy sector It is therefore necessary to mobilise finance at scale, drawing on the window of opportunities that different multilateral development banks offer. The Bangladesh Bank may create a dedicated low-cost financing scheme for rooftop solar like it developed for the brick kiln sector, supported by the Asian Development Bank (ADB). In the throes of energy sector challenges, rooftop solar and energy efficiency would help Bangladesh manage the situation better. And if the country can advance energy efficiency and rooftop solar, taking a sectoral approach, it will end up with manifold larger benefits than one may think of. The investment signal is favourable as Bangladesh is already in the high energy cost regime and tariffs will rise further. Shafiqul Alam is lead energy analyst at the Institute for Energy Economics and Financial Analysis (IEEFA). Views expressed in this article are the author's own. Follow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission . Related topic: energy price hike in Bangladesh solar rooftop in Bangladesh clean energy use in Bangladesh power tariffs in Bangladesh electricity price hike in Bangladesh natural gas price hike in Bangladesh energy efficiency in Bangladesh Click to comment Comments Comments Policy"
  },
  {
    "url": "https://www.thecable.ng/navigating-the-path-to-energy-transition-lessons-from-germany-for-nigeria/",
    "url_mobile": "https://www.thecable.ng/navigating-the-path-to-energy-transition-lessons-from-germany-for-nigeria/amp/",
    "title": "Navigating the path to energy transition : Lessons from Germany for Nigeria – TheCable",
    "seendate": "20240403T220000Z",
    "socialimage": "",
    "domain": "thecable.ng",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Your Say Basil Omiyi: The exit of an unparalleled veteran by Guest Writer April 2, 2024 2:55 pm"
  },
  {
    "url": "https://oilprice.com/Energy/Energy-General/Thermal-Batteries-Are-the-Hottest-New-Thing-in-Energy-Storage.html",
    "url_mobile": "https://oilprice.com/Energy/Energy-General/Thermal-Batteries-Are-the-Hottest-New-Thing-in-Energy-Storage.amp.html",
    "title": "Thermal Batteries Are the Hottest New Thing in Energy Storage",
    "seendate": "20240403T220000Z",
    "socialimage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2024-04-03_ybt4gsirqh.jpg",
    "domain": "oilprice.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "By signing up to our newsletter, you agree for your email address to be shared with our third party mail providers."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/lion-energy-unveils-powersave-cabinet-and-container-series-delivering-state-of-the-art-energy-management-for-companies-302106555.html",
    "url_mobile": "",
    "title": "Lion Energy Unveils POWERsave Cabinet and Container Series , Delivering State - of - the - Art Energy Management for Companies",
    "seendate": "20240403T131500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Revolutionary POWERsave Systems Provide Three Key Benefits: Back-Up Power, Minimized Energy Costs and Integration of Renewabl e Clean Energy AMERICAN FORK, Utah , April 3, 2024 /PRNewswire/ -- Lion Energy, a leader in safe, silent and eco-friendly power solutions that help individuals, families and organizations become energy independent, today announced the launch of its POWERsave™ Energy Storage Solutions (ESS), comprised of the POWERsave Container Series and POWERsave™ Cabinet Series. POWERsave offers companies custom, large-scale energy solutions including back-up power, energy time shift, renewable energy integration, load management and power system recovery. \"Companies cannot afford to be offline due to electrical grid failures as it risks alienating customers, lowering employee productivity and losing revenue,\" said Tyler Hortin , president of Lion Energy. \"The POWERsave Energy Storage Solutions are economical and eco-friendly solutions that not only create energy independence from electrical grid outages but also minimizes a company's energy costs.\" Lion Energy's POWERsave solutions stores energy using high-grade, extremely safe lithium phosphate battery storage technology. Lion Energy's USA -based team designed these solutions to be scalable, fireproof and resistant to corrosion, which enables them to meet the demands of projects large and small and to adapt to various environmental conditions. Both the POWERsave Cabinet and Container Series are custom solutions where multiple units can be combined for increased capacity applications. The POWERsave Cabinet Series for indoor and outdoor C/I energy storage systems helps reduce peak energy costs from equipment and operations. Its power and capacity ranges from 30kW/50kWh to 90kW/180kWh. This solution is modular and expandable to meet larger energy storage requirements. The POWERsave Container Series is an outdoor containerized energy storage system for utility grid tie or C/I behind the meter applications. The Container Series offers two enclosure model configurations (PS20, PS30) which have been configured to meet each customer's specific power(kW) and capacity storage(kWh) requirements from 675kw/1032 to 1.7MW/3.44MWh per container. The containers are available in 20ft configurations and multiple units can be combined for even more capacity. For more information about Lion Energy's POWERsave Cabinet and Container Systems, please visit: http://www.lionenergy.com/ https://lionenergy.com/pages/powersave CONTAINER SERIES SPECIFICATIONS MODEL PS20 Power: 430kW-675kW Capacity: 1032kWh- 2064kWh Weight: 47,000 lbs. Dimensions – inches (LxWxH): L: 238.5\" (605.79cm) W: 96.0\" (243.8cm) H: 114.0\" (289.57cm) Type: LFP (Lithium Iron Phosphate) Cell/Module/Pack: M: 280Ah/153.6VDC/1P48S/43kWh R: 1P8S/1228.8VDC/344KWh S: 3-6P1S/1228.8VDC EMS (Energy Management System): LionESS / APP platform Cycle Life: 6,000 (based on 80% depth of discharge) Communication: RS485, CAN, Ethernet, DNP3, Modbus TCP/IP Safety Systems: Fire Protection, HVAC MODEL PS30 Power: 675kW-1.7MW Capacity: 2.064MWh-3.440MWh Weight: 67,000 lbs. Dimensions – inches (LxWxH): L: 238.5\" (605.8cm) W: 96.0\" (243.8cm) H: 114.0\" (289.57cm) Type: LFP (Lithium Iron Phosphate) Cell/Module/Pack: M: 280Ah/153.6VDC/1P48S/43kWh R: 1P8S/1228.8VDC/344KWh S: 6-10P1S/1228.8VDC EMS (Energy Management System): LionESS / APP platform Cycle Life: 6,000 (based on 80% depth of discharge) Communication: RS485, CAN, Ethernet, DNP3, Modbus TCP/IP Safety Systems: Fire Protection, HVAC CABINET SERIES SPECIFICATIONS MODEL PS2 Power Capacity: kW Power: 30-90kW Power KWh: 100-185kWh Dimensions (LxWxH): L: 94.5\" (300cm) W: 63\" (150cm) H: 88.5\" (225cm) Weight (lbs.): 7,070 lbs. MAX Type: LFP (Lithium Iron Phosphate) Cell/Module/Pack/Rack: M: 280Ah/51.2VDC/1P16S/14.3kWh R: 1P7-13s/358.4-665.6VDC/100-185.9kWh EMS (Energy Management System): LionESS / APP platform Cycle Life: 6,000 (based on 80% depth of discharge) Communication: RS485, CAN, Ethernet, DNP3, Modbus TCP/IP ABOUT LION ENERGY Lion Energy is a leading manufacturer of safe, silent and eco-friendly power solutions for everyday needs. The road to energy independence affects all aspects of life including how everyone lives and interacts with one another at home, at work or at play. Regardless of where they are on this path, Lion Energy has an U.S.-designed and engineered power solution, based in American Fork, Utah , that can be used indoors or outdoors. Leading the way with innovative Lithium energy smart storage technologies known as LionESS™ and through rigorous testing, Lion Energy provides the broadest and most innovative suite of energy storage solutions on the market today, from hand-held portable device charging to portable solar generators to home, commercial and industrial battery systems. For more information, visit www.lionenergy.com . SOURCE Lion Energy 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://triblive.com/opinion/gov-josh-shapiro-my-commonsense-plan-for-a-new-era-of-energy-leadership-in-pa/",
    "url_mobile": "",
    "title": "Gov . Josh Shapiro : My commonsense plan for a new era of energy leadership in Pa . ",
    "seendate": "20240402T190000Z",
    "socialimage": "https://assets-varnish.triblive.com/2024/04/7204564_web1_ptr-SPOTcarbon-032324.jpeg",
    "domain": "triblive.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Gov. Josh Shapiro: My commonsense plan for a new era of energy leadership in Pa. Gov. Josh Shapiro Tuesday, April 2, 2024 11:00 a.m. | Tuesday, April 2, 2024 11:00 a.m. Go Ad-Free Today! Commonwealth Media Services Gov. Josh Shapiro announces his new cap-and-trade program in March in Scranton. Pennsylvania’s energy industry has long created good-paying jobs and ensured consumers have reliable, affordable power. The coal mines and oil fields of Northeastern and Western Pennsylvania fueled the Industrial Revolution, which powered the middle class and led to the creation of the American labor movement. When fascism threatened freedom overseas, our commonwealth produced the energy that made the arsenal of democracy the most powerful manufacturing base in the world — all powered by Pennsylvania workers. Unfortunately, due to inaction and partisan standoffs of recent years, Pennsylvania has failed to capitalize on our legacy as an energy leader, and other states are moving to overtake us. We need to be more competitive — and it’s time we write the next chapter. Soon after I took office as governor , I brought together a working group of leaders from the energy industry, organized labor, environmental groups and consumer advocates to come up with a plan to protect Pennsylvania’s position as an energy leader and develop a strategy for the future. I’ve made clear that any energy policy supported by my administration must meet a three-part test: it must protect and create energy jobs, take real action to address climate change, and ensure reliable, affordable power for consumers in the long term. Following the recommendations of that working group, last week, I announced my plan to build on Pennsylvania’s legacy of energy leadership by protecting and creating energy jobs and lowering electricity costs for consumers. My plan calls for two key initiatives. First, it would create the Pennsylvania Climate Emissions Reduction (PACER), which would set a cap for the amount of carbon that large power plants can produce and release into the air and reinvest the money raised directly in Pennsylvanians to lower their electricity bills, increase energy efficiency and create energy jobs. Here’s how it would work: the approximately 55 large power plants in Pennsylvania purchase credits from the commonwealth to offset the amount of carbon pollution they’re putting out. With that funding, we’ll give Pennsylvanians an electric bill rebate , so no one pays more on their electricity bill — and some will even pay less . The remaining 30% of the funding generated will be reinvested in large energy-producing facilities in Pennsylvania — like Homer City in Indiana County — used to lower costs further for those who need help the most, and allocated to support projects that increase energy efficiency. Importantly, this is a plan tailored for Pennsylvania and run by Pennsylvanians. We will set our own cap and our own price for those carbon credits. We won’t have other states determining what’s right for us. If the General Assembly passes my plan, I will sign it — immediately removing us from the Regional Greenhouse Gas Initiative (RGGI). The second part of my plan calls for Pennsylvania to create a more reliable and sustainable energy grid in Pennsylvania. Twenty years ago, Pennsylvania was one of the first states to pass Alternative Energy Portfolio Standards, which established what kind of energy we use here in Pennsylvania and where it comes from. We haven’t made any major updates to those standards in 17 years , but in that time, 30 other states — including states run by both Democrats and Republicans — have updated their standards . We’re losing out on new investment and innovation — and that means we’re losing out on jobs and growth. My plan creates the Pennsylvania Reliable Energy Sustainability Standard (PRESS.) PRESS updates our energy standards and expands the tiers of what kind of energy sources can qualify. It will create new markets for clean energy, while also supporting key energy industries that have helped Pennsylvania become a national leader. PRESS accomplishes that by calling for 35% clean energy by 2035 — and expanding the number of zero-emission sources that qualify. It’s not just solar and wind — it also includes sources like methane digesters, new fusion technology and small modular nuclear reactors — all things Pennsylvania has invested in in recent years. A few months ago, I was in Etna in Allegheny County to announce a new investment by our commonwealth in Westinghouse, a company developing and producing the small modular reactors that will help power our future. PRESS encourages investment into that kind of technology, supporting Pennsylvania-grown innovation and good jobs. Taken together, PACER and PRESS would save Pennsylvania ratepayers $252 million over the next five years, create 14,500 jobs, and once again position Pennsylvania as a leader in the energy industry. I know energy is a challenging topic and there are passionate views on all sides of this issue, but doing nothing is not an option. If those who propose to sit tight and do nothing have their way, consumers will end up paying more for their electricity bills, we won’t create enough jobs, and we’ll see more pollution and damage in communities already suffering from the impacts of climate change. I’m sick and tired of falling behind other states — on energy, on economic development, on creating opportunity for our people. It’s time to take commonsense steps to cut costs, protect our planet and create jobs. I’m calling on the General Assembly to step up to the plate, take action to move Pennsylvania forward and pass these bills. Send them to my desk and let’s ensure Pennsylvania is again an energy leader and remains so for decades to come. Josh Shapiro is Pennsylvania governor. Remove the ads from your TribLIVE reading experience but still support the journalists who create the content with TribLIVE Ad-Free. Get Ad-Free > Sign Up for Notifications Stay up-to-date on important news from TribLIVE Categories: Featured Commentary | Opinion Email Newsletters TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox. More Featured Commentary Stories Jason Anthony: Google search ruling a win for small businesses in Pa., across country Danny Tyree: Can we talk sensibly about Veterans Day Mark Z. Barabak: Nancy Pelosi prided herself on cold calculation. She knew it was time. Rev. Richard Cizik: Good Christians can disagree with Trump Sheldon H. Jacobson: NBA quality players on a college team are not sufficient to make noise in the NCAA Tournament"
  },
  {
    "url": "https://www.philstar.com/business/2024/04/01/2344494/addressing-energy-challenges-cebus-growing-economy",
    "url_mobile": "https://www.philstar.com/business/2024/04/01/2344494/addressing-energy-challenges-cebus-growing-economy/amp/",
    "title": "Addressing energy challenges in Cebu growing economy",
    "seendate": "20240401T064500Z",
    "socialimage": "https://media.philstar.com/photos/2024/04/01/lead_2024-04-01_11-18-57.jpg",
    "domain": "philstar.com",
    "language": "English",
    "sourcecountry": "Philippines",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Philstar.com HOME Headlines Opinion Nation World Business Sports Entertainment Lifestyle Other Sections The Philippine Star Pilipino Star Ngayon HOME Bansa Metro Probinsiya Opinyon Palaro Showbiz True Confessions Dr. Love Litra-talk Kutob Komiks The Freeman HOME Cebu News Opinion Metro Cebu Region Cebu Business Cebu Sports Cebu Lifestyle Cebu Entertainment Pang-Masa HOME Police Metro Punto Mo Pang Movies PM Sports Para Manalo Para Malibang Banat HOME Balita Opinyon Kalingawan Showbiz Palaro Imong Kapalaran Punsoy Interaksyon HOME Trends + Spotlights Politics + Issues Celebrities Hobbies + Interests Rumor Cop Coupons HOME Top Stores Offers By Category Latest Posts CRYPTO CURRENTLY STOCK COMMENTARIES TECHNOLOGY BUSINESS AS USUAL BANKING REAL ESTATE AGRICULTURE TELECOMS BIZ MEMOS SUPPORT PHILSTAR About Us | Contact Us | Advertise | Privacy Policy | Member Agreement | Copyright Notice Copyright © 2025. Philstar Global Corp. All Rights Reserved My Profile Sign Out Subscribe Subscribe HOME HEADLINES OPINION NATION WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE COUPONS OTHER SECTIONS X CRYPTO CURRENTLY STOCK COMMENTARIES TECHNOLOGY BUSINESS AS USUAL BANKING REAL ESTATE AGRICULTURE TELECOMS BIZ MEMOS Biz Memos Addressing energy challenges in Cebu’s growing economy Philstar.com April 1, 2024 | 2:00pm With teamwork and smart investments, Cebu can steer towards stable, sustainable energy future. CEBU, Philippines — A bustling hub in the Visayas, Cebu symbolizes the Philippines’ economic vitality. However, the province is confronting a significant challenge—an impending energy shortage that threatens its stability. Cebu’s economy thrives, buoyed by tourism and a flourishing IT-BPM industry. In recent years, tourist arrivals have surged, and the IT-BPM sector has seen remarkable growth, contributing to Cebu's economic resilience. Despite its economic success, Cebu faces an energy crisis due to rising demand and aging infrastructure. The reliance on external power sources poses vulnerabilities, particularly during periods of high consumption, like the approaching El Nino. While the Department of Energy has approved projects for Central Visayas, addressing Cebu’s projected energy shortfall requires localized solutions. Key economic hubs drive substantial energy demand, underscoring the urgency of ensuring sufficient and stable power sources. While renewable energy offers promise, a gradual transition is necessary to meet Cebu’s growing energy needs. The Philippine Energy Plan advocates for a balanced approach, aiming for a mix of renewable and non-renewable energy sources by 2040. Leadership from entities like the Cebu Chamber of Commerce and Industry and Gov. Gwendolyn Garcia emphasizes the importance of addressing Cebu’s energy challenges promptly. Investments in reliable power infrastructure and a diversified energy portfolio are essential for sustaining economic growth and protecting residents’ well-being. As Cebu’s economy continues to expand, addressing energy concerns becomes increasingly crucial. Through collaborative efforts and strategic investments, Cebu can navigate the energy landscape toward a more stable and sustainable future. CEBU ENERGY BrandSpace Articles 50 winners of P50,000? Thatâ€™s a Shakeyâ€™s Supercard kind of holiday! Ever considered a hybrid crossover? The Toyota Yaris Cross HEV is the ideal mobility partner #SoMuchKBeauty â€“ Upgrade your skincare routine with SM Beauty Maibarara wins PEMCâ€™s most compliant geothermal power plant award Holiday upgrade? Kaya â€˜Yan for as low as P20 per day with Home Credit Landmark for sustainable living in the Philippines: Mariposa Mews unveils LEED for Homes Gold Certification Plaque PMAP honors SM Supermalls for people leadership and purpose-driven culture Our Market launches OMG!: Campus tour with a chocolate-making class at De La Salle College of Saint Benilde SM J Mall illuminates the holidays with 'The Heart of Hikari' PSA: Enjoy huge deals, promos for your health and beauty needs at the last Watsons nationwide sale of the year! < > Latest Latest Latest More in Biz Memos Maibarara wins PEMCâ€™s most compliant geothermal power plant award abtest Recommended Iloilo man-made flood control, dapat tularan November 11, 2025 - 12:00am Ang pagkalbo sa mga kabundukan at ang palpak at flood control projects ng Department of Public Works and Highways ang dahilan nang malawakang pagbaha. Biz Memos DPWH FLOOD CONTROL PROJECTS Uwan lalabas na, pero babalik 1 day ago Inaasahang lalabas ng Philippine Area of ­Responsibility si Uwan Lunes ng gabi o ngayong Martes ng umaga pero maaaring... Biz Memos PAGASA PAR EDITORYAL - Palpak na flood control projects sa Cebu, tukuyin 4 days ago MAYROONG 343 flood control projects sa lahat ng distrito ng Cebu, ayon sa Department of Public Works and Highways. Biz Memos DPWH Flood control sa Cebu mula 2016, iniimbestigahan na – DPWH 4 days ago Sinimulan na ng Department of Public Works and Highways ang pagsasagawa ng imbestigasyon sa mga flood control projects... Biz Memos DPWH ICI: Bonoan, iba pa imbestigahan muli sa P95 milyong ghost project sa Bulacan November 7, 2025 - 12:00am Inirekomenda ng Independent Commission for Infrastructure sa Office of the Ombudsman nitong Huwebes na maimbestigahan na rin ang mga dating opisyal ng Department of Public Works and Highways kaugnay ng umano’y...r Biz Memos DPWH next Recommended Iloilo man-made flood control, dapat tularan Ang pagkalbo sa mga kabundukan at ang palpak at flood control projects ng Department of Public Works and Highways ang dahilan nang malawakang pagbaha. 1 day ago DPWH FLOOD CONTROL PROJECTS Uwan lalabas na, pero babalik Inaasahang lalabas ng Philippine Area of ­Responsibility si Uwan Lunes ng gabi o ngayong Martes ng umaga pero maaaring pumasok ulit sa Miyerkules ng gabi habang kumikilos sa Taiwan at Ryukyu Islands at tuluyang hihina sa dara­ting na araw ng Biyernes. 1 day ago PAGASA PAR EDITORYAL - Palpak na flood control projects sa Cebu, tukuyin MAYROONG 343 flood control projects sa lahat ng distrito ng Cebu, ayon sa Department of Public Works and Highways. 4 days ago DPWH Flood control sa Cebu mula 2016, iniimbestigahan na – DPWH Sinimulan na ng Department of Public Works and Highways ang pagsasagawa ng imbestigasyon sa mga flood control projects sa Cebu bunsod na malawakang pagbaha na naganap sa lugar, na ikinasawi ng halos 200 katao. 4 days ago DPWH ICI: Bonoan, iba pa imbestigahan muli sa P95 milyong ghost project sa Bulacan Inirekomenda ng Independent Commission for Infrastructure sa Office of the Ombudsman nitong Huwebes na maimbestigahan na rin ang mga dating opisyal ng Department of Public Works and Highways kaugnay ng umano’y mga iregula­ridad sa P95-milyong flood control project sa Bocaue, Bulacan. 5 days ago DPWH"
  }
]