[
  {
    "url": "https://www.prnewswire.com/news-releases/envision-energy-partners-with-sun-terra-to-build-full-chain-energy-storage-ecosystem-302473923.html",
    "url_mobile": "",
    "title": "Envision Energy Partners with SUN Terra to Build Full - Chain Energy Storage Ecosystem",
    "seendate": "20250605T034500Z",
    "socialimage": "https://mma.prnewswire.com/media/2703892/Envision_Energy_Partners_SUN_Terra_Build_Full_Chain_Energy_Storage_Ecosystem.jpg?p=facebook",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "SHANGHAI , June 4, 2025 /PRNewswire/ -- Envision Energy, a global leader in green technology, announced a strategic partnership with SUN Terra, Indonesia's leading renewable energy company, to advance collaboration on energy storage technologies and solutions in key markets including Southeast Asia , India , and Australia . The partnership aims to accelerate the deployment of advanced energy storage solutions, enhance global supply chains, and foster the localization of manufacturing and technological expertise - all in support of the clean energy transition across these regions. Continue Reading Envision Energy Partners with SUN Terra to Build Full-Chain Energy Storage Ecosystem According to the agreement, Envision and SUN Terra will collaborate on key areas including energy storage system procurement and distribution, localized assembly and manufacturing, technology licensing, and solution delivery. Together, both parties aim to establish a comprehensive strategic partnership covering the full value chain to accelerate the deployment and scaling of energy storage solutions in the target markets. Kane Xu , Senior Vice President and President of International Product Lines at Envision Energy, said: \"SUN Terra's strong local presence and project development capabilities are highly complementary to Envision's expertise in the energy storage. Together, we will accelerate the growth of energy storage markets across Southeast Asia , India and Australia , delivering sustained momentum for enhancing local energy ecosystems.\" Karina Darmawan , CEO of SUN Terra, added, \"As a key part of Sinar Mas' renewable energy portfolio, SUN Terra is committed to advancing clean energy development in Indonesia , Australia , and India . This strategic collaboration with Envision will not only bring advanced energy storage systems to Indonesia , but also empower the localization of production and technology advancements in the Australian and Indian markets.\" SUN Terra, a subsidiary of Sinar Mas - one of Indonesia's most influential conglomerates, specializes in end-to-end renewable energy development. The company has successfully delivered large-scale solar projects across Indonesia , Australia , and India , and offers integrated solutions for energy storage systems and battery lifecycle management, actively advancing the energy transition in local markets. SOURCE Envision Energy 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-06/65588862-envision-energy-partners-with-sun-terra-to-build-full-chain-energy-storage-ecosystem-008.htm",
    "url_mobile": "",
    "title": "Envision Energy Partners with SUN Terra to Build Full - Chain Energy Storage Ecosystem",
    "seendate": "20250605T033000Z",
    "socialimage": "",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Nachrichten » Envision Energy Partners with SUN Terra to Build Full-Chain Energy Storage Ecosystem Push Mitteilungen PR Newswire 05.06.2025 04:48 Uhr 330 Leser Artikel bewerten: ( 2 ) Envision Energy Partners with SUN Terra to Build Full-Chain Energy Storage Ecosystem SHANGHAI, June 5, 2025 /PRNewswire/ -- Envision Energy, a global leader in green technology, announced a strategic partnership with SUN Terra, Indonesia's leading renewable energy company, to advance collaboration on energy storage technologies and solutions in key markets including Southeast Asia, India, and Australia. The partnership aims to accelerate the deployment of advanced energy storage solutions, enhance global supply chains, and foster the localization of manufacturing and technological expertise - all in support of the clean energy transition across these regions. According to the agreement, Envision and SUN Terra will collaborate on key areas including energy storage system procurement and distribution, localized assembly and manufacturing, technology licensing, and solution delivery. Together, both parties aim to establish a comprehensive strategic partnership covering the full value chain to accelerate the deployment and scaling of energy storage solutions in the target markets. Kane Xu, Senior Vice President and President of International Product Lines at Envision Energy, said: \"SUN Terra's strong local presence and project development capabilities are highly complementary to Envision's expertise in the energy storage. Together, we will accelerate the growth of energy storage markets across Southeast Asia, India and Australia, delivering sustained momentum for enhancing local energy ecosystems.\" Karina Darmawan, CEO of SUN Terra, added, \"As a key part of Sinar Mas' renewable energy portfolio, SUN Terra is committed to advancing clean energy development in Indonesia, Australia, and India. This strategic collaboration with Envision will not only bring advanced energy storage systems to Indonesia, but also empower the localization of production and technology advancements in the Australian and Indian markets.\" SUN Terra, a subsidiary of Sinar Mas - one of Indonesia's most influential conglomerates, specializes in end-to-end renewable energy development. The company has successfully delivered large-scale solar projects across Indonesia, Australia, and India, and offers integrated solutions for energy storage systems and battery lifecycle management, actively advancing the energy transition in local markets. Photo - https://mma.prnewswire.com/media/2703892/Envision_Energy_Partners_SUN_Terra_Build_Full_Chain_Energy_Storage_Ecosystem.jpg View original content:https://www.prnewswire.co.uk/news-releases/envision-energy-partners-with-sun-terra-to-build-full-chain-energy-storage-ecosystem-302473944.html © 2025 PR Newswire Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://www.ibtimes.co.in/prime-minister-modi-celebrated-11-years-transformative-energy-reforms-india-883897",
    "url_mobile": "https://amp.ibtimes.co.in/prime-minister-modi-celebrated-11-years-transformative-energy-reforms-india-883897",
    "title": "Prime Minister Modi celebrated 11 years of transformative energy reforms in India",
    "seendate": "20250604T134500Z",
    "socialimage": "https://data1.ibtimes.co.in/en/full/816687/pm-modis-2-day-packed-schedule-four-states-many-projects-be-launched.jpg",
    "domain": "ibtimes.co.in",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Crackdown on all hospital lockers underway after AK-47 discovery from GMC Anantnag"
  },
  {
    "url": "https://www.fool.com/investing/2025/06/04/1-top-energy-stock-i-wouldnt-hesitate-to-buy-in-ju/?source=iedfolrf0000001",
    "url_mobile": "",
    "title": "1 Top Energy Stock I Wouldnt Hesitate to Buy in June",
    "seendate": "20250604T130000Z",
    "socialimage": "",
    "domain": "fool.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "We use a lot of energy each and every day to power our modern lives. From the gasoline that fuels our cars to the natural gas that heats our homes to the electricity that runs our devices, we can't function in our modern society without energy. Our need for energy in the country is only growing. According to forecasts by IHS Outlook and McKinsey, U.S. power demand will surge 55% by 2040, fueled by AI data centers, the onshoring of manufacturing, and the electrification of everything, including transportation. This forecast bodes well for energy companies. As a leader in the sector, NextEra Energy ( NEE +1.17% ) is in a strong position to capitalize on the country's growing demand for electricity. That's one of the reasons why I wouldn't hesitate to buy this top energy stock in June. Image source: Getty Images. The quintessential energy stock NextEra Energy is a powerhouse in the energy sector. It operates the largest electric utility in the country -- Florida Power & Light (FPL). It also operates NextEra Energy Resources, a leading North American clean energy company. Together, these businesses make NextEra Energy the world's largest producer of renewable energy from the wind and sun and a global leader in battery storage. The company also operates the largest natural gas-fired fleet in the country and has a leading nuclear energy business. These features make NextEra Energy \"the quintessential, 'all-forms-of-energy' company,\" commented CEO John Ketchum on the company's first-quarter earnings conference call. The company doesn't just operate leading energy businesses; it knows how to grow them. No one has built more renewable energy-generation capacity than NextEra Energy over the past couple of decades. It has also built more gas-fired generation than any other company in the past 20 years. NextEra's investments to grow its business have paid big dividends for shareholders. The company has grown its adjusted earnings per share (EPS) at a 9% compound annual rate over the past 20 years. That has helped power a roughly 10% compound annual growth rate (CAGR) in its dividend during that period. The company's rising income and earnings have helped fuel market-crushing total returns for its shareholders (15.7% annualized versus 10.2% for the S&P 500 ). Expand NYSE : NEE NextEra Energy Today's Change ( 1.17 %) $ 0.99 Current Price $ 85.76 Key Data Points Market Cap $177B Day's Range $ 84.55 - $ 85.83 52wk Range $ 61.72 - $ 87.53 Volume 12M Avg Vol 10M Gross Margin 36.09 % Dividend Yield 0.03 % Powerful growth ahead NextEra Energy's leadership in all forms of energy puts it in a strong position to capture a meaningful share of the growth it sees ahead for power demand. The company estimates that the U.S. will need to add 450 gigawatts (GW) of new power generation capacity to the grid by 2030 to keep up with current demand forecasts. While it will require all forms of energy to meet this demand, renewable energy, especially solar energy , will do most of the heavy lifting because of its lower costs and ability for rapid deployment. That outlook bodes well for NextEra Energy, a leader in solar. FPL has installed over 7.9 GW of solar to capture Florida's abundance of sunshine and help meet the state's power needs. That's the largest utility-owned solar portfolio in the country. FPL plans to deploy more than 17 GW of solar and over 7.6 GW of battery storage in the next 10 years to meet the state's power needs. In addition, NextEra's energy-resources segment has 28 GW of renewable energy projects under development that it expects to bring online over the next few years. The company plans to invest a staggering $120 billion over the next four years into maintaining and expanding America's energy infrastructure. This investment should power adjusted EPS growth at or near the top end of its 6% to 8% annual target range through 2027. That should give the company the power to continue growing its dividend (which at an over 3% yield is more than double the S&P 500's -1.5% yield) by around 10% annually through at least next year. Given the expected surge in power demand, the company should have ample opportunities to continue growing at a strong rate well beyond that time frame. Leading the charge NextEra Energy is a leader in the U.S. energy sector. That puts it in a strong position to capitalize on the expected surge in power demand over the nex t couple of decades. The company has an exceptional record of investing money to grow its business in a way that generates strong returns for shareholders. Because of that, I wouldn't hesitate to buy shares of this top energy stock in June."
  },
  {
    "url": "https://www.myjoyonline.com/aetc-2025-closes-in-accra-with-bold-vision-for-africas-energy-future/",
    "url_mobile": "",
    "title": "AETC 2025 closes in Accra with bold vision for Africa energy future",
    "seendate": "20250603T164500Z",
    "socialimage": "https://www.myjoyonline.com/wp-content/uploads/2025/06/WhatsApp-Image-2025-06-03-at-08.55.36.jpeg",
    "domain": "myjoyonline.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Audio By Carbonatix The second edition of the Africa Energy Technology Conference (AETC 2025) concluded in Accra, Ghana, with resounding success, marking a significant milestone in Africa’s energy revolution. Hosted under the theme “Innovate, Invest, Implement: Revolutionised Financing for Sustainable Energy Sector Growth in Africa”, this year’s gathering attracted high-level dignitaries, international development partners, policymakers, investors, entrepreneurs, and changemakers from across the continent and beyond. Spearheaded by the Africa Energy Technology Centre (AETC), a pioneering institution focused on advancing homegrown innovation, policy integration, and capital deployment across the energy value chain, the conference provided a powerful platform for reimagining Africa’s energy future. Founded by Emelia Akumah, AETC is dedicated to building the first smart energy technology hub for Africa. A space where cutting-edge technology, strategic capital, and local expertise converge to solve the continent’s most pressing energy challenges. AETC 2025 featured compelling keynote addresses, panel discussions, investment forums, and strategic exhibitions that collectively underscored the need for a unified African approach to sustainable energy. Highlights included: A Clear Vision for a Smart Energy Future: AETC reaffirmed its mission to build Africa’s first smart energy technology hub—a facility that will drive collaboration among technologists, financiers, and policymakers to deliver sustainable, scalable solutions for the continent’s unique energy needs. Intra-African Energy Trade and Integration: Discussions emphasised the urgency of initiating and sustaining intra-African energy trade to create a truly integrated African energy market. Speakers from APPO and national governments stressed regional cooperation and infrastructure development as the cornerstone for energy resilience and economic growth. Revolutionising Financing for African Energy Projects: A core takeaway from the conference was the need to unlock new financing models that prioritize innovation, inclusion, and local ownership. Participants explored strategies to make African energy projects more bankable, reduce investment risk, and catalyze public-private partnerships. Bridging the finance gap will be critical to achieving energy access for the over 600 million Africans still living without electricity. Minister for Energy, John Jinapor Keynote speakers included Ghana's Minister for Energy, John Jinapor, who delivered a rousing address on the importance of energy collaboration and innovation. He also announced new government policies, such as solar-powered streetlights as part of Ghana’s energy diversification agenda. Nigeria's Minister of State for Petroleum Resources (Gas), Ekperikpe Ekpo, urged regional collaboration to unlock Africa's gas potential. Citing Nigeria's 200+ trillion cubic feet of reserves, he highlighted pipeline projects like the West African and Trans-Saharan Gas Pipelines to foster regional integration. The Minister emphasized using gas primarily for domestic industrialization, fertilizer, electricity, and job creation within Africa, not just for export. The Secretary General of APPO, Dr. Omar Farouk Ibrahim, reminded participants that Africa must strategically use its natural oil and gas resources to lift its people out of poverty while investing in cleaner options for the future. Remote keynote remarks were also delivered by Mr. Francesco La Camera, Director General of IRENA, and Damilola Ogunbiyi, CEO of Sustainable Energy for All, underscoring the global significance of Africa’s energy transition. Founder and President of AETC, Emelia Akumah, delivered a passionate call to action, stating: “The future of energy is African—not just because of our resources, but because of our resolve. Through technology, collaboration, and bold financing, we will transform Africa’s energy landscape from one of scarcity to one of shared prosperity.” As AETC 2025 draws to a close, the Centre looks forward to deepening its partnerships with governments, the private sector, and development institutions to drive forward the bold ideas and actions birthed at the conference. From forging intra-African energy partnerships to laying the foundation for the continent’s first smart energy tech hub, the work has only just begun. Africa’s energy transformation is here—and it is African-led. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Africa Energy Technology Centre (AETC) Africa Energy Technology Conference (AETC 2025) DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Trump asks Supreme Court to overturn E Jean Carroll verdict China needs its youth to spend but they are embracing frugality British prime minister Starmer will fight attempts to replace him, allies say EdTech for special needs: Inclusive education for all HeFRA shuts down Tamale Technical University Hospital over safety violations Abu Jinapor raises serious issues about the Ewoyaa lithium mining lease agreement between the Government of Ghana and Barari DV Ltd Increase budget to agriculture sector to at least 10% of GDP – Chamber of Agribusiness to government Ghana loses $200m annually to disasters – NADMO Bank of Ghana announces new foreign exchange operations framework Father and son convicted to a fine for stealing and assault Most Popular News Latest Stories Trump asks Supreme Court to overturn E Jean Carroll verdict 45 minutes China needs its youth to spend but they are embracing frugality 56 minutes British prime minister Starmer will fight attempts to replace him, allies say 1 hour EdTech for special needs: Inclusive education for all 5 hours HeFRA shuts down Tamale Technical University Hospital over safety violations 5 hours Abu Jinapor raises serious issues about the Ewoyaa lithium mining lease agreement between the Government of Ghana and Barari DV Ltd 5 hours Increase budget to agriculture sector to at least 10% of GDP – Chamber of Agribusiness to government 5 hours Ghana loses $200m annually to disasters – NADMO 5 hours Bank of Ghana announces new foreign exchange operations framework 5 hours Father and son convicted to a fine for stealing and assault 5 hours Refuse collector jailed 10 years for attempting to rob US diplomat 6 hours BBC must fight to restore trust, Nandy tells MPs 6 hours GTEC directs NaCCA Deputy Director-General to cease using invalid SMC ‘Dr’ title 6 hours COP 30: Climate finance remains Africa’s top priority 6 hours MTN Ghana highlights SME support at 2025 SMEGA Awards 6 hours"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/as-summer-approaches-duke-energy-dedicates-200-000-to-help-low-income-hoosiers-manage-home-energy-costs-302471986.html",
    "url_mobile": "",
    "title": "As summer approaches , Duke Energy dedicates $200 , 000 to help low - income Hoosiers manage home energy costs",
    "seendate": "20250603T134500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Over the last five years, Duke Energy's Share the Light Fund ® has provided more than $4 million of assistance, supporting nearly 15,000 Indiana households PLAINFIELD, Ind. , June 3, 2025 /PRNewswire/ -- Duke Energy Indiana is dedicating $200,000 to its Share the Light Fund to support customers facing financial hardship this summer. The funding aims to help families and individuals manage their energy costs amid rising temperatures and higher energy use. \"The financial assistance we offer through the Share the Light Fund helps connect customers in need to resources to help pay their electric bills and stay cool through the summer,\" said Stan Pinegar , president of Duke Energy Indiana. \"We appreciate our longtime partnership with statewide community action agencies who help identify customers in need and distribute the funds.\" Duke Energy works with the Indiana Community Action Association to provide up to $300 to qualifying customers to help pay energy bills, deposits and reconnection/connection charges. Individuals should contact their local community action agency to see if they are eligible. Visit incap.org/energy-assistance to find a listing of service providers by county. \"High seasonal energy bills can cause financial strain for families experiencing economic hardship,\" said Ed Gerardot , executive director of the Indiana Community Action Agency. \"With the support of partners like Duke Energy, we're extending a helping hand to people who are facing tough times by connecting them with resources to offset their expenses and increase their financial stability.\" Over the last five years, Duke Energy shareholders, its employees and voluntary contributions from customers have provided more than $4 million in bill assistance through the Share the Light Fund, which has helped support nearly 15,000 Indiana households. Duke Energy offers more than a dozen tools and resources to help customers take control of their energy use – and save money – while trying to stay cool. They include: Usage Alerts that send customers a notification of how much electricity they are using and its cost so they can make adjustments before their billing period ends Free Home Energy House Calls , where energy professionals assess a home for efficiency and provide homeowners with a toolkit of energy-saving devices Interest-free payment plans and due date extensions for customers needing flexibility To learn more about these programs, visit duke-energy.com/HereToHelp . Duke Energy Indiana Duke Energy Indiana, a subsidiary of Duke Energy, provides about 6,300 megawatts of owned electric capacity to approximately 910,000 customers in a 23,000-square-mile service area, making it Indiana's largest electric supplier. Duke Energy Duke Energy (NYSE: DUK ), a Fortune 150 company headquartered in Charlotte, N.C. , is one of America's largest energy holding companies. The company's electric utilities serve 8.6 million customers in North Carolina , South Carolina , Florida , Indiana , Ohio and Kentucky , and collectively own 55,100 megawatts of energy capacity. Its natural gas utilities serve 1.7 million customers in North Carolina , South Carolina , Tennessee , Ohio and Kentucky . Duke Energy is executing an ambitious energy transition, keeping customer reliability and value at the forefront as it builds a smarter energy future. The company is investing in major electric grid upgrades and cleaner generation, including natural gas, nuclear, renewables and energy storage. More information is available at duke-energy.com and the Duke Energy News Center . Follow Duke Energy on X , LinkedIn , Instagram and Facebook , and visit illumination for stories about the people and innovations powering our energy transition. Contact: McKenzie Barbknecht 24-Hour: 800.559.3853 SOURCE Duke Energy 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Africa-s-energy-future-must-be-homegrown-Emelia-Akumah-1986437",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Africa-s-energy-future-must-be-homegrown-Emelia-Akumah-1986437",
    "title": "Africa energy future must be homegrown – Emelia Akumah",
    "seendate": "20250603T113000Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/437/43750562.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2025 06 03 → Article 1986437 Business News of Tuesday, 3 June 2025 Source: www.ghanaweb.com 2025-06-03 Africa's energy future must be homegrown – Emelia Akumah « Prev Next » Comments (0) Listen to Article Share: Emelia Akumah is the Founder and President of the Africa Energy Technology Centre Founder and President of the Africa Energy Technology Centre (AETC), Emelia Akumah, has called for decisive action and a renewed commitment to drive Africa’s energy transformation through homegrown innovation, regional integration, and inclusive financing models. Speaking at the conclusion of the second edition of the Africa Energy Technology Conference (AETC 2025) in Accra, Akumah reaffirmed her bold vision to establish Africa’s first smart energy technology hub, a pan-African centre for innovation where technologists, financiers, and policymakers collaborate to design solutions for the continent’s unique energy needs. “We are building a home for Africa’s energy innovators, a place where ideas meet capital, where research meets policy, and where Africans lead the solutions to our energy challenges,” Akumah said. She added that Africa must build its own future through an energy innovation hub backed by strategic partners across the public and private sectors. The hub is expected to incubate next-generation energy solutions, support startups, and facilitate cross-border collaboration. “The future of energy is African, not just because of our resources, but because of our resolve,” she declared. Held under the theme “Innovate, Invest, Implement: Revolutionised Financing for Sustainable Energy Sector Growth in Africa,” AETC 2025 brought together a high-level delegation of policymakers, investors, development partners, entrepreneurs, and energy leaders from across the continent and beyond. Ghana’s Minister for Energy and Green Transition, Dr John Abdulai Jinapor , delivered a keynote address in which he underscored the role of collaboration and innovation in achieving energy diversification. He also announced new government initiatives, including the nationwide rollout of solar-powered streetlights, as part of Ghana’s renewable energy drive. H.E. Rt Hon Ekperikpe Ekpo, Nigeria’s Minister of State for Petroleum Resources (Gas), called for deeper regional cooperation to unlock Africa’s vast gas potential. He also highlighted major infrastructure projects such as the West African Gas Pipeline and the Trans-Saharan Gas Pipeline as key drivers of integration, stressing the importance of using gas for domestic industrialisation, electricity access, and job creation, not just for export. Secretary General of the African Petroleum Producers' Organisation (APPO), Dr Omar Farouk Ibrahim, echoed the call for the strategic use of Africa’s oil and gas resources to combat poverty while gradually transitioning to cleaner energy sources. Global energy leaders also joined the conversation virtually. Francesco La Camera, Director General of IRENA, and H.E Damilola Ogunbiyi, CEO of Sustainable Energy for All, both emphasised Africa’s pivotal role in the global energy transition and the importance of international collaboration that respects local priorities. Organised by AETC, the conference served as a platform to chart a unified path forward for Africa’s energy sector. The Centre is a forward-looking institution committed to advancing local innovation, capital mobilisation, and policy integration across the energy value chain. A key highlight of the conference was the vision for the smart energy technology hub, an initiative aimed at fostering collaboration and delivering scalable, sustainable energy solutions tailored to Africa’s realities. The hub will also serve as a springboard for innovation, providing space for local expertise to thrive and shape the continent’s energy narrative. SP/MA Watch the latest edition of BizTech below: Click here to follow the GhanaWeb Business WhatsApp channel Comments: This article has no comments yet, be the first to comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/topbands-cloud-pv-ess-charger-solutions-shine-at-the-smarter-e-europe-2025-in-munich-innovative-technologies-driving-transformation-in-the-energy-sector-302451655.html",
    "url_mobile": "",
    "title": "Topband  Cloud - PV - ESS - Charger  Solutions Shine at The Smarter E Europe 2025 in Munich , Innovative Technologies Driving Transformation in the Energy Sector",
    "seendate": "20250510T163000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "MUNICH , May 10, 2025 /PRNewswire/ -- The highly anticipated The Smarter E Europe exhibition concluded on May 9 in Munich, Germany . Topband (002139.SZ) made a compelling appearance with its integrated \"Cloud-PV-ESS-Charger\" solution. With its cutting-edge technologies and system-level innovation capabilities, Topband attracted extensive engagement from industry experts and partners, underscoring its core competitiveness and market appeal in the digital energy sector. The presence further affirmed Topband's long-term commitment to green energy and its accelerating global expansion strategy. An End-to-End Product Ecosystem for a Smart, Safe, and Worry-Free Energy Experience As an innovative leader in digital energy, Topband relies on its core technology system of \"1 Cell1Cloud 3S(Cells, Cloud Platform, BMS，EMS, PCS)\", enabling a fully integrated ecosystem that spans cloud services, PV, energy storage, and EV charging system. Topband serves diverse application scenarios including outdoor portable applications, residential energy and C&I energy. Topband is consistently dedicated to developing safe, intelligent, and hassle-free one-stop energy solutions, driving the large-scale adoption of green energy, and genuinely bringing smart energy into every user. At this exhibition, Topband unveiled its latest liquid-cooled all-in-one C&I energy storage system, powered by high-performance 314Ah lithium iron phosphate (LFP) cells. With high energy density and long cycle life, the system delivers up to 90% charging efficiency and supports parallel expansion. Optimized for peak shaving, dynamic capacity enhancement, and PV consumption, it offers exceptional energy efficiency and delivers the lowest levelized cost of storage (LCOE) for commercial and industrial users. For EV charging system, Topband showcased its 60kW DC fast charger, supporting dual-vehicle charging with real-time dynamic power distribution. Engineered for outdoor reliability with IP54 protection and an operating range of -20°C to 50°C, it ensures stable performance in various conditions. With OCPP protocol support for seamless cloud integration, it helps urban commercial hubs upgrade their energy services and delivers a smarter, more convenient green mobility experience. Partnering with SAX Power to Build a Smarter, Low-Carbon Energy Future During the event, Topband signed a strategic partnership agreement with SAX Power, marking a new chapter in renewable energy collaboration. As a key technology partner of the German railway system, SAX Power brings deep expertise in high-voltage traction networks and lithium-ion energy storage systems. This partnership will integrate Topband's strengths in \"four electrics and one network\", energy storage products, R&D capabilities, and global supply chain with SAX Power's robust localization capabilities and influence in the European market. Looking ahead, Topband and SAX Power will join forces to expand internationally, delivering advanced energy solutions to customers across Europe and around the world. Topband looks forward to creating long-term value alongside SAX Power and driving the transformation toward a smart, low-carbon energy future. Amid the global energy transition, Topband will continue to build on its strong technological foundation and empower global customers with more efficient and intelligent energy solutions—contributing to a greener, more sustainable world. Logo - https://mma.prnewswire.com/media/2443664/TOPBAND_Logo.jpg 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://dailycaller.com/2025/05/09/corporate-media-trumps-cuts-decades-old-energy-program/",
    "url_mobile": "",
    "title": "What Corporate Media Isnt Telling You About Trump Cuts To Decades - Old Energy Efficiency Program",
    "seendate": "20250509T213000Z",
    "socialimage": "https://cdn01.dailycaller.com/wp-content/uploads/2025/05/GettyImages-2200432970-e1746802548882.jpg",
    "domain": "dailycaller.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Ireland Owens Reporter May 09, 2025 3:10 PM ET May 09, 2025 3:10 PM ET Ireland Owens Reporter Font Size: As corporate media outlets race to cast the Trump administration’s termination of an energy savings program as a net loss for Americans, experts note that the coverage omits several inconvenient facts. Several news outlets have recently reported that the administration’s Environmental Protection Agency (EPA) is looking to eliminate the Energy Star program, while seeming to gloss over criticism of the program and the fact it received multiple unsatisfactory reports from federal government audits. While Energy Star has reportedly saved American households and businesses over $500 billion in energy costs since 1992, some experts have warned that the program can negatively impact consumers, such as by pushing them to purchase less effective appliances. “I guess the nicest thing I can say about the Energy Star program is that it’s not as bad as the energy efficiency regulations, because those are mandatory,” Ben Lieberman, a senior fellow who specializes in environmental policy at the Competitive Enterprise Institute, told the Daily Caller News Foundation. “But, the Energy Star label is at least supposedly voluntary, you don’t have to buy the Energy Star model, but that information is there if you want to.” “That being said, I think the program has been misused in a variety of ways,” Lieberman added. “Environmental groups tend to pressure the big retailers to only carry Energy Star products, a lot of the tax credits that the government extends for [home] appliances only apply to the energy efficient or Energy Star models. So, it’s not as voluntary as it is made out to be … There’s also concerns that they’re trying to use the Energy Star program to pursue a climate agenda.” (RELATED: ‘Got To Go’: DOE To Cut Off Billions Of Dollars’ Worth Of Biden-Era Green Energy Projects) “I would not be sad to see the [Energy Star] program go,” Lieberman told the DCNF. The EPA and the Department of Energy (DOE) launched Energy Star in 1992. The program was created to help consumers and businesses “save money and protect the environment through the adoption of energy-efficient products and practices,” according to the DOE’s website. A March 2010 report from the Government Accountability Office (GAO) found that Energy Star was “ vulnerable to fraud and abuse.” GAO’s report also found that the Energy Star program’s controls that were in place at the time did not ensure that products actually met efficiency guidelines. “Just the same as we choose many products without a government rating, we can choose our iPhones without a government rating, we can choose our lawnmowers without a government rating,” Diana Furchtgott-Roth, director of the Heritage Foundation’s Center for Energy, Climate and Environment, told the DCNF. “Think about all the appliances we buy every day that do not have a government rating … we do not need a government rating to be able to choose lower-energy use appliances if this is what we want.” GAO noted in its report that it created a variety of “bogus” products to covertly test if it could obtain Energy Star certifications for them. GAO reported it was able to acquire Energy Star certifications for 15 of the fake products, including a gas-powered alarm clock, while two of the “bogus” products were rejected by the program and three did not receive a response. “A big part of that that people should understand is if you look at the term ‘energy efficiency,’ the Energy Star program and the DOE’s standards are all about what they said was energy efficiency,” John Kennerly Davis Jr., a senior attorney and former deputy attorney general for the Commonwealth of Virginia, told the DCNF. “If you have to run an energy-efficient dishwasher twice to get the job done, then that’s not efficient.” “By artificially imposing on the market these products that ‘yeah this dishwasher is more efficient but you have to run it twice,’ that’s the fatal conceptual flaw that people need to understand,” Davis Jr. added. “Energy efficiency is not task efficiency, and that’s why getting rid of this whole program is a very good thing for efficiency.” MARIN CITY, CA – MARCH 26: An Energy Star label is displayed on a brand new refrigerator at a Best Buy store March 26, 2010 in Marin City, California. (Photo by Justin Sullivan/Getty Images) Moreover, an October 2009 audit from the DOE’s Office of the Inspector General found that “officials had not … d eveloped a formal quality assurance program” to help ensure that product specifications for Energy Star were adhered to. The audit report stated that the DOE had not “effectively monitored” the use of the Energy Star label to “ensure that only qualifying products were labeled as compliant.” “In our judgment, the delay in the Department’s planned improvements in its management of the ENERGY STAR Program could reduce consumer confidence in the integrity of the ENERGY STAR label,” the report states. “Such loss of credibility could reduce energy savings, increase consumer risk, and diminish the value of the recent infusion of $300 million for ENERGY STAR rebates under the Recovery Act.” An August 2007 report from the EPA’s Office of the Inspector General found that there was “little oversight” in using the Energy Star label on products in retail stores. “We found little oversight in using the ENERGY STAR label in retail stores, which is commonly the purchase point for the consumer,” according to the report. “[The] EPA could not provide documentation related to follow-up actions taken, final results for all retail store assessments, or the resolution status of label inconsistencies. We also found that manufacturers may label and sell products as ENERGY STAR qualified prior to submitting test results to the Agency. Using the label on products that do not meet ENERGY STAR requirements may weaken the value of the label and negatively impact the ENERGY STAR program.” Similarly, a separate report from the EPA’s Office of the Inspector General published in 2009 found that the “performance results” of Energy Star and non-Energy Star products “call into question the assumptions used to calculate energy savings and greenhouse gas reductions attributed to this program.” Moreover, a 2010 report from the EPA’s Office of the Inspector General found that the agency’s implementation of the Energy Star program was “inconsistent with the program’s authorized purpose” of achieving “environmental benefits by identifying and promoting energy-efficient products and practices that meet the highest energy conservation standards.” (RELATED: EXCLUSIVE — GOP Rep Unveils Bill To Block Future Presidents From Launching An ‘Assault On Domestic Energy’) “We believe the ENERGY STAR program has sought to maximize the number of qualified products available at the expense of identifying products and practices that maximize energy efficiency,” the report states. President Donald Trump has notably prioritized overturning a variety of energy regulations during his second term, as part of his “ unleashing American energy ” agenda. A source familiar with the program told the DCNF that Energy Star “is a non-statutory program the private sector can effectuate without taxpayer resources. The U.S. Department of Energy already regulates many of the sources covered by the EnergyStar program which leads to confusion among consumers. If companies falsely advertise their products, then they can be subject to penalties from other regulators further proving that a ‘government seal of approval’ is unnecessary.” “With respect to all voluntary programs, companies do not need a federal government ribbon at the cost of taxpayers so that they can more easily sell products to consumers,” the source told the DCNF, adding that the cost of the product relative to potential savings over time does not need certification from the federal government. All content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/ees-europe-2025-sunwoda-energy-unveils-innovative-energy-storage-solutions-for-a-sustainable-future-302451139.html",
    "url_mobile": "",
    "title": "EES Europe 2025 : Sunwoda Energy Unveils Innovative Energy Storage Solutions for A Sustainable Future",
    "seendate": "20250509T133000Z",
    "socialimage": "https://mma.prnewswire.com/media/2683483/Sunwoda_NoahX_3_0_6_528MWh_Liquid_Cooling_ESS_Launched.jpg?p=facebook",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "MUNICH , May 9, 2025 /PRNewswire/ -- Sunwoda Energy made a significant impact at EES Europe 2025, Europe's largest and most international exhibition for batteries and energy storage systems, by unveiling several groundbreaking innovations. These included the launch of its 6.528MWh liquid cooling energy storage system powered by Sunwoda's advanced 625Ah high-capacity battery cells and a 179kWh C&I ESS. The company also presented fully integrated energy storage solutions, covering the entire value chain—from battery cells and packs to integrated systems, reinforcing its commitment to advancing high-capacity battery technology for a sustainable future. Continue Reading Sunwoda NoahX 3.0 6.528MWh Liquid-Cooling ESS Launched Sunwoda Energy's Groundbreaking ESS Innovations At the heart of the new launch was Sunwoda Energy's NoahX 3.0 6.528MWh Liquid Cooling ESS, equipped with high-performance 625Ah LFP battery cells that deliver over 15,000 cycles and a 25-year service life. The system integrates AI-enabled active balancing to optimize charge/discharge consistency and overall efficiency. With multi-layer fire protection, high energy density (430+Wh/L), and the ability to operate in extreme environments from -30°C to 55°C, the NoahX 3.0 is designed to meet the needs of next-generation utility-scale energy storage. Additionally, Sunwoda Energy presented its OASIS A180 179kWh C&I ESS, which offers a compact design, flexible deployment, and smart energy management capabilities for C&I applications in Europe . The company also showcased a comprehensive range of integrated energy storage solutions, including battery cells (280Ah, 314Ah, 625Ah), utility-scale ESS (5MWh), C&I ESS (215kWh), and residential ESS (5-120kWh), underscoring its full end-to-end production capabilities. Sunwoda Energy: Trusted by Partners, Defined by Quality At the exhibition, Sunwoda Energy strengthened its European leadership through partnerships with industry leaders such as SMA, Krannich Solar, Solarmarkt, Energy3000 Solar, Wagner Solar and others. These collaborations demonstrate the company's ability to deliver scalable, high-performance energy storage solutions, highlighted by the successful deployments across Europe , ensuring reliability in key applications. Leveraging Sunwoda Group's nearly 30 years of manufacturing expertise, the company's end-to-end capabilities—from battery cell to integrated systems—embody its commitment to \"Crafting every battery with care\" and ensuring \"Quality Assurance for All.\" These strengths enable Sunwoda Energy to maintain rigorous quality control while delivering tailored solutions that meet global demands and uphold the highest safety standards. By the end of 2024, Sunwoda Energy's global cumulative installed capacity exceeded 19GWh. With recognition as a BloombergNEF Tier 1 Manufacturer, the company continues to drive Europe's green energy transition and solidify its position as one of the global leaders in sustainable energy development. About Sunwoda Energy Sunwoda Energy, leveraging nearly 30 years of battery manufacturing experience from its parent company Sunwoda Electronic Co., Ltd. (Stock Code: SZ300207), is a full-industrial-chain energy storage solution provider specializing in lithium battery storage integration and application technologies. With expertise in cells, PACK, BMS, EMS, and system integration, the company delivers integrated energy storage solutions for utility-scale, commercial & industrial, and residential applications, as well as network energy and smart energy, to drive innovation towards a more sustainable energy future. For more information, please visit www.sunwodaenergy.com . CONTACT: Zeng Edward , [email protected] SOURCE Sunwoda Energy 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.mirror.co.uk/money/energy-firms-pay-out-7million-35196622",
    "url_mobile": "https://www.mirror.co.uk/money/energy-firms-pay-out-7million-35196622.amp",
    "title": "Energy firms pay out £7million to 34 , 000 customers after major billing error",
    "seendate": "20250509T084500Z",
    "socialimage": "https://i2-prod.mirror.co.uk/article35183969.ece/ALTERNATES/s1200/1_Worried-Woman-Looking-At-Smart-Meter-In-Kitchen-At-Home-During-Cost-Of-Living-Energy-Crisis.jpg",
    "domain": "mirror.co.uk",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Energy firms pay out £7million to 34,000 customers after major billing error Energy regulator Ofgem has found more than 34,000 customers were affected between January 2019 and September 2024 Comments Money Levi Winchester Money Editor 08:38, 09 May 2025 Updated 11:50, 09 May 2025 View Image Energy bills went up again last April (Image: Getty Images) Thousands of energy customers have been paid £7million in compensation and refunds after they were accidentally overcharged. ‌ Ofgem has found more than 34,000 customers were affected between January 2019 and September 2024. The issue relates to customers with Restricted Meter Infrastructure, which means they have more than one electricity meter point. ‌ Energy suppliers are allowed to apply multiple standing charges for homes with multiple electricity meters. However, this meant some customers were incorrectly charged more than is allowed under the price cap when combined with unit rates. ‌ A total of ten suppliers have updated their systems and compensated customers as a result of the Ofgem review. This includes £5.6million in refunds and almost £1.4million in goodwill payments. You can see a table of all the firms affected below. Charlotte Friel, director of retail pricing and systems at Ofgem, said: “Our duty is to protect energy consumers, and we set the price cap for that very reason so customers don’t pay a higher amount for their energy than they should. ‌ “We expect all suppliers to have robust processes in place so they can bill their customers accurately. While it’s clear that on this occasion errors were made, thankfully, the issues were promptly resolved, and customers are being refunded. “Today’s outcome serves as a reminder to all energy suppliers that they must implement the price cap properly and do their due diligence. “ It also shows that, where appropriate, Ofgem is prepared to work with suppliers that fail to comply with our rules.” ‌ It comes after the Ofgem price cap rose to £1,849 a year for the average dual fuel household paying by direct debit. Energy analysts at Cornwall Insight are predicting it could fall to £1,683 in July. Ofgem will announce its new energy price cap by May 27. This new rate will come into force from July 1 and will run for three months, until August 31. Despite what its name suggests, the Ofgem price cap does not put a limit on how much you can pay for energy - instead, it sets the maximum unit price you can be charged for gas and electricity, as well as the maximum daily standing charge. ‌ £7million awarded after energy bill failures The table below shows the energy firms that have compensated customers, the number of customers affected, then the total amount paid in refunds and goodwill payments. E.ON Next - 160 customers; £45,195.82 in refunds; £9,330.33 in goodwill payments Ecotricity - 166 customers; £36,633.12 in refunds; £18,904.35 in goodwill payments EDF Energy - 3 customers; £112.29 in refunds; £30 in goodwill payments Octopus Energy - 20,862 customers; £2,636,884 in refunds; £546,278 in goodwill payments Outfox The Market - 570 customers; £6,106.06 in refunds; £4,590 in goodwill payments OVO Energy - 2,372 customers; £602,066.05 in refunds; £280,068.73 in goodwill payments Rebel Energy - 15 customers; £2,339.49 in refunds; £575 in goodwill payments So Energy - 1,558 customers; £266,041.16 in refunds; £58,285.85 in goodwill payments Tru Energy - 70 customers; £7,486.54 in refunds; £11,663 in goodwill payments Utility Warehouse - 8,272 customers; £2,043,098.84 in refunds; £453,960 in goodwill payments Rare deal sees dehumidifier plummet Cosy electric blanket costs 1p to use Nab a free cardigan with special offer Robot vacuum at lowest ever price Article continues below READ MORE : How to bag free Aldi skincare and makeup before it hits the shelves"
  },
  {
    "url": "https://www.theguardian.com/global-development/2025/may/08/latin-america-community-energy-indigenous-lighting-electricity-solar-pollution-diesel-just-transition",
    "url_mobile": "",
    "title": "  A future on our term : how community energy is lighting up Latin America | Renewable energy",
    "seendate": "20250508T134500Z",
    "socialimage": "https://i.guim.co.uk/img/media/6f5083226b758ff7d0f9e14f989cf2b3bed7e3cc/1311_691_2839_2271/master/2839.jpg?&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7f8e6ced23a768b08e0658a3efb9c44b",
    "domain": "theguardian.com",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "A solar-powered boat in the Ecuadorean Amazon developed by the Indigenous Achuar people, who have also improved local education and community tourism by using solar panels in 10 of their communities. Photograph: Kara Solar View image in fullscreen A solar-powered boat in the Ecuadorean Amazon developed by the Indigenous Achuar people, who have also improved local education and community tourism by using solar panels in 10 of their communities. Photograph: Kara Solar This article is more than 6 months old ‘A future on our terms’: how community energy is lighting up Latin America This article is more than 6 months old Small-scale schemes are replacing dirty diesel with clean electricity in remote areas – and ensuring a just transition W hen the coronavirus pandemic hit in 2020, Roxana Borda Mamani had to leave Mexico, where she was studying for her degree in rural development and food security, and return to her remote village in the Peruvian Amazon. At the time, the Indigenous community in Alto Mishagua had neither an internet connection nor a reliable energy source. “How am I going to study?” Borda asked. “With energy from the sun,” replied her friend, a fellow member of the Latin American Observatory for Energy Geopolitics at the Brazil-based Federal University of Latin American Integration (Unila). View image in fullscreen Roxana Borda Mamani, who brought solar energy to Alto Mishagua in Peru. Photograph: Mariana Abdalla/350.org Borda began researching the components of an off-grid solar energy system: photovoltaic (PV) panels, a battery, an inverter and a charge controller. Five years later, her community has a 400W solar system powering a 24-hour satellite internet connection and charging points for phones and torches next to a small school that was set up thanks to the new energy source. A second phase, due to be implemented this year, will equip households with PV panels, providing the community’s 50 families with regular electricity access and ending their reliance on expensive and polluting diesel generators. The initiative was developed by Borda and five other students at the Energy Observatory, with the community’s backing, support from the Canadian energy-access charity Light Up the World , and grants. “Our idea was to be independent [and] promote the autonomy and self-management of the energy and communication systems,” says Borda. The project is called Aylluq Q’Anchaynin, which means “the energy of the community” in her native Quechua. More than 16 million people do not have access to electricity in Latin America and the Caribbean – despite often living in the shadow of fossil-fuel extraction projects, as in parts of the Amazon. Community-driven clean energy systems, such as Borda’s, sometimes called “energy communities” , are a way to tackle the region’s energy poverty and insecurity while also contributing to a just energy transition that puts people first. View image in fullscreen The children of Alto Mishagua, who are benefiting from the solar panels that brought a 24-hour satellite internet connection and a school to their village. Photograph: Roxana Borda Mamani Ilan Zugman, regional director for Latin America and the Caribbean at 350.org , an international environmental organisation, says: “The beauty of these community-based projects is that they truly offer social and economic transformation with a much smaller environmental impact than a fossil fuel or large-scale renewable energy project.” Alejandra Bernal, clean energy transition officer for Latin America at the International Energy Agency (IEA), says the region is well placed for energy communities to grow thanks to laws on self-generation of electricity and decentralised energy being the best solution for connecting isolated areas. Last year, 65% of Latin America and the Caribbean’s electricity was powered by clean energy, of which 17% was wind and solar – above the global average of 41% and 15% respectively, according to the energy thinktank Ember . Although solar-generated distributed energy (produced outside the primary grid) is growing fast, particularly in Brazil , “the majority of this renewable energy being added comes from massive wind and solar farms”, says Zugman. View image in fullscreen The Achuars’ solar-powered boat glides along the Capahuari River in Ecuador. Photograph: Hana Begovic/Kara Solar “Clean energy sources are growing, but we run the risk of having a decades-long energy transition that isn’t just, that repeats the negative models of the fossil fuel industry, affecting frontline communities without benefiting them,” he adds. F rom the Chiloé archipelago in southern Chile to La Guajira on Colombia’s northern coast, via Brazil’s arid north-east, large-scale wind and solar projects have been criticised for failing to consult or benefit local communities while causing harmful social and environmental effects. Zairybeth Velásquez, an Indigenous Wayúu leader from La Guajira, where Colombia’s efforts to develop the renewables sector are focused, says: “ My people have resisted, maintaining our customs despite all the development around us, like coalmining, salt extraction, fossil gas – and now wind and solar. View image in fullscreen The 400W solar energy system in Alto Mishagua, Peru, has allowed the village to end its reliance on noisy, polluting diesel generators. Photograph: Roxana Borda Mamani “It used to be non-renewables and now it’s renewable resources, but we continue to be attractive to big multinationals looking to explore and exploit,” says Velásquez. skip past newsletter promotion after newsletter promotion Her community – which risks being affected by transmission lines – has been equipped with solar panels, but they are operated by a private company. The Wayúus’ lack of autonomy within the energy system raises questions about the project’s sustainability, she says. View image in fullscreen Ludys Mena says solar power has transformed Colombia’s La Loma college. Photograph: Constance Malleret/350.org According to the IEA’s Bernal, the energy transition cannot be limited to technological change. Community-based power generation “should be one of the solutions … to advance the energy transition”, she says, adding that public policies are required that address how these local systems fit into national energy planning. Zugman says governments and financial institutions should step up to improve these projects’ visibility and capacity for expansion. Colombia has the region’s most advanced framework for empowering communities to adopt decentralised clean energy: the Comunidades Energéticas programme, launched by President Gustavo Petro in 2023 in an effort to create 20,000 energy communities allowing people to generate, use and sell energy from non-conventional renewable sources. In Chocó, Colombia’s poorest department on the Pacific coast, 24 PV panels now power the classrooms and canteen of La Loma agricultural college in Bojayá, benefiting 240 students. “It completely transformed the community, especially the education community,” says Ludys Mena, 52, the college’s director. Mena, who grew up using polluting paraffin lanterns, now wishes this solar system could be expanded beyond the school to the entire community, highlighting the programme’s limitations. Implementation has also been a problem – as of last December, fewer than 150 energy communities were up and running out of 18,000 applications. A campaign led by 350.org in April this year brought together nearly 300 climate activists and community leaders from 70 countries in Brasília to share experiences around energy transition. The NGO is pushing for the just energy transition to be on the agenda at Cop30, the climate summit hosted by Brazil in the Amazonian city of Belém in November. View image in fullscreen Nantu Canelos, of the Kara Solar Foundation. The Achuars’ move to clean energy has helped his community resist oil drilling on their land, he says. Photograph: Mariana Abdalla/350.org Campaigners gave the Cop30 president, the veteran climate diplomat André Aranha Corrêa do Lago, a letter calling for the implementation of the goal to triple global renewable capacity and the rapid phase-out of fossil fuels under the leadership of Indigenous and traditional communities, which are on the frontlines of the climate crisis. “We want [a just, community-driven energy transition] to be part of the negotiations or the heads of states’ meeting,” says Zugman. Bernal says: “Cop30 could be an excellent scenario to discuss greater engagement of communities in energy planning.” Wind resistance: can Colombia overcome opposition to get its green energy plan back on track? Read more It is, she adds, about “how to give more power to the people for them to decide on the way they consume and use electricity, and what sources they want”. In the Ecuadorian Amazon, the Indigenous Achuar people decided they wanted solar power after consulting their elders and communal guayusa tea ceremonies. They have developed solar-powered boats that glide silently down the Capahuari River, learned how to operate and maintain them, and improved local education and their community tourism work thanks to solar panels being set up in 10 different communities. This has also helped strengthen Achuar communities’ resistance to oil drilling on their land, says Nantu Canelos, director of the Kara Solar Foundation . “We’re building a future on our own terms.” Explore more on these topics Renewable energy Southern frontlines: Latin America and the Caribbean Energy Indigenous peoples Amazon rainforest Cop30 Americas Solar power features Share Reuse this content"
  },
  {
    "url": "https://www.mirror.co.uk/features/topic-desking/money/labour-party-explains-how-cut-35186111",
    "url_mobile": "https://www.mirror.co.uk/features/topic-desking/money/labour-party-explains-how-cut-35186111.amp",
    "title": "Labour Party explains how it will cut £300 a year from united kingdom energy bills",
    "seendate": "20250508T040000Z",
    "socialimage": "https://i2-prod.mirror.co.uk/article35186124.ece/ALTERNATES/s1200/0_Starmer-1.jpg",
    "domain": "mirror.co.uk",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Labour Party explains how it will cut £300 a year from UK energy bills The Labour Party repeatedly made the pledge during its General Election campaign last year Comments Features Nicholas Dawson 04:00, 08 May 2025 Updated 08:30, 08 May 2025 View 3 Images Labour has pledged to cut energy bills by £300 a year (Image: Getty) Labour has shed more light on its ambitious plan to slash energy bills by £300 annually by 2030. The party repeatedly touted this promise during its General Election campaign last year, and Prime Minister Keir Starmer has reaffirmed the commitment since taking office. ‌ SNP MP Seamus Logan queried the Government in Parliament about from what level the Government plans to bring down energy bills £300 when the change is achieved. Energy minister Miatta Fahnbulleh responded, saying: \"The Government believes that our mission to deliver clean power by 2030 is the best way to break our dependence on global fossil fuel markets and protect billpayers permanently. ‌ \"The creation of Great British Energy will help us to harness clean energy and have less reliance on volatile international energy markets and help in our commitment to make Britain a clean energy superpower by 2030. This, combined with our Warm Homes Plan to upgrade millions of homes to make them warmer and cheaper to run is how we will drive down energy bills and make cold homes a thing of the past.\" ‌ The Warm Homes Plan includes additional funding for the Boiler Upgrade Scheme, which offers grants to support the transition from fossil fuel heating systems to heat pumps or biomass boilers. Through this scheme, households can receive £7,500 towards an air source heat pump, £7,500 towards a ground source heat pump, or £5,000 towards a biomass boiler. View 3 Images Energy bills have soared over recent years (Image: Getty) Government figures indicate that switching to a heat pump could save families about £100 annually on energy bills in contrast to using a gas boiler, while insulating a home could result in even greater savings of roughly £200 a year. ‌ Ms Fahnbulleh further explained the Government’s strategy, saying: \"We recognise that we need to support households struggling with bills whilst we transition to clean power by 2030. This is why we are delivering the Warm Home Discount to around 3 million eligible low-income households this winter. \"On February 25, we published a consultation on the expansion of the Warm Home Discount, giving more eligible households £150 off their energy bills. These proposals would bring around 2.7 million households into the scheme – pushing the total number of households that would receive the discount next winter up to around 6 million. \"The consultation has now closed and the Department is evaluating the responses.\" The Warm Homes Discount offers a one-off £150 deduction from your electricity bill. Those who qualify include people on the Guarantee Credit portion of Pension Credit as well as those on a low income or who are receiving certain means-tested benefits. ‌ View 3 Images Prime Minister Keir Starmer, pictured with Chancellor Rachel Reeves, made the pledge during the election campaign (Image: Getty) Ministers are considering broadening the scope of the discount to include everyone on means-tested benefits. Most of the time, eligible suppliers will automatically deduct the discount from your bill — the funds aren't transferred directly to you. These suppliers are part of the scheme: Article continues below 100Green (formerly Green Energy UK or GEUK) Affect Energy – see Octopus Energy Boost British Gas Bulb Energy – see Octopus Energy Co-op Energy - see Octopus Energy E - also known as E (Gas and Electricity) Ecotricity E.ON Next EDF Fuse Energy Good Energy Home Energy London Power Octopus Energy Outfox the Market OVO Rebel Energy Sainsbury’s Energy Scottish Gas – see British Gas ScottishPower Shell Energy Retail So Energy Tomato Energy TruEnergy Utilita Utility Warehouse."
  },
  {
    "url": "https://reason.com/2025/05/07/the-case-for-eliminating-energy-star/",
    "url_mobile": "",
    "title": "The case for eliminating Energy Star",
    "seendate": "20250507T230000Z",
    "socialimage": "https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/05/5-7-25-v4-b.jpg",
    "domain": "reason.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "On Friday, President Donald Trump released his budget proposal , which included targeted cuts to federal clean energy programs and ending funding to what the president calls \" the Green New Scam .\" The Trump administration is now shifting its focus to energy efficiency programs. CNN reported Tuesday that the Environmental Protection Agency (EPA) plans to shutter the Energy Star program. First launched under President George H.W. Bush in 1992, Energy Star sets voluntary energy efficiency standards for appliances and buildings. Products that meet the program's standards are allowed to display the Energy Star label, which is recognized by 90 percent of American households, according to the program's website. The program also helps homeowners utilize federal energy efficiency tax credits. Energy Star says it has saved consumers more than $500 billion in energy costs since 1992, with $42 billion saved in 2020 alone. The use of Energy Star products has also prevented 4 billion tons of greenhouse gas (GHG) emissions from entering the atmosphere, according to the EPA. The EPA says the estimated annual market value of Energy Star product sales is $100 billion. While the EPA has not confirmed that it will ax Energy Star, industry groups are lobbying the agency to keep the program intact. \"Eliminating the Energy Star program would directly contradict this administration's promise to reduce household energy costs,\" Paula Glover, president of Alliance to Save Energy (a nonprofit that has lobbied to keep Energy Star in the past), told CNN. A coalition of appliance manufacturers and HVAC and boiler companies sent a letter to the EPA saying that eliminating the program \"will not serve the American people,\" reports NOTUS . This is not the first time that Trump has proposed ending the popular program. In 2017, the president floated cutting Energy Star but the plan was halted after more than 1,000 organizations implored Congress to protect the program . Despite having a relatively small budget—the program costs about $50 million per year and represents less than 1 percent of the EPA's spending —and being one of the \"most innocuous\" government programs, there are reasons to reconsider Energy Star, Nick Loris, vice president of public policy at the free market energy think tank C3 Solutions, tells Reason . \"In an age of information and where the cost of getting that information is pretty low, consumers readily have access to the many different attributes they value in the product. And the product manufacturers can still advertise the energy savings from their products\" without a federal program, says Loris. A March white paper from the Competitive Enterprise Institute on modernizing the EPA says \"green purchasing programs\" like Energy Star \"assume the federal government needs to meddle in the marketplace by providing its seal of approval on what it deems to be environmentally satisfactory products.\" The paper continues, arguing, \"If consumers demand certain information, then businesses will respond by disseminating this information to them.\" If a labeling system is needed, \"then private certification organizations should play such a role.\" The Cato Institute, meanwhile, has called Energy Star \"a very coarse piece of energy information that may crowd out efforts\" to develop more accurate ways to measure energy operating costs. Despite the benefits that Energy Star has provided to consumers and the environment, the program is yet another example of the government doing a job that the private sector could do better. Cutting the program may not substantially reduce federal spending, but it would reduce federal creep in consumer choices."
  },
  {
    "url": "https://www.yahoo.com/news/case-eliminating-energy-star-192318940.html",
    "url_mobile": "",
    "title": "The Case for Eliminating Energy Star",
    "seendate": "20250507T201500Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/SEDEpXeRiE4D6w5f5p0hgQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/reason_com_245/b42e25ded96f704a1180738c6720c4e6",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "lllustration: Eddie Marshall | imageBROKER | Logo Factory | Newscom | Midjourney Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways On Friday, President Donald Trump released his budget proposal , which included targeted cuts to federal clean energy programs and ending funding to what the president calls \" the Green New Scam .\" The Trump administration is now shifting its focus to energy efficiency programs. CNN reported Tuesday that the Environmental Protection Agency (EPA) plans to shutter the Energy Star program. First launched under President George H.W. Bush in 1992, Energy Star sets voluntary energy efficiency standards for appliances and buildings. Products that meet the program's standards are allowed to display the Energy Star label, which is recognized by 90 percent of American households, according to the program's website. The program also helps homeowners utilize federal energy efficiency tax credits. Energy Star says it has saved consumers more than $500 billion in energy costs since 1992, with $42 billion saved in 2020 alone. The use of Energy Star products has also prevented 4 billion tons of greenhouse gas (GHG) emissions from entering the atmosphere, according to the EPA. The EPA says the estimated annual market value of Energy Star product sales is $100 billion. Advertisement Advertisement Advertisement Advertisement While the EPA has not confirmed that it will ax Energy Star, industry groups are lobbying the agency to keep the program intact. \"Eliminating the Energy Star program would directly contradict this administration's promise to reduce household energy costs,\" Paula Glover, president of Alliance to Save Energy (a nonprofit that has lobbied to keep Energy Star in the past), told CNN. A coalition of appliance manufacturers and HVAC and boiler companies sent a letter to the EPA saying that eliminating the program \"will not serve the American people,\" reports NOTUS . This is not the first time that Trump has proposed ending the popular program. In 2017, the president floated cutting Energy Star but the plan was halted after more than 1,000 organizations implored Congress to protect the program . Despite having a relatively small budget—the program costs about $50 million per year and represents less than 1 percent of the EPA's spending —and being one of the \"most innocuous\" government programs, there are reasons to reconsider Energy Star, Nick Loris, vice president of public policy at the free market energy think tank C3 Solutions, tells Reason . Advertisement Advertisement Advertisement Advertisement \"In an age of information and where the cost of getting that information is pretty low, consumers readily have access to the many different attributes they value in the product. And the product manufacturers can still advertise the energy savings from their products\" without a federal program, says Loris. A March white paper from the Competitive Enterprise Institute on modernizing the EPA says \"green purchasing programs\" like Energy Star \"assume the federal government needs to meddle in the marketplace by providing its seal of approval on what it deems to be environmentally satisfactory products.\" The paper continues, arguing, \"If consumers demand certain information, then businesses will respond by disseminating this information to them.\" If a labeling system is needed, \"then private certification organizations should play such a role.\" The Cato Institute, meanwhile, has called Energy Star \"a very coarse piece of energy information that may crowd out efforts\" to develop more accurate ways to measure energy operating costs. Despite the benefits that Energy Star has provided to consumers and the environment, the program is yet another example of the government doing a job that the private sector could do better. Cutting the program may not substantially reduce federal spending, but it would reduce federal creep in consumer choices. The post The Case for Eliminating Energy Star appeared first on Reason.com . About Our Ads"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/kinsley-energy-systems-partners-with-mainspring-energy-to-solve-critical-grid-challenges-302449123.html",
    "url_mobile": "",
    "title": "Kinsley Energy Systems Partners with Mainspring Energy to Solve Critical Grid Challenges",
    "seendate": "20250507T201500Z",
    "socialimage": "https://mma.prnewswire.com/media/2681888/Kinsley_Energy_Systems.jpg?p=facebook",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "EAST GRANBY, Conn. , May 7, 2025 /PRNewswire/ -- Kinsley Energy Systems , a leader in onsite power solutions with a 60-year legacy in the energy industry, announces a new partnership with Mainspring Energy to deliver linear generators to commercial and industrial businesses and other high-demand facilities across the Northeast, mid-Atlantic and beyond. This collaboration combines Kinsley's unmatched onsite energy expertise and field service capabilities with Mainspring's innovative linear generator technology. Continue Reading David Kinsley, President of Kinsley Energy Systems, and Wissam Balshe, Mainspring Senior Director of Channel Partnerships This partnership arrives at a crucial time as the nation grapples with reducing high electricity costs, replacing aging infrastructure and meeting state emissions reduction goals. Kinsley's role has always been to deliver when the grid cannot—from deploying emergency power during snowstorms and hurricanes to providing the only field service response team in the region with a guaranteed response time of 4-hours or better. With the addition of Mainspring's modular linear generator, Kinsley expands its energy portfolio with a highly efficient, dispatchable, and fuel-flexible solution that runs on renewable natural gas, hydrogen, and other gaseous fuels while maintaining near-zero NOx emissions. This offering provides businesses reliable, cost-effective on-site power that also meets emissions reductions goals. A Game-Changing Power Solution Kinsley has built its reputation by identifying the safest, most efficient, and most forward-thinking technologies in the market. Mainspring's linear generator is a perfect fit—combining operational savings with emissions reductions. \"Our customers rely on Kinsley to find innovative ways to meet their environmental goals while maintaining operational efficiency and financial performance,\" said Kurt West , VP of Kinsley Energy Systems. \"Mainspring's technology is a game-changer, providing a flexible, high-efficiency solution that allows businesses to take control of their energy future. We're thrilled to add linear generators to our portfolio and accelerate deployment to our customers.\" A Partnership of Innovation and Stability Mainspring's linear generator technology offers unmatched fuel flexibility, efficiency, and grid resilience—addressing the most pressing challenges in today's energy landscape. \"Our partnership with Kinsley Energy Systems represents a major step forward in making our technology accessible to a broader range of high-energy users,\" said Wissam Balshe , Senior Director of Channel Partnerships at Mainspring. \"With Kinsley's decades of experience, deep relationships, and proven ability to deliver, we're confident this partnership will bring meaningful solutions to energy challenges.\" Founded in 2010, Mainspring Energy manufactures and delivers innovative, flexible, low-emissions, modular power generators that rapidly add new power capacity and deliver reliable, affordable, low-emissions electric power. Mainspring began commercial shipments of its linear generators in 2020 and today has hundreds of megawatts in field operations and advanced development for leading Fortune 500 companies, data center developers, and utilities. About Kinsley Energy Systems Kinsley Energy Systems (KES) provides innovative solutions and services to address the country's energy infrastructure and environmental challenges. KES is part of Kinsley Group—one of the nation's premier on-site power providers for 60 years. Drawing on this legacy of excellence, KES focuses on solving ever-evolving energy demands with comprehensive solutions that enhance resiliency, reduce operational costs and lower carbon emissions. KES is behind some of the country's most successful sustainable on-site energy projects and brings Kinsley's commitment to exceptional customer service to advanced commercial and industrial turnkey microgrids. With a strong energy solutions focus and decades of experience, KES is dedicated to helping businesses achieve their energy goals through sustainable, reliable, and innovative solutions. For more information on how Kinsley Energy Systems and Mainspring Energy can help your business achieve energy independence and sustainability, please visit us here . Media Contacts: Kinsley Energy Systems Nathan Hardt Market Engagement Manager 959.262.4610 [email protected] Mainspring Energy Maria Amundson Chief Communications Officer [email protected] SOURCE Kinsley Energy Systems 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.adn.com/opinions/2025/05/07/opinion-alaskas-clean-energy-future-requires-leadership-tenacity/",
    "url_mobile": "",
    "title": "Opinion : Alaska clean energy future requires leadership tenacity",
    "seendate": "20250507T183000Z",
    "socialimage": "https://www.adn.com/resizer/v2/JFGTALOKKZASHO7EHAAMMKFGSY.jpg?smart=true&auth=3c2364f9461011ce4908254f4aa81f5ef13da8380a129ed34e7012282b366977",
    "domain": "adn.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Power transmission lines in South Anchorage. (ADN archives) Alaska and its people are a hallmark of resourcefulness, resilience and can-do spirit. Our communities know better than most what it means to build, innovate and power our lives in some of the earth’s harshest and most challenging conditions. Energy development in Alaska isn’t just about economics — it‘s about survival, our success and a prosperous future. Right now, decisions are being made in Washington, D.C. that will shape Alaska’s energy future and security for generations to come. Alaska’s energy landscape is unique. We are a young state that is poor in electrical energy infrastructure. We don’t have the luxury of plugging into a national grid or importing cheap energy from neighboring states. We produce what we consume and fully utilize what we develop. In many rural and coastal communities, the most cost-effective path forward is clean, local, renewable energy produced in Alaska. This is a bicameral, bi-partisan, state, federal and local “yes” issue we can all agree on. In Alaska, energy development is a shared common and solid ground combined with a universal commitment to powering our communities, growing our economy, supporting jobs, creating prosperity and securing our future. Maintaining a stable, predictable federal energy policy and credits is essential to keeping our progress and prosperity on track. In our state, energy policy isn’t theoretical. It‘s pragmatic and practical. It‘s the difference between affordable power and energy poverty. It‘s the difference between opportunity and prosperity or stagnation. Across Alaska, federal investments through programs like the Infrastructure Investment and Jobs Act (IIJA) and the Inflation Reduction Act (IRA) have helped our communities pursue innovative energy solutions — from hydropower to geothermal to emerging tidal energy projects. These aren’t distant technologies — they are energy systems already lowering energy costs and creating jobs in some of the most remote parts of the country. However, continuing this progress and working towards a brighter energy future requires diligence. As Congress considers changes to the tax code that could eliminate key energy credits, it is essential that our leaders protect Alaska’s energy and transmission development. These credits have been vital to projects that lower energy costs and expand access to sustainable infrastructure across the state. ADVERTISEMENT Repealing or significantly altering these incentives would create uncertainty for ongoing efforts and could jeopardize critical funding streams that organizations like the Alaska Energy Authority, local utilities and energy developers depend on. Without these resources, progress on affordable, long-term energy solutions for Alaska’s communities is at risk. Sens. Murkowski and Sullivan have long understood this reality and have introduced, passed and secured several pieces of energy legislation to help Alaska. Their leadership has been essential in ensuring that Alaska’s voice is heard and felt in Washington. Rep. Begich has joined this effort and recently supported similar energy legislation, working with our delegation. Gov. Dunleavy and his administration are unwavering in their commitment to lower the cost of energy. Progress is being made. But our work is not finished, and we require an Alaskan brand of tenacity to complete what we have started. Now is the time to unleash Alaska’s energy resources and double down on policies that incentivize energy innovation, support infrastructure and reduce energy costs for our economy to help us achieve energy and national security. Alaska has the resources, the tenacity, the expertise and the sheer will to lead in clean energy development. We need smart, stable federal policy to help Alaska help America make it happen. Preserving and expanding energy tax credits for Alaska’s energy resources will help ensure that both Alaska and America are energy secure. Duff Mitchell is the managing director of Juneau Hydropower, Inc., and serves as vice chairman on the Alaska Energy Authority board of directors, previously served on the Alaska Energy State Task Force and co-chairs the Legislative Affairs Committee for the National Hydropower Association. • • • The views expressed here are the writer’s and are not necessarily endorsed by the Anchorage Daily News, which welcomes a broad range of viewpoints. To submit a piece for consideration, email commentary(at)adn.com . Send submissions shorter than 200 words to letters@adn.com or click here to submit via any web browser . Read our full guidelines for letters and commentaries here ."
  },
  {
    "url": "https://www.yahoo.com/news/opinion-trump-put-geothermal-position-143000848.html",
    "url_mobile": "",
    "title": "Opinion - Trump can put geothermal in a position to power America future",
    "seendate": "20250507T171500Z",
    "socialimage": "https://media.zenfs.com/en/the_hill_articles_341/0adf333879c0b1ea40e29be94694666d",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Opinion - Trump can put geothermal in a position to power America’s future The Trump administration is getting it right when it comes to the importance of American energy dominance and bolstering domestic energy production. And, with its National Energy Emergency executive order, geothermal energy is getting the attention it deserves. That’s why we, as conservatives, are united behind an “all-of-the-above-and-below” energy approach. Utilizing the full range of energy options we have here at home will bolster American energy manufacturing, creating economic boosts in communities across the country and strengthening our national security. Geothermal energy is a small but mighty part of our nation’s energy mix. In 2023, this unique energy source generated only 3.9 gigawatts (GW) of electricity onto America’s electric grid — just 0.4 percent of our total electricity. Advertisement Advertisement Advertisement Advertisement This underutilized technology taps into heat stored in the earth to generate electricity or provide heating and cooling for a variety of applications. Geothermal energy is reliable, resilient and affordable nearly 100 percent of the time. Traditionally, these technologies are only useful in areas with easily accessible heat resources, such as those in the American West or in Iceland. However, by adopting innovations from the oil and gas industry — such as hydraulic fracturing and horizontal drilling — geothermal hot spots are much more accessible. Some estimates suggest that these innovations could eventually unlock up to 5,000 GW of energy right here in the U.S. That’s more than four times the capacity of all current U.S. power plants combined. Today, geothermal energy’s benefits are already making a difference for many Americans, especially in Texas. Since 2010, almost every school in Denton Independent School District has used geothermal cooling systems to improve air conditioning efficiency, lowering energy costs in the hot Texas summer. That’s making high-quality education more of a reality for students. Advertisement Advertisement Advertisement Advertisement The military also sees value in geothermal energy. Last September, the U.S. Air Force signed a deal with Sage Geosystems, a Houston-based startup company, to construct a demonstration project that utilizes geothermal energy for energy storage in Starr County, Texas. If successful, the Air Force may develop a full-scale project at Ellington Field Joint Air Reserve Base in Houston, providing the reliable energy needed for America’s military installations. Although geothermal energy is on the cusp of significant growth, it is not widely known by the public. That makes our mission simple: educating Americans about the untapped potential of this critical resource, promoting policies that unlock American resources and combatting policies that reduce investments into domestic energy research, development and deployment. Last month, CRES Forum and Project Innerspace co-hosted an event on Capitol Hill to do just that. The event, which was open to the public, brought together industry leaders, policymakers, advocates and academics to highlight the opportunity presented by advanced geothermal technologies. During the event, we shared our strong support for geothermal energy and provided a conservative case for the technology. We were also joined by Energy Secretary Chris Wright, Rep. August Pfluger (another Texan) and Sen. John Curtis (R-Utah), who all voiced strong support as well. But talk is cheap, and securing federal support that incentivizes private investment is not an easy task. That’s why we pledge to work with the president and Congress to enact meaningful policies that lower energy prices, promote domestic energy production and achieve energy dominance. Advertisement Advertisement Advertisement Advertisement And with new, private investments into geothermal projects exceeding $1 billion since September 2022, we have a leg up to advance President Trump’s robust energy agenda. Not to mention, this will benefit Americans nationwide, from our hometowns of Virginia Beach, Va., to Friendswood, Texas, and beyond. Now, with renewed conservative leadership in the White House, American energy dominance isn’t just possible, it’s inevitable. But we must play our cards right. Advancing federal energy policy using an “all-of-the-above-and-below” approach will allow us to bolster domestic energy production, curb our reliance on foreign entities, lower energy costs and create good paying jobs nationwide. And a kicker for those skeptical? We can utilize geothermal with essentially no emissions. Sounds like a win-win. Heather Reams is president of CRES, a nonprofit that seeks conservative solutions to address America’s energy, economic and environmental security. Randy Weber represents the 14th District in Texas. Copyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. For the latest news, weather, sports, and streaming video, head to The Hill. About Our Ads"
  },
  {
    "url": "https://techcrunch.com/2025/05/07/trump-administration-plans-to-shutter-money-saving-energy-star-program/",
    "url_mobile": "",
    "title": "Trump administration plans to shutter money - saving Energy Star program",
    "seendate": "20250507T161500Z",
    "socialimage": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-644937984.jpeg",
    "domain": "techcrunch.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "For years, the U.S. Environmental Protection Agency’s (EPA) Energy Star program has helped consumers save a collective $40 billion in annual energy costs. Now, the Trump administration wants to wind it down, according to a report from CNN. The Energy Star program, which has a budget of $32 million, is a public-private partnership that works with appliance and electronics manufacturers to certify energy-efficient products while also helping consumers find rebates to lower the purchase cost. “Eliminating the Energy Star program would directly contradict this administration’s promise to reduce household energy costs,” Paula Glover, president of the nonprofit coalition Alliance to Save Energy, said in a statement. The program delivers a 350-to-one return on investment, she added. Energy Star was created in 1992 under President George H. W. Bush, and it was reauthorized in 2005 under President George W. Bush, placing oversight for the program under the EPA and the Department of Energy. The program’s signature yellow labels appear on appliances and electronics for sale throughout the U.S., informing consumers of how much they’ll spend on electricity or natural gas throughout a year of typical use. Energy Star saves the average U.S. household about $450 on their energy bills each year."
  },
  {
    "url": "https://thehill.com/opinion/5286485-trump-energy-dominance/",
    "url_mobile": "https://thehill.com/opinion/5286485-trump-energy-dominance/amp/",
    "title": "Trump administration backs geothermal energy for energy dominance",
    "seendate": "20250507T150000Z",
    "socialimage": "https://thehill.com/wp-content/uploads/sites/2/2025/05/AP25023474958946.jpg",
    "domain": "thehill.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Opinion The views expressed by contributors are their own and not the view of The Hill Trump can put geothermal in a position to power America’s future by Heather Reams and Rep. Randy Weber (R-Texas), opinion contributors - 05/07/25 10:30 AM ET by Heather Reams and Rep. Randy Weber (R-Texas), opinion contributors - 05/07/25 10:30 AM ET Share ✕ LinkedIn LinkedIn Email Email The Trump administration is getting it right when it comes to the importance of American energy dominance and bolstering domestic energy production. And, with its National Energy Emergency executive order, geothermal energy is getting the attention it deserves. That’s why we, as conservatives, are united behind an “all-of-the-above-and-below” energy approach. Utilizing the full range of energy options we have here at home will bolster American energy manufacturing, creating economic boosts in communities across the country and strengthening our national security. Geothermal energy is a small but mighty part of our nation’s energy mix. In 2023, this unique energy source generated only 3.9 gigawatts (GW) of electricity onto America’s electric grid — just 0.4 percent of our total electricity. This underutilized technology taps into heat stored in the earth to generate electricity or provide heating and cooling for a variety of applications. Geothermal energy is reliable, resilient and affordable nearly 100 percent of the time. Traditionally, these technologies are only useful in areas with easily accessible heat resources, such as those in the American West or in Iceland. However, by adopting innovations from the oil and gas industry — such as hydraulic fracturing and horizontal drilling — geothermal hot spots are much more accessible. Some estimates suggest that these innovations could eventually unlock up to 5,000 GW of energy right here in the U.S. That’s more than four times the capacity of all current U.S. power plants combined. Today, geothermal energy’s benefits are already making a difference for many Americans, especially in Texas. Since 2010, almost every school in Denton Independent School District has used geothermal cooling systems to improve air conditioning efficiency, lowering energy costs in the hot Texas summer. That’s making high-quality education more of a reality for students. The military also sees value in geothermal energy. Last September, the U.S. Air Force signed a deal with Sage Geosystems, a Houston-based startup company, to construct a demonstration project that utilizes geothermal energy for energy storage in Starr County, Texas. If successful, the Air Force may develop a full-scale project at Ellington Field Joint Air Reserve Base in Houston, providing the reliable energy needed for America’s military installations. Although geothermal energy is on the cusp of significant growth, it is not widely known by the public. That makes our mission simple: educating Americans about the untapped potential of this critical resource, promoting policies that unlock American resources and combatting policies that reduce investments into domestic energy research, development and deployment. Last month, CRES Forum and Project Innerspace co-hosted an event on Capitol Hill to do just that. The event, which was open to the public, brought together industry leaders, policymakers, advocates and academics to highlight the opportunity presented by advanced geothermal technologies. During the event, we shared our strong support for geothermal energy and provided a conservative case for the technology. We were also joined by Energy Secretary Chris Wright, Rep. August Pfluger (another Texan) and Sen. John Curtis (R-Utah), who all voiced strong support as well. But talk is cheap, and securing federal support that incentivizes private investment is not an easy task. That’s why we pledge to work with the president and Congress to enact meaningful policies that lower energy prices, promote domestic energy production and achieve energy dominance. And with new, private investments into geothermal projects exceeding $1 billion since September 2022, we have a leg up to advance President Trump’s robust energy agenda. Not to mention, this will benefit Americans nationwide, from our hometowns of Virginia Beach, Va., to Friendswood, Texas, and beyond. Now, with renewed conservative leadership in the White House, American energy dominance isn’t just possible, it’s inevitable. But we must play our cards right. Advancing federal energy policy using an “all-of-the-above-and-below” approach will allow us to bolster domestic energy production, curb our reliance on foreign entities, lower energy costs and create good paying jobs nationwide. And a kicker for those skeptical? We can utilize geothermal with essentially no emissions. Sounds like a win-win. Heather Reams is president of CRES, a nonprofit that seeks conservative solutions to address America’s energy, economic and environmental security. Randy Weber represents the 14th District in Texas. Add as preferred source on Google Tags energy independence Geothermal Rep. August Pfluger Texas united states Copyright 2025 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Share ✕ LinkedIn LinkedIn Email Email More Opinion News See All Robby's Radar Barstool’s Dave Portnoy slams antisemites, says hate is rising by Robby Soave, opinion contributor 9 hours ago Robby's Radar / 9 hours ago Healthcare More veterans deserve lifesaving service dogs like Apollo by Andrew Theberge, opinion contributor 9 hours ago Healthcare / 9 hours ago Healthcare Bill Cassidy should make sure Casey Means isn’t America’s doctor by Irwin Redlener, opinion contributor 10 hours ago Healthcare / 10 hours ago International Can Trump close the deal in Gaza and bring lasting peace to the Middle East? by David E. Price, opinion contributor 10 hours ago International / 10 hours ago See All Video/Hill.TV See all Hill.TV See all Video Rising Rising: November 11, 2025 by TheHill.com 11/11/25 12:07 PM ET Rising / 10 hours ago Rising Rising: November 10, 2025 by TheHill.com 1 day ago Rising / 1 day ago Rising Rising: November 7, 2025 by TheHill.com 4 days ago Rising / 4 days ago See all Hill.TV See all Video Top Stories See All Court Battles Supreme Court extends SNAP payment pause over Jackson’s objection by Zach Schonfeld 4 hours ago Court Battles / 4 hours ago See All Most Popular Who could qualify for Trump’s suggested $2K tariff rebate? What’s happened ... Northern lights possible in much of US amid severe storm watch: What to know Jeffries, Democrats will offer 3-year extension of ObamaCare subsidies Federal THC ban send hemp companies scrambling The VA’s disability evaluation is failing veterans What to know about Trump’s $2K tariff check proposal Supreme Court extends SNAP payment pause over Jackson’s objection Deal to reopen government slowed by Paul objection on hemp language Live updates: House eyes Wednesday vote to end shutdown; justices keep SNAP ... Trump bristles as ‘affordability’ takes center stage Watchdog group asks for investigation into Lindsey Halligan over Comey, James ... Why a handful of Democratic senators decided to end the shutdown What’s in the Senate deal to reopen government? Schumer stares down progressive fury over handling of shutdown Fetterman knocks Democrats ‘celebrating crazypants’ Marjorie Taylor Greene California Republican criticizes Johnson’s handling of redistricting These are the 8 Senate Democrats who voted to end the shutdown Live updates: Bill to end government shutdown passes Senate, heads to House Load more"
  },
  {
    "url": "https://techcrunch.com/2025/05/07/trump-admin-plans-to-shutter-money-saving-energy-star-program/",
    "url_mobile": "",
    "title": "Trump admin plans to shutter money - saving Energy Star program",
    "seendate": "20250507T141500Z",
    "socialimage": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-644937984.jpeg",
    "domain": "techcrunch.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "For years, the U.S. Environmental Protection Agency’s (EPA) Energy Star program has helped consumers save a collective $40 billion in annual energy costs. Now, the Trump administration wants to wind it down, according to a report from CNN. The Energy Star program, which has a budget of $32 million, is a public-private partnership that works with appliance and electronics manufacturers to certify energy-efficient products while also helping consumers find rebates to lower the purchase cost. “Eliminating the Energy Star program would directly contradict this administration’s promise to reduce household energy costs,” Paula Glover, president of the nonprofit coalition Alliance to Save Energy, said in a statement. The program delivers a 350-to-one return on investment, she added. Energy Star was created in 1992 under President George H. W. Bush, and it was reauthorized in 2005 under President George W. Bush, placing oversight for the program under the EPA and the Department of Energy. The program’s signature yellow labels appear on appliances and electronics for sale throughout the U.S., informing consumers of how much they’ll spend on electricity or natural gas throughout a year of typical use. Energy Star saves the average U.S. household about $450 on their energy bills each year."
  },
  {
    "url": "https://www.azfamily.com/2025/05/07/trump-administration-plans-eliminate-energy-star-program/",
    "url_mobile": "https://www.azfamily.com/2025/05/07/trump-administration-plans-eliminate-energy-star-program/?outputType=amp",
    "title": "Trump administration plans to eliminate Energy Star program",
    "seendate": "20250507T043000Z",
    "socialimage": "https://gray-kpho-prod.gtv-cdn.com/resizer/v2/JZPTEBF7YJC2FHV64K4ZF4BOWM.png?auth=46243f7ec6a0777979d473ce4cec5442337cfbc39ec4315d89dfd6b0f886e153&smart=true",
    "domain": "azfamily.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "PHOENIX (AZFamily) — A popular program that helps people save money on their utility bills may be going away. The Trump administration is reportedly planning to eliminate the Energy Star program. The bright yellow cards used when shopping for appliances have played a big part in consumers’ shopping decisions for more than 30 years. Real estate agent Kathy Chance said she likes to know how energy efficient an appliance is and which can save her the most money. “It absolutely matters to me,” said Chance. “I’m looking to save dollars any way I can, so energy efficiency is one those areas I’m very concerned about.” The Energy Star program began in 1992, during the first Bush administration, as a way to help the public find products, incentives and tax credits that would lower their electric bills. According to the nonprofit Alliance to Save Energy , Energy Star helps American families save $40 billion in annual energy costs, but that may not be enough to save the program. The Trump administration is set to eliminate Energy Star as part of its push to reduce the size of federal agencies. Alliance to Save Energy president Paula Glover told CNN that “eliminating the Energy Star program would directly contradict this administration’s promise to reduce household energy costs.” Still, not everyone is convinced doing away with Energy Star is a big deal. Rick Biederbeck, CEO of Spencer’s TV and Appliance , told Arizona’s Family that appliances are far more energy efficient than 20 years ago, so there’s not much difference in savings between an Energy Star appliance and a non-Energy Star unit. He explained that even if Energy Star disappears, consumers will still be able to see an appliance’s efficiency information. “They won’t notice very much, because everything in your home, Energy Star versus no Energy Star, you might spend about $4 to $5 a month more to operate a non energy star home vs energy star, there’s very little difference,” said Biederbeck. There has been no announcement about when the Energy Star program would end. See a spelling or grammatical error in our story? Please click here to report it . Do you have a photo or video of a breaking news story? Send it to us here with a brief description. Copyright 2025 KTVK/KPHO. All rights reserved."
  },
  {
    "url": "https://www.newsweek.com/donald-trump-energy-star-program-appliances-cut-epa-2068778",
    "url_mobile": "",
    "title": "How Donald Trump Elimination of Energy Star Program Could Affect Tax Credits",
    "seendate": "20250506T210000Z",
    "socialimage": "https://d.newsweek.com/en/full/2639687/kitchen-appliances.jpg",
    "domain": "newsweek.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "... By Kate Nalepinski Audience Growth Strategist Share Newsweek is a Trust Project member The Trump administration is poised to eliminate the U.S. Environmental Protection Agency's (EPA) Energy Star program , a measure that would reverberate through millions of U.S. households and businesses that rely on it for energy efficiency guidance and tax benefits. The Washington Post reported the cuts on Tuesday, citing sources familiar with the move. Officials in President Donald Trump 's administration announced during a meeting on Monday at the EPA's Office of Atmospheric Protection that the office would be dissolved and the Energy Star program discontinued. Energy Star, known for its blue label and yellow EnergyGuide sticker found on appliances and homes, certifies products and buildings that meet certain energy-efficiency standards. Since its inception in 1992, the program has helped consumers save energy and money on utility bills, per the Energy Star website . ... Newsweek has contacted the EPA and Energy Star for comment on Tuesday. What Is the Energy Star Program? First launched by the EPA, the Energy Star program identifies and promotes energy-efficient products and practices. Goods from refrigerators to air conditioners, as well as entire buildings and homes, can receive the Energy Star label when they meet energy efficiency benchmarks. According to the Department of Energy , in 2010, Americans saved nearly $18 billion on utility bills by way of the program. Trump first suggested canceling or privatizing Energy Star in his first term. How Does Energy Star Work? First, Energy Star creates guidelines. From there, manufacturers voluntarily submit products for certification to earn the Energy Star label. Products must meet energy performance guidelines established by the EPA, and third-party certification is involved to ensure credibility of the label. According to Energy Star, thousands of manufacturers and retailers have partnered with the EPA to sell these products. How Could Energy Star Affect Tax Credits? Beyond savings on energy bills, the Energy Star program ties directly into federal tax credits, which many homeowners use to offset costs of upgrading to energy-efficient equipment. As it stands now, through 2032, federal income tax credits are available to homeowners that allow up to $3,200 annually, to lower the cost of energy efficient home upgrades by up to 30 percent, according to Energy Star's tax credit page . Through the program, some homeowners can save $2,000 on costs just to upgrade air source heat pumps, heat pump water heaters, and biomass stoves and boilers to eco-friendly options. Consumers can also claim credits for other Energy Star-certified systems, including insulation, windows and solar energy systems. These credits were expanded under the Inflation Reduction Act 2022 . Paula Glover, president of nonprofit Alliance to Save Energy, told CNN : \"Eliminating the Energy Star program would directly contradict this administration's promise to reduce household energy costs.\" Glover continued: \"For just $32 million a year, Energy Star helps American families save over $40 billion in annual energy costs. That's a return of $350 for every federal dollar invested.\" A portion of the Inflation Reduction Act does reference Energy Star requirements in defining eligible improvements. But it's unclear how federal tax credits under the act would change if the program gets cut. If the program is axed, it's possible that consumers who opted for eco-friendly appliances could be denied tax benefits for which they may have budgeted. If Energy Star is eliminated before the end of the 2025 tax year, homeowners who purchase upgrades in anticipation of tax credits could also face challenges down the line. Request Reprint & Licensing Submit Correction View Editorial & AI Guidelines Add Newsweek as a preferred source on Google to see more of our trusted coverage when you search. Recommended For You News Uncommon Knowledge: Trump’s Shutdown Victory Has a Reality Check 5 min read News Who Is Jonathan Braun? Drug Dealer Freed by Trump Sent Back to Prison 4 min read News Green Card Applicant Truck Driver Detained by ICE 4 min read News List of Flights Canceled With Shutdown Deal Close 3 min read News Chicago Gangs Issue ‘Shoot on Sight’ Order Targeting Immigration Officials 4 min read News Winter Storm Warning as 10 Inches of Snow To Hit 4 min read Related Podcasts Top Stories World Black Soldiers Removed From WW2 Memorial Sparks Fury From Family 5 min read News Gavin Newsom Reacts to Report of Trump’s New California Oil Drilling Plan 3 min read News Why Israel Is Still Striking Gaza and Lebanon After Ceasefires 9 min read News California Push for Transgender Sports Inclusivity May Face Olympic Setback 5 min read U.S. Donald Trump’s Negative Approval Rating Breaks Unwanted Record 5 min read NFL Disney Suffers $30 Million-Plus Loss Amid ESPN, YouTube TV Dispute 3 min read Trending Social Security New Bill Would Increase Social Security Payments: Full List of Cosponsors 4 min read Weather Winter Storm Warning as 10 Inches of Snow To Hit 4 min read Social Security Social Security Bill May Increase Benefits by $200 Per Month 4 min read NWS Winter Storm Warnings as 15 Inches of Snow To Strike 8 min read SNAP benefits When Will SNAP Benefits Resume? Updated Timeline for November Payments 3 min read Opinion Opinion Conventional Wisdom: The Beginning of the End of the Shutdown Edition 3 min read Opinion Veterans Are an Untapped Workforce Essential to America’s Future | Opinion 5 min read Opinion The High Stakes of Open Enrollment—Why You Shouldn’t Forgo Coverage | Opinion 4 min read Opinion This May Be the End of the Democrats | Opinion 5 min read Opinion What if Climate Policy Started with Health—and Grew the Economy? | Opinion 5 min read"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/rising-business-energy-demand-creates-new-challenges--and-a-major-opportunity--for-providers-says-ey-research-302447091.html",
    "url_mobile": "",
    "title": "Rising business energy demand creates new challenges -- and a major opportunity -- for providers , says EY research",
    "seendate": "20250506T104500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Over 70% of businesses plan to increase focus on electrification, emissions, and energy costs over the next three years 66% are concerned about accessing the reliable energy needed to grow 64% of businesses say rising and unstable energy costs are impacting profitability and competitiveness LONDON , May 6, 2025 /PRNewswire/ -- A surge in business energy demand is reshaping the global energy landscape — and pushing energy providers to rethink how they support growth and deliver value. According to new EY research, two-thirds of businesses are concerned about accessing the reliable energy needed to grow, while 64% say that rising and unstable energy costs are already impacting their profitability and competitiveness. With energy now seen as a critical enabler of growth — not just an operational cost — this volatility is creating significant uncertainty for businesses across sectors. The findings are part of the latest EY Navigating the Energy Transition research program , which this year surveyed over 2,400 decision-makers at large to mid-sized businesses across eight global markets. The research highlights the urgent need for providers to reinvent the business energy experience, as electricity demand is expected to double by 2050, with businesses expected to drive three-quarters of this growth. Greg Guthridge , EY Global Industrials & Energy Customer Experience Transformation Leader, says: \"This isn't just about keeping the lights on. Successfully navigating accelerating business energy growth will drive energy prosperity and fuel the intelligent economies of the future.\" Businesses want growth and green — not one or the other The research reveals that more than 70% of businesses plan to increase their focus on electrification, emissions reduction, and energy cost management in the next three years. However, outdated technologies, siloed operations, and limited sector-specific expertise have left many frustrated with their providers — and ready to look elsewhere. The pressure to deliver access to sustainable energy is also intensifying. 70% of businesses plan to invest in on-site generation and battery storage, seeking greater self-sufficiency and control. At the same time, sustainability remains a priority — but not at the expense of growth. Businesses are clear: they expect tailored solutions that support both, and if their energy provider can't deliver, they'll find one who can or take matters into their own hands. Serge Colle , EY Global Power & Utilities Leader, says: \"Energy is no longer just a commodity, it's a competitive asset — and providers that offer the right mix of expertise, insight, and collaboration will be the ones that help businesses unlock long-term value.\" Energy strategy is now a business strategy According to the research, 71% of businesses have defined energy strategies, and most are actively looking to build, buy, or partner to strengthen energy capabilities. However, 42% say they want their energy providers to act as energy advocates — not just suppliers. Only a third are currently open to providers taking on more advanced roles such as platform orchestrators or solution providers, pointing to a critical gap in perception and positioning. As demand rises and expectations shift, the message from business is clear: providers must move fast to transform the energy experience. This includes delivering more intelligent, tailored solutions and digital tools — including artificial intelligence, which 71% of businesses want integrated into their energy interactions. Guthridge says: \"The stakes are high. But so is the opportunity. Providers that act now — by engaging with business customers in new ways and rethinking their role in the energy ecosystem — will not only unlock new growth, but help shape a more resilient, sustainable, and prosperous energy future.\" EY outlines six actions to turn soaring energy demand into lasting prosperity for providers to consider. Find out more here. Aparna Sankaran EY Global Media Relations +44 (0)207 480 245082 [email protected] SOURCE EY 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-05/65313036-rising-business-energy-demand-creates-new-challenges-and-a-major-opportunity-for-providers-says-ey-research-008.htm",
    "url_mobile": "",
    "title": "Rising business energy demand creates new challenges -- and a major opportunity -- for providers , says EY research",
    "seendate": "20250506T104500Z",
    "socialimage": "",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Nachrichten » Rising business energy demand creates new challenges -- and a major opportunity -- for providers, says EY research Push Mitteilungen PR Newswire 06.05.2025 12:18 Uhr 230 Leser Artikel bewerten: ( 1 ) Rising business energy demand creates new challenges -- and a major opportunity -- for providers, says EY research Over 70% of businesses plan to increase focus on electrification, emissions, and energy costs over the next three years 66% are concerned about accessing the reliable energy needed to grow 64% of businesses say rising and unstable energy costs are impacting profitability and competitiveness LONDON, May 6, 2025 /PRNewswire/ -- A surge in business energy demand is reshaping the global energy landscape - and pushing energy providers to rethink how they support growth and deliver value. According to new EY research, two-thirds of businesses are concerned about accessing the reliable energy needed to grow, while 64% say that rising and unstable energy costs are already impacting their profitability and competitiveness. With energy now seen as a critical enabler of growth - not just an operational cost - this volatility is creating significant uncertainty for businesses across sectors. The findings are part of the latest EY Navigating the Energy Transition research program, which this year surveyed over 2,400 decision-makers at large to mid-sized businesses across eight global markets. The research highlights the urgent need for providers to reinvent the business energy experience, as electricity demand is expected to double by 2050, with businesses expected to drive three-quarters of this growth. Greg Guthridge, EY Global Industrials & Energy Customer Experience Transformation Leader, says: \"This isn't just about keeping the lights on. Successfully navigating accelerating business energy growth will drive energy prosperity and fuel the intelligent economies of the future.\" Businesses want growth and green - not one or the other The research reveals that more than 70% of businesses plan to increase their focus on electrification, emissions reduction, and energy cost management in the next three years. However, outdated technologies, siloed operations, and limited sector-specific expertise have left many frustrated with their providers - and ready to look elsewhere. The pressure to deliver access to sustainable energy is also intensifying. 70% of businesses plan to invest in on-site generation and battery storage, seeking greater self-sufficiency and control. At the same time, sustainability remains a priority - but not at the expense of growth. Businesses are clear: they expect tailored solutions that support both, and if their energy provider can't deliver, they'll find one who can or take matters into their own hands. Serge Colle, EY Global Power & Utilities Leader, says: \"Energy is no longer just a commodity, it's a competitive asset - and providers that offer the right mix of expertise, insight, and collaboration will be the ones that help businesses unlock long-term value.\" Energy strategy is now a business strategy According to the research, 71% of businesses have defined energy strategies, and most are actively looking to build, buy, or partner to strengthen energy capabilities. However, 42% say they want their energy providers to act as energy advocates - not just suppliers. Only a third are currently open to providers taking on more advanced roles such as platform orchestrators or solution providers, pointing to a critical gap in perception and positioning. As demand rises and expectations shift, the message from business is clear: providers must move fast to transform the energy experience. This includes delivering more intelligent, tailored solutions and digital tools - including artificial intelligence, which 71% of businesses want integrated into their energy interactions. Guthridge says: \"The stakes are high. But so is the opportunity. Providers that act now - by engaging with business customers in new ways and rethinking their role in the energy ecosystem - will not only unlock new growth, but help shape a more resilient, sustainable, and prosperous energy future.\" EY outlines six actions to turn soaring energy demand into lasting prosperity for providers to consider. Find out more here. Aparna Sankaran EY Global Media Relations +44 (0)207 480 245082 aparna.sankaran@uk.ey.com Logo - https://mma.prnewswire.com/media/1721690/EY_Logo.jpg View original content:https://www.prnewswire.co.uk/news-releases/rising-business-energy-demand-creates-new-challenges--and-a-major-opportunity--for-providers-says-ey-research-302447096.html © 2025 PR Newswire Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "http://africa.chinadaily.com.cn/a/202505/06/WS68196e81a310a04af22bda3f.html",
    "url_mobile": "",
    "title": "Steps to boost private energy economy",
    "seendate": "20250506T041500Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202505/06/68196e81a310a04a9677ca1f.jpeg",
    "domain": "africa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Business Macro Companies Industries Technology Motoring China Data Finance Top 10 Home / Business / Industries Home Business Industries Steps to boost private energy economy By ZHENG XIN | China Daily | Updated: 2025-05-06 10:05 Share Share - WeChat CLOSE The National Energy Administration released new measures recently aimed at significantly accelerating private sector investment and participation across the energy sector, including major projects like nuclear power, oil and gas infrastructure. The measures are designed to promote quick development of the private energy economy and guide it to become larger, better, and stronger in advancing the green and low-carbon energy transition and building a new energy system, the NEA said. Under the guidelines, private enterprises will be supported to take stakes in nuclear power projects and invest in major energy projects such as hydropower, oil and gas storage facilities, and oil and gas pipelines. Xu Xin, deputy director of the NEA's department of legal and institutional reform, said the administration will further support private investment in energy infrastructure, including innovative technologies and models such as new energy storage, virtual power plants, charging infrastructure, and smart microgrids. She added that the NEA encourages innovation, supporting deep private sector involvement in major energy technology innovation, collaborative research and results sharing. The measures also back digital and intelligent upgrades for private firms, the development of \"AI+\"applications, and the cultivation of advanced technologies and business models for energy equipment recycling, Xu said during a news conference in Beijing. This policy underscores Beijing's intent to leverage private sector dynamism and funding to accelerate the energy transition and boost innovation in areas like storage and smart grids, according to industry experts. The move could unlock substantial new investment and introduce greater market efficiency into China's vast energy landscape, said Lin Boqiang, head of the China Institute for Studies in Energy Policy at Xiamen University. The State Council approved recently the construction of 10 new reactors with a combined investment exceeding 200 billion yuan ($27.4 billion), including Phase III of the Sanmen Nuclear Power Plant in East China's Zhejiang province, introducing private enterprises with shareholdings exceeding 10 percent. This represents a notable increase from earlier instances of private participation in nuclear projects, such as the Zhejiang San'ao nuclear power projects approved in 2020, where the private enterprise took a 2 percent stake. Nuclear power has historically been dominated by State-owned enterprises due to its strategic importance and high entry barriers and the increase in private sector stakeholding to 10 percent in recently approved projects marks a significant policy shift aimed at attracting private capital and accelerating development in this strategic sector. In China, private companies are already major players in certain energy sub-sectors after years of development. In the charging infrastructure market, for example, private enterprises accounted for over 80 percent of large operators (those managing over 10,000 charging units) by the end of 2024, according to the NEA. Zhu Gongshan, chairman of GCL(Group) Holdings Co Ltd, China's largest private power conglomerate, said the involvement of private firms is expected to spur greater technological advancement and operational efficiency in the energy sector, leading to improved competitiveness and sustainability. \"A more market-driven energy sector would enhance the efficiency of resource allocation,\" he said. He cited China's solar power sector, from silicon production to building power stations, as a prime example of the private economy's growing influence in the country's energy transformation. Building a new energy system is seen as a technology and innovation-driven transformation. Many private enterprises are already deeply involved in national science and technology programs covering areas like smart grids, energy storage, hydrogen, renewable energy, and clean coal utilization, said Xu. Xu said that the new measures are expected to help create new investment growth points in the energy sector and make the private economy an indispensable force in the low-carbon energy transition, energy security and local economic growth. Photo China Post strives to ensure package delivery for 'Double Eleven' online shopping festival Wuzhen's Internet museum reopens with new highlights CIIE Culture Night celebrates fusion of global arts and culture beyond trade 2025 WIC Light of Internet Expo kicks off in Wuzhen Global participation surges at 8th CIIE as exhibits hit record highs CIIE 2025 breaks records as global participation surges Most Viewed in 24 Hours State Council News China’s public holidays for 2026 Policies concerning expats, foreign enterprises in October 2025 Top 10 Top 10 countries attracting Chinese tourists Business focus Silk Road e-commerce Dewu rides wave of Chinese consumption China Data A look at China's economic data from Jan-Sept SOEs Fund for SOEs in place to spur innovation Special fund to support strategic emerging industries launched in Beijing Special Scholar calls for a collaborative and secure AI future in Wuzhen WIC Wuzhen Summit Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US CLOSE"
  },
  {
    "url": "https://www.thehindubusinessline.com/markets/ather-energy-stocks-ather-energy-ipo-listing-shares-price-live-updates/article69541028.ece",
    "url_mobile": "",
    "title": "Ather Energy Share Price & IPO Listing Live : Ather to debut on D - Street today , eyes long - term EV growth",
    "seendate": "20250506T040000Z",
    "socialimage": "https://bl-i.thgim.com/public/incoming/l055rr/article69541032.ece/alternates/LANDSCAPE_1200/IMG_ATHER__1__new_2_1_E1EAH690.jpg",
    "domain": "thehindubusinessline.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "SENSEX 84,363.37 + 411.18 NIFTY 25,843.15 + 133.30 CRUDEOIL 5,011.00 -42.00 GOLD 127,980.00 + 972.00 SILVER 154,741.00 -1,863.00 SENSEX 84,363.37 + 411.18 NIFTY 25,843.15 + 133.30 NIFTY 25,843.15 + 133.30 CRUDEOIL 5,011.00 -42.00 CRUDEOIL 5,011.00 -42.00 GOLD 127,980.00 + 972.00 THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Ather Energy Listing Price Highlights: Ather shares erase listing gains, tumbles over 7% Ather Energy IPO Listing updates: Shares of electric two-wheeler maker Ather Energy Ltd on Tuesday debuted with a premium of over 2 per cent against the issue price of ₹321. By KS Badri Narayanan Team BL Updated - May 06, 2025 at 04:00 PM. × Share WhatsApp X Facebook LinkedIn Messenger Reddit Mail https://www.thehindubusinessline.com/markets/ather-energy-stocks-ather-energy-ipo-listing-shares-price-live-updates/article69541028.ece Copy Ather aims to use the proceeds to fund its Factory 3.0, R&D, marketing, and debt repayment | Photo Credit: Ather Energy Stocks Today, Ather Energy share price, Ather Energy IPO listing price updates: Shares of electric two-wheeler maker Ather Energy Ltd on Tuesday debuted with a premium of over 2 per cent against the issue price of ₹321. On the BSE, it started the trade at ₹326.05, up 1.57 per cent from the issue price. On the NSE, it listed at ₹328, a premium of 2.18 per cent. However, the stock erased listing gains and ended 7-9 per cent lower on bourses. IPO subscription: Ather Energy’s ₹2,981-crore IPO was subscribed 1.43 times on its final day, driven by strong interest from qualified institutional buyers (1.70x) and retail investors (1.78x), despite choppy market conditions. Non-institutional investors showed weaker interest with 66% subscription. The offer comprises a fresh issue of ₹2,626 crore and an offer-for-sale worth ₹354.8 crore by existing shareholders. Ather had earlier raised ₹1,340 crore from anchor investors. Price band: The IPO was priced at ₹304–321 per share, valuing the company at ₹11,956 crore at the upper band. This marked the first mainboard IPO of FY26 and the second electric two-wheeler company to go public, after Ola Electric. Use of funds: Ather aims to use the proceeds to fund its Factory 3.0, R&D, marketing, and debt repayment. While the company has shown strong growth, it remains unprofitable, and low EV penetration along with increasing competition suggests investors should remain cautious and look for clarity before investing. May 6, 2025 16:00 This live blog has ended. May 6, 2025 16:00 Ather Energy IPO Post-listing : Expert view Gaurav Garg, Lemonn Markets Desk Ather Energy made a muted debut on the stock market, opening with a modest 2% gain before slipping 8% intraday to close at approximately ₹303—below its lower issue price of ₹304. The IPO saw a lukewarm response, with the retail portion subscribed just 1.89 times and the HNI segment at a mere 0.69 times. The stock’s weak listing and subsequent dip reflect cautious investor sentiment around its steep valuation. However, continued downward pressure could help realign its valuation, potentially making it more attractive to value-conscious investors. May 6, 2025 15:52 Ather Energy share price, IPO Listing live: Shares end 7% lower on BSE Shares of Ather Energy closed 7.22% lower on the BSE at ₹302.50, after listing at ₹326.05. Screenshot 2025-05-06 154935.png The stock listed at nearly 2% premium over the IPO price of ₹321. On the NSE, the stock tumbled 8.54% to ₹300 (down from the listing price of ₹328) May 6, 2025 14:47 Ather Energy share price, IPO listing live: Highlights Ather Energy listing.jpg Ather Energy Listing: Mr. Tarun Mehta (Executive Director & Chief Executive Officer, Ather Energy Limited); Mr. Swapnil Jain (Executive Director & Chief Technical Officer, Ather Energy Limited) Shri Ashish Kumar Chauhan (MD and CEO, NSE) and Dr. Harish Ahuja (Head, Sustainability Carbon & Power Markets, Listing ( IPOs), SSE, NSE) in the presence of family members during the lamp lighting ritual at the listing ceremony of Ather Energy Limited at NSE. May 6, 2025 14:17 Ather Energy share price live: Shares down 5% as at 2.15 pm Screenshot 2025-05-06 141712.png May 6, 2025 13:22 Ather Energy share price live: Shares down 5% Shares of Ather Energy fell 5.14% on the BSE to ₹309.30 as at 1.22 pm. Day’s high: ₹332.90 Day’s low: ₹306 Open: ₹326.05 May 6, 2025 12:36 Ather Energy share price live: Shares down on BSE Screenshot 2025-05-06 123623.png May 6, 2025 12:05 Ather Energy IPO Listing, share price live: NSE greets Ather on listing (Source: X/@NSEIndia) May 6, 2025 12:00 Ather Energy IPO Listing, share price live: Shares trade in negative territory Shares of Ather Energy fell 4.79% to ₹312.30 on the NSE as at 11.59 am. On the BSE, it fell 4.40% to ₹311.70. May 6, 2025 11:32 Ather Energy IPO listing live: Glimpse of listing ceremony Ather Energy listing ceremony 1.jpg Ather Energy listing ceremony 2.jpg Ather Energy listing ceremony.jpg (Source: X/@NSEIndia) May 6, 2025 11:02 Ather Energy IPO Listing, share price live: Stock falls 5% post premium listing Shares of Ather Energy slumped 4.92% on the NSE to ₹311.85 as at 11 am, after listing at ₹328 (against issue price of ₹321) Screenshot 2025-05-06 110009.png May 6, 2025 10:28 Ather Energy IPO listing live: Climbs 2% in trading debut - Reuters India’s Ather Energy rose 2% in pre-open market in its trading debut on Tuesday, as investors bet on the electric scooter maker’s research and development capabilities. The stock listed at 328 rupees on the National Stock Exchange of India, higher than its offer price of 321 rupees. The company’s initial public offering of $352 million - the third-largest in India this year - was hauled over the finish line by institutional investors such as Abu Dhabi Investment Authority and Temasek. While some existing investors including GIC and Tiger Global sold shares in the IPO, Ather’s largest shareholder, Hero MotoCorp, did not. Ather, one of the first companies to sell e-scooters in India in 2018, had reduced its IPO size by roughly 15% and cut its targeted valuation by 44%. The company, whose founder refers to their tech-loaded scooters as the “Apple of electric two-wheelers”, is counting on newer models to turn profitable and close the gap with rivals Ola Electric, TVS Motor and Bajaj Auto . The Bengaluru-based company will use most of the IPO proceeds to build a third factory and for R&D Reuters May 6, 2025 10:27 Ather Energy IPO listing live: Listing on the NSE Catch live action: (Source: @NSEIndia) May 6, 2025 10:15 Ather Energy IPO Live: Shares dip after premium listing Shares of Ather Energy traded at ₹324.90 on the BSE, down 0.35% of the listing price of ₹326.05. The stock debuted at 1.5% premium over the IPO price of ₹321. Screenshot 2025-05-06 101310.png May 6, 2025 10:05 Ather Energy IPO listing live: Shares list at premium Shares of Ather Energy debuted on the NSE at ₹328 and on the BSE at ₹326.05, as against the IPO price of ₹321. May 6, 2025 09:19 Ather Energy listing: May be a low key affair Shares of Ather Energy will be listed at the bourses today. The company has fixed the IPO price at ₹321, at the upper end of the ₹304-321 price band. The IPO saw lacklustre interest, especially from high net worth individuals; as it was subscribed just 1.43 times. Being the first IPO of the current fiscal and from the electric vehicle segment, there has been a lot of buzz ahead of the issue opening. READ MORE May 6, 2025 09:16 Ather Energy IPO Listing live: Catch the live action May 6, 2025 08:38 Ather Energy listing today: Ventura recommends ‘subscribe for listing gains’ in Ather Energy IPO Ather Energy Ltd. will open its initial public offering (IPO) for subscription on April 28, 2025, and close on April 30, 2025. The issue consists of a fresh issue aggregating ₹2,626 crore and an offer for sale worth ₹354.76 crore. The price band is set at ₹304–₹321 per share. Shares are proposed to be listed on the BSE and NSE. Ventura recommends ‘subscribe for listing gains’ in Ather Energy IPO Ventura Securities recommends ’subscribe for listing gains’ for the Ather Energy IPO, says firm has a premium product lineup, charging infrastructure, and R&D focus. May 6, 2025 08:36 Ather Energy listing today: Ather Energy IPO: ₹530-crore ESOP bonanza EV two-wheeler major Ather Energy’s IPO will unlock ₹530 crore for its 1,300 employees who are under the company’s employee stock option plan (ESOP). Ather Energy IPO: ₹530-crore ESOP bonanza Ather Energy's IPO to raise funds for new factory, debt reduction, and employee stock options, targeting EV market growth. May 6, 2025 08:35 Stock market live updates today: Nuvama recommends ‘subscribe’ for Ather Energy IPO on growth potential, margin gains Ather Energy Ltd. will open its initial public offering on April 28, 2025, and close on April 30, 2025. The issue includes a fresh issue of ₹2,630 crore and an offer for sale of ₹350 crore. The price band is set at ₹304–₹321 per share, with proposed listing on the BSE and NSE. Nuvama recommends ‘subscribe’ for Ather Energy IPO on growth potential, margin gains Nuvama recommends ‘buy’ for Ather Energy IPO, says firm offers growth potential with expanding product platform, margin improvements, and capacity expansion strategies. May 6, 2025 08:34 Ather Energy listing day: Ather Energy IPO Highlights: IPO subscribed 1.43x Ather Energy IPO Today, Ather Energy IPO GMP Subscription Day 3 Live Updates April 30, 2025: The ₹2,981-crore IPO of Ather Energy was subscribed 28 per cent on day 2. All eyes are on Ather Energy as this is the first IPO on the main board for FY26. Its grand success could trigger a slew of companies to launch IPOs soon. Ather Energy IPO GMP Day 3 Updates: IPO Subscribed 1.43x, check GMP, subscription, price band, listing date and more Ather Energy Stocks Today, Ather Energy IPO GMP Subscription Day 3 Live Updates 30th Apr 2025: The ₹2,981-crore IPO of Ather Energy was booked 28 per cent on Day 2. All eyes are on Ather Energy as this is the first IPO on the main board for FY26. Its grand success could trigger a slew of companies to launch IPOs soon. IPO details: The maker of electric two-wheelers (E2Ws) has fixed the price band at ₹304–321. The IPO comprises a ₹2,626-crore fresh issue and an offer-for-sale (OFS) of 1.1 crore equity shares by the promoters and other existing shareholders for ₹354.75 crore. The market lot is 46 shares. It had raised ₹1,340 crore from anchor investors, which included several marquee names. Read more It concludes on April 30, 2025. About the company: Ather Energy Ltd (AEL), incorporated in 2013, is a pioneer in the Indian electric two-wheeler (E2W) market. May 6, 2025 08:31 Ather Energy: May 6, 2025 08:29 Ather Energy: Ather Energy listing: May be a low key affair Shares of Ather Energy will be listed at the bourses today. The company has fixed the IPO price at ₹321, at the upper end of the ₹304-321 price band. The IPO saw lacklustre interest, especially from high net worth individuals; as it was subscribed just 1.43 times. Being the first IPO of the current fiscal and from the electric vehicle segment, there has been a lot of buzz ahead of the issue opening. Ather Energy listing: May be a low key affair Ather Energy IPO listing today with lacklustre interest, potential flat to mildly negative listing expected, proceed allocation detailed. Comments Published on May 6, 2025 THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per month Access to comment on every story Sign up/Manage to our newsletters Get notified by email for early preview to new features, discounts & offers ✕ Looks like you are already logged in from more than 5 devices! To continue logging in, remove at least one device from the below list Log out Log Out from all devices Terms & conditions | Institutional Subscriber"
  },
  {
    "url": "http://europe.chinadaily.com.cn/a/202505/06/WS68196e81a310a04af22bda3f.html",
    "url_mobile": "",
    "title": "Steps to boost private energy economy",
    "seendate": "20250506T033000Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202505/06/68196e81a310a04a9677ca1f.jpeg",
    "domain": "europe.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Business Macro Companies Industries Technology Motoring China Data Finance Top 10 Home / Business / Industries Home Business Industries Steps to boost private energy economy By ZHENG XIN | China Daily | Updated: 2025-05-06 10:05 Share Share - WeChat CLOSE The National Energy Administration released new measures recently aimed at significantly accelerating private sector investment and participation across the energy sector, including major projects like nuclear power, oil and gas infrastructure. The measures are designed to promote quick development of the private energy economy and guide it to become larger, better, and stronger in advancing the green and low-carbon energy transition and building a new energy system, the NEA said. Under the guidelines, private enterprises will be supported to take stakes in nuclear power projects and invest in major energy projects such as hydropower, oil and gas storage facilities, and oil and gas pipelines. Xu Xin, deputy director of the NEA's department of legal and institutional reform, said the administration will further support private investment in energy infrastructure, including innovative technologies and models such as new energy storage, virtual power plants, charging infrastructure, and smart microgrids. She added that the NEA encourages innovation, supporting deep private sector involvement in major energy technology innovation, collaborative research and results sharing. The measures also back digital and intelligent upgrades for private firms, the development of \"AI+\"applications, and the cultivation of advanced technologies and business models for energy equipment recycling, Xu said during a news conference in Beijing. This policy underscores Beijing's intent to leverage private sector dynamism and funding to accelerate the energy transition and boost innovation in areas like storage and smart grids, according to industry experts. The move could unlock substantial new investment and introduce greater market efficiency into China's vast energy landscape, said Lin Boqiang, head of the China Institute for Studies in Energy Policy at Xiamen University. The State Council approved recently the construction of 10 new reactors with a combined investment exceeding 200 billion yuan ($27.4 billion), including Phase III of the Sanmen Nuclear Power Plant in East China's Zhejiang province, introducing private enterprises with shareholdings exceeding 10 percent. This represents a notable increase from earlier instances of private participation in nuclear projects, such as the Zhejiang San'ao nuclear power projects approved in 2020, where the private enterprise took a 2 percent stake. Nuclear power has historically been dominated by State-owned enterprises due to its strategic importance and high entry barriers and the increase in private sector stakeholding to 10 percent in recently approved projects marks a significant policy shift aimed at attracting private capital and accelerating development in this strategic sector. In China, private companies are already major players in certain energy sub-sectors after years of development. In the charging infrastructure market, for example, private enterprises accounted for over 80 percent of large operators (those managing over 10,000 charging units) by the end of 2024, according to the NEA. Zhu Gongshan, chairman of GCL(Group) Holdings Co Ltd, China's largest private power conglomerate, said the involvement of private firms is expected to spur greater technological advancement and operational efficiency in the energy sector, leading to improved competitiveness and sustainability. \"A more market-driven energy sector would enhance the efficiency of resource allocation,\" he said. He cited China's solar power sector, from silicon production to building power stations, as a prime example of the private economy's growing influence in the country's energy transformation. Building a new energy system is seen as a technology and innovation-driven transformation. Many private enterprises are already deeply involved in national science and technology programs covering areas like smart grids, energy storage, hydrogen, renewable energy, and clean coal utilization, said Xu. Xu said that the new measures are expected to help create new investment growth points in the energy sector and make the private economy an indispensable force in the low-carbon energy transition, energy security and local economic growth. Photo China Post strives to ensure package delivery for 'Double Eleven' online shopping festival Wuzhen's Internet museum reopens with new highlights CIIE Culture Night celebrates fusion of global arts and culture beyond trade 2025 WIC Light of Internet Expo kicks off in Wuzhen Global participation surges at 8th CIIE as exhibits hit record highs CIIE 2025 breaks records as global participation surges Most Viewed in 24 Hours State Council News China’s public holidays for 2026 Policies concerning expats, foreign enterprises in October 2025 Top 10 Top 10 countries attracting Chinese tourists Business focus Silk Road e-commerce Dewu rides wave of Chinese consumption China Data A look at China's economic data from Jan-Sept SOEs Fund for SOEs in place to spur innovation Special fund to support strategic emerging industries launched in Beijing Special Scholar calls for a collaborative and secure AI future in Wuzhen WIC Wuzhen Summit Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US CLOSE"
  },
  {
    "url": "http://usa.chinadaily.com.cn/a/202505/06/WS68196e81a310a04af22bda3f.html",
    "url_mobile": "",
    "title": "Steps to boost private energy economy",
    "seendate": "20250506T033000Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202505/06/68196e81a310a04a9677ca1f.jpeg",
    "domain": "usa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Business Macro Companies Industries Technology Motoring China Data Finance Top 10 Home / Business / Industries Home Business Industries Steps to boost private energy economy By ZHENG XIN | China Daily | Updated: 2025-05-06 10:05 Share Share - WeChat CLOSE The National Energy Administration released new measures recently aimed at significantly accelerating private sector investment and participation across the energy sector, including major projects like nuclear power, oil and gas infrastructure. The measures are designed to promote quick development of the private energy economy and guide it to become larger, better, and stronger in advancing the green and low-carbon energy transition and building a new energy system, the NEA said. Under the guidelines, private enterprises will be supported to take stakes in nuclear power projects and invest in major energy projects such as hydropower, oil and gas storage facilities, and oil and gas pipelines. Xu Xin, deputy director of the NEA's department of legal and institutional reform, said the administration will further support private investment in energy infrastructure, including innovative technologies and models such as new energy storage, virtual power plants, charging infrastructure, and smart microgrids. She added that the NEA encourages innovation, supporting deep private sector involvement in major energy technology innovation, collaborative research and results sharing. The measures also back digital and intelligent upgrades for private firms, the development of \"AI+\"applications, and the cultivation of advanced technologies and business models for energy equipment recycling, Xu said during a news conference in Beijing. This policy underscores Beijing's intent to leverage private sector dynamism and funding to accelerate the energy transition and boost innovation in areas like storage and smart grids, according to industry experts. The move could unlock substantial new investment and introduce greater market efficiency into China's vast energy landscape, said Lin Boqiang, head of the China Institute for Studies in Energy Policy at Xiamen University. The State Council approved recently the construction of 10 new reactors with a combined investment exceeding 200 billion yuan ($27.4 billion), including Phase III of the Sanmen Nuclear Power Plant in East China's Zhejiang province, introducing private enterprises with shareholdings exceeding 10 percent. This represents a notable increase from earlier instances of private participation in nuclear projects, such as the Zhejiang San'ao nuclear power projects approved in 2020, where the private enterprise took a 2 percent stake. Nuclear power has historically been dominated by State-owned enterprises due to its strategic importance and high entry barriers and the increase in private sector stakeholding to 10 percent in recently approved projects marks a significant policy shift aimed at attracting private capital and accelerating development in this strategic sector. In China, private companies are already major players in certain energy sub-sectors after years of development. In the charging infrastructure market, for example, private enterprises accounted for over 80 percent of large operators (those managing over 10,000 charging units) by the end of 2024, according to the NEA. Zhu Gongshan, chairman of GCL(Group) Holdings Co Ltd, China's largest private power conglomerate, said the involvement of private firms is expected to spur greater technological advancement and operational efficiency in the energy sector, leading to improved competitiveness and sustainability. \"A more market-driven energy sector would enhance the efficiency of resource allocation,\" he said. He cited China's solar power sector, from silicon production to building power stations, as a prime example of the private economy's growing influence in the country's energy transformation. Building a new energy system is seen as a technology and innovation-driven transformation. Many private enterprises are already deeply involved in national science and technology programs covering areas like smart grids, energy storage, hydrogen, renewable energy, and clean coal utilization, said Xu. Xu said that the new measures are expected to help create new investment growth points in the energy sector and make the private economy an indispensable force in the low-carbon energy transition, energy security and local economic growth. Photo China Post strives to ensure package delivery for 'Double Eleven' online shopping festival Wuzhen's Internet museum reopens with new highlights CIIE Culture Night celebrates fusion of global arts and culture beyond trade 2025 WIC Light of Internet Expo kicks off in Wuzhen Global participation surges at 8th CIIE as exhibits hit record highs CIIE 2025 breaks records as global participation surges Most Viewed in 24 Hours State Council News China’s public holidays for 2026 Policies concerning expats, foreign enterprises in October 2025 Top 10 Top 10 countries attracting Chinese tourists Business focus Silk Road e-commerce Dewu rides wave of Chinese consumption China Data A look at China's economic data from Jan-Sept SOEs Fund for SOEs in place to spur innovation Special fund to support strategic emerging industries launched in Beijing Special Scholar calls for a collaborative and secure AI future in Wuzhen WIC Wuzhen Summit Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US CLOSE"
  },
  {
    "url": "https://www.livemint.com/market/ipo/ather-energy-ipo-listing-date-today-heres-what-gmp-experts-signal-about-debut-of-shares-in-stock-market-today-11746476316076.html",
    "url_mobile": "https://www.livemint.com/market/ipo/ather-energy-ipo-listing-date-today-heres-what-gmp-experts-signal-about-debut-of-shares-in-stock-market-today/amp-11746476316076.html",
    "title": "Ather Energy IPO listing date today . Here what GMP , experts signal about debut of shares in stock market today",
    "seendate": "20250506T030000Z",
    "socialimage": "https://www.livemint.com/lm-img/img/2025/05/05/600x338/INDIA-AUTOSHOW--15_1740662163326_1746476861185.JPG",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "View Market Dashboard Ather Energy IPO listing date today. Here's what GMP, experts signal about debut of shares in stock market today Ather Energy IPO listing date is today, 6 May 2025, and the shares will be listed on both the stock exchanges, BSE and NSE. Latest GMP and analysts signal Ather Energy IPO listing to be at a modest 3-5% premium. Ankit Gohel Published 6 May 2025, 06:17 AM IST Ather Energy IPO listing date is today and the equity shares will be listed on BSE and NSE. ( Photo: Reuters ) Ather Energy IPO Listing: Ather Energy shares are set to make their debut in the Indian stock market today. The initial public offering (IPO) of electric vehicle (EV) manufacturer Ather Energy Ltd ended with modest demand. Ather Energy IPO listing date is today, May 6. The public issue was open for subscription from April 28 to April 30. The IPO allotment was finalised on May 2. Ather Energy IPO listing date has been fixed as May 6, Tuesday, and Ather Energy shares will be listed on both the stock exchanges, BSE and NSE. “Trading Members of the Exchange are hereby informed that effective from Tuesday, May 6, 2025, the equity shares of Ather Energy Limited shall be listed and admitted to dealings on the Exchange in the list of ‘B’ Group of Securities,” a notice on the BSE said. Also Read | Ather Energy IPO: Will the slow and steady builder outperform Ola on the markets Ather Energy shares will be a part of Special Pre-open Session (SPOS) on Tuesday, May 6, 2025, the notice added, and the stock will be available for trading from 10:00 AM. Ahead of the Ather Energy IPO listing today, investors watch out for the trends in the grey market premium (GMP) to gauge the estimated listing price. Here’s what Ather Energy IPO GMP indicates: Ather Energy IPO GMP Today Ather Energy shares are showing a muted trend in the unlisted market with a modest grey market premium (GMP) today. According to stock market observers, Ather Energy IPO GMP today is ₹ 14 per share. This indicates that in the grey market, Ather Energy shares are trading at ₹ 335 apiece, which is at a premium of 4.36% to its issue price of ₹ 321 per share. Analysts also expect Ather Energy IPO listing to be at a modest 3-5% premium, given the trends in the GMP today. “The final day subscription surge — particularly from Qualified Institutional Buyers (QIBs) — suggests a last-minute effort to support the issue amid fears of under-subscription. This points to a lack of broad-based enthusiasm and raises concerns about the IPO’s inherent demand quality. As a result, we expect a flat to mildly negative listing, likely in the range of ±5% under the best-case scenario,” said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd. Also Read | Ather Energy IPO allotment status declared. What GMP signals ahead of listing According to Tapse, flat Ather Energy IPO listing seems to be justified, as the issue was aggressively priced, especially when benchmarked against peer OLA Electric, whose post-listing performance has been underwhelming. “We believe the electric two-wheeler (EV 2W) segment remains highly competitive and capital-intensive, with most players, including market leaders, struggling to achieve sustainable profitability and raising concern with new investors. Given these facts, we recommend a “HOLD” only for high-risk taking investors, who are comfortable with short- to medium-term volatility while conservative investors may prefer a wait-and-watch approach, allowing the stock to establish a more reasonable valuation post-listing,” Tapse said. Industry being in High Growth – High Competition and High Cash Burning segment, we will see high volatility both in business as well as in the price action, hence investors should be aware of risk in short to medium term investing, he added. Gaurav Goel, Founder & Director at Fynocrat Technologies noted that Ather Energy IPO received a mixed response as overall demand was not very strong, especially among non-institutional investors (NII). Also Read | Wagons Learning IPO: Check price band, subscription, dates, GMP, other details “In the grey market, the premium is currently modest at around ₹ 7 per share, indicating only about a ~3-5% expected gain on listing day. This is much lower compared to more hyped IPOs. We expect Ather Energy stock to list flat to marginally positive, with limited near-term upside unless the company can quickly improve its financials and scale up production after listing,” Goel said. Ather Energy IPO Details Ather Energy IPO opened for subscription on April 28 and closed on April 30. The IPO allotment was finalized on May 2, and Ather Energy IPO listing date is today, May 6. Ather Energy shares will be listed on BSE and NSE. The ₹ 2,981.06-crore worth Ather Energy IPO was a combination of fresh issue of 8.18 crore equity shares amounting to ₹ 2,626.30 crore and offer for sale (OFS) of 1.11 crore equity shares aggregating to ₹ 354.76 crore. Ather Energy IPO price band was set at ₹ 321 per share. Also Read | Ather Energy IPO day 3 Highlights: Issue fully subscribed. Check details Ather Energy IPO was subscribed by 1.43 times in total as the issue received bids for 7.65 crore equity shares as against 5.33 crore shares on the offer, according to Ather Energy IPO subscription status data on NSE. Axis Capital, HSBC Securities & Capital Markets Pvt Ltd, JM Financial, Nomura Financial Advisory And Securities (India) Pvt Ltd are the book running lead managers of the Ather Energy IPO, while Link Intime India Private Ltd is the IPO registrar. Read all IPO news here Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. IPO IPO Listing Get Latest real-time updates Catch all the Business News , Market News , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates. Business News Markets IPO Ather Energy IPO listing date today. Here's what GMP, experts signal about debut of shares in stock market today HDFC Bank Share Price Reliance Industries Share Price TCS Share Price Infosys Share Price HUL Share Price More Story Url has been added to your clipboard Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/unlocking-innovation-endeavour-energy-and-mprest-expand-partnership-to-enhance-management-of-community-batteries-302446393.html",
    "url_mobile": "",
    "title": "Unlocking innovation : Endeavour Energy and mPrest expand partnership to enhance management of community batteries",
    "seendate": "20250505T223000Z",
    "socialimage": "https://mma.prnewswire.com/media/2679891/mPrest.jpg?p=facebook",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "SYDNEY and TEL AVIV, Israel , May 5, 2025 /PRNewswire/ -- Endeavour Energy and mPrest today announced the expansion of their strategic collaboration to deliver a dynamic market-network approach to energy storage and flexibility which enables customers, retailers and networks to work together to maximise the value of local energy resources. At the heart of this expanded partnership is the broader deployment of mPrest's Distributed Energy Resource Management System (mDERMS), which enables real-time monitoring and control of Endeavour Energy's growing fleet of community batteries. Endeavour Energy logo mPrest logo"
  },
  {
    "url": "https://www.thecable.ng/abbas-were-working-to-give-legal-backing-to-renewable-energy-policy/",
    "url_mobile": "",
    "title": "Abbas : Were working to give legal backing to renewable energy policy",
    "seendate": "20250505T223000Z",
    "socialimage": "https://www.thecable.ng/wp-content/uploads/2024/07/SPEAKER-ABBAS-TAJUDEEN1-e1744740959231.jpeg",
    "domain": "thecable.ng",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "The Nation Senate will fast-track constitution review, address Rivers crisis, says Opeyemi Bamidele by Jerrywright Ukwu May 6, 2025 7:50 am"
  },
  {
    "url": "https://tribuneonlineng.com/nigeria-leads-initiative-to-provide-electricity-for-300-million-africans-by-2030-abbas/",
    "url_mobile": "https://tribuneonlineng.com/nigeria-leads-initiative-to-provide-electricity-for-300-million-africans-by-2030-abbas/amp/",
    "title": "Nigeria leads initiative to provide electricity for 300 million Africans",
    "seendate": "20250505T211500Z",
    "socialimage": "https://tribuneonlineng.com/wp-content/uploads/2025/04/Hon.-Abbas-Tajudeen-1.webp",
    "domain": "tribuneonlineng.com",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "SHARE The Speaker of the House of Representatives, Hon. Abbas Tajudeen, on Monday expressed optimism that Nigeria is assuming a continental leadership role in the race to electrify Africa, with a bold target to help provide electricity to 300 million Africans by the year 2030. The Speaker made this statement in Lagos State while declaring open the First Legislative Conference and Expo on Renewable Energy in Nigeria , organised by the House Committee on Renewable Energy in collaboration with the United Nations Development Programme (UNDP). Speaker Abbas, who noted that Nigeria has no option but to adopt renewable energy as one of the ways to diversify the country’s economy, maintained that “it holds substantial implications for national policy agendas.” He said, “The transition to renewable energy is not just an economic necessity; it holds substantial implications for national policy agendas. Renewable energy has become central to initiatives aimed at fostering inclusive economic growth, climate adaptation, and industrial innovation. Countries that have embraced this change have decreased their vulnerability to global fuel price fluctuations, improved energy access, and positioned themselves as leaders in the low-carbon economy.” The Speaker added that renewable energy “is no longer a niche concern but a cornerstone of global development policy. In 2024, renewable energy additions reached five hundred eighty-five gigawatts, accounting for over ninety-two per cent of new power generation capacity worldwide. “The total installed capacity for renewable energy now exceeds 4,448 Gigawatts, marking a 15 percent year-on-year increase. This expansion, led by solar and wind technologies, underscores their cost-effectiveness and scalability. “Financial flows toward clean energy reinforce this trend. In 2023, of the estimated global energy investment of $2.8 trillion, 1.7 trillion was committed to renewable energy, energy efficiency, and electric mobility. This shift in capital allocation signifies a structural reorientation of the global energy economy, where more sustainable alternatives are increasingly displacing fossil fuels. “For Nigeria, a country that relies heavily on fossil fuel exports for its earnings, this transition presents both challenges and opportunities. As the global market shifts toward cleaner energy, countries like Nigeria will have no choice but to diversify their economy to maintain their financial stability while seeking investments in renewable energy sources to align with global trends.” To make headway, the Speaker added that robust legislation and oversight were vital in supporting any national effort to adopt and promote renewable energy. “For instance, Egypt’s Renewable Energy Law, enacted in 2014, has spurred investments in solar and wind power. Meanwhile, the European Union’s Renewable Energy Directive establishes binding national targets and promotes harmonised planning. In Germany, early legislation like the Renewable Energy Sources Act paved the way for decentralised energy generation and garnered widespread support.” Speaker Abbas reiterated Nigeria’s commitment to global energy reform, as demonstrated in the Legislative Agenda of the 10th House, which prioritises energy reform. “Specifically, Strategic Objective 8.5 of our Agenda aims to promote the transition to renewable energy while enhancing clean energy production and access. To achieve this, we are enacting laws that encourage private investment in renewable energy, including offering tax incentives and targeted financing. “Just a few weeks ago, the House of Representatives passed new tax reform bills that eliminate VAT on renewable energy and compressed natural gas (CNG), among other measures. We are also working to provide legal backing for the government’s Renewable Energy and Energy Efficiency Policy adopted in 2015, which seeks to boost the use of renewable energy, improve energy efficiency, and significantly reduce greenhouse gas emissions. “We acknowledge the urgent need to provide more access to clean cooking fuels, as this is crucial for public health and the environment. These initiatives are being developed in close collaboration with stakeholders, and the House Committee on Renewable Energy is coordinating legislative priorities in this area.” The Speaker added that President Bola Ahmed Tinubu’s administration’s policy commitments are notable, with the passage of the Electricity Act of 2023, which devolves power over the electricity sector to sub-national governments and ends the Federal Government’s exclusive control. “As a result, we expect new opportunities for local energy solutions and private sector involvement to emerge. “The administration has also committed significant funding. In December 2024 alone, the President approved a $1 billion financing initiative for the Rural Electrification Agency. Of this amount, $750 million has been allocated to expand solar energy access in underserved areas. As a result, this initiative has led to the deployment of 124 mini-grids and over 25,000 solar home systems, benefiting more than 200,000 people.” In his remarks, Chairman of the House Committee on Renewable Energy, Hon. Victor Afam Ogene, said that renewable energy, as an emerging sector in Nigeria, “has garnered significant attention from the government as a key solution to our electricity power supply issues, and deliberate steps are being taken to harness its potential.” He added that the growing consensus on achieving greater energy security and sustainability requires deliberate action to chart a new pathway in reducing Nigeria’s reliance on fossil fuels as a primary source of energy. “While we still grapple with finding the right balance between both, it is also important to point out that, paradoxically, we are yet to achieve meaningful energy sufficiency, even with our current focus on fossil fuel-based energy.” In a presentation, the UNDP Resident Representative, Elsie Attafuah, highlighted the importance of energy to Nigeria’s future, noting that it has “evolved into national security, economic power, and geopolitical leverage tool and instrument.” She added that, “Energy is the foundation for Nigeria’s economic diversification. Without it, neither industrial transformation nor acceleration is possible,” further noting that Nigeria possesses massive potential for energy transition and global power. ALSO READ FROM NIGERIAN TRIBUNE EXPOSED!! POPULAR ABUJA DOCTOR REVEALED HOW NIGERIA MEN CAN NOW NATURALLY AND PERMANENTLY CURE POOR ERECTION,QUICK EJACULATION, SMALL AND SHAMEFUL SIZE , WITHOUT SIDE EFFECTS. EVEN IF YOU ARE HYPERTENSIVE,DIABETES, OR BATTLING PROSTRATE...STOP THE USE OF HARD DRUG FOR SEX!! IT KILLS!. WATCH TOP VIDEOS FROM NIGERIAN TRIBUNE TV Back to School, Back to Business A Fresh Start Relationship Hangout: Public vs Private Proposals – Which Truly Wins in Love? “No” Is a Complete Sentence: Why You Should Stop Feeling Guilty Relationship Hangout: Friendship Talk 2025 – How to Be a Good Friend & Big Questions on Friendship Police Overpower Armed Robbers in Ibadan After Fierce Struggle Get real-time news updates from Tribune Online! Follow us on WhatsApp for breaking news, exclusive stories and interviews, and much more. Join our WhatsApp Channel now TAGGED: electricity Speaker Abbas Share This Article Facebook Email Print Previous Article Prof Mustapha’s reappointment duly authorised by Tinubu — NABRDA Next Article Niger gov adjusts Minna curfew time Most Read Strike suspension: ASUU gives update on negotiation with FG Wike: Four things to know about Major General Sarham Trump's threat: New twist as US congressman proposes sanctions on Nigeria I have over 500 body counts, slept with seven women at once — Adult film actor UK issues fresh travel warning for six Nigerian states over rising insecurity Pastor Adeboye, Tinubu, Trump and truth Kukah and a nation of marabouts Killings in Nigeria: Donald Trump spoke the truth — Orji Kalu VIDEO: Wike, naval officer in shouting match over alleged illegal land in Abuja Again, Court stops PDP National Convention Frontpage Today Subscribe to e-Paper"
  },
  {
    "url": "https://www.naftemporiki.gr/english/1952178/a-new-chapter-for-terna-energy-with-masdar-at-the-helm/",
    "url_mobile": "",
    "title": "A new chapter for TERNA Energy with Masdar at the helm",
    "seendate": "20250505T060000Z",
    "socialimage": "https://www.naftemporiki.gr/wp-content/uploads/2025/05/jaber.jpg",
    "domain": "naftemporiki.gr",
    "language": "English",
    "sourcecountry": "Greece",
    "ticker": "XLE",
    "industry": "Energy",
    "search_keyword": "energy",
    "article_text": "Following the acquisition of 100% of the company’s shares by Masdar last month and its delisting from the Athens Stock Exchange (ATHEX), TERNA Energy’s integration into Abu Dhabi Future Energy Company PJSC-Masdar, a company with a leading position in clean energy in the United Arab Emirates, was completed. In this context, led by His Excellency Dr. Sultan Al Jaber, Minister of Industry and Advanced Technology of the UAE and Chairman of Masdar and also present by the CEO Mohamed Jameel Al Ramahi, a delegation of the parent company visited the headquarters of TERNA ENERGY in Athens, where it met with its executives and employees. They held strategic discussions with TERNA ENERGY Executive Chairman Georgios Peristeris, the first since the acquisition, centered on Masdar’s strategy to expand the business and accelerate renewable energy growth in Southeastern and Central Europe. H.E. Dr Sultan Al Jaber, UAE Minister of Industry and Advanced Technology and Masdar Chairman, said: “Bringing TERNA ENERGY into the Masdar family strengthens our position in Greece and the wider region, enabling us to expediate the growth of renewable energy solutions and unlock the investment needed to empower nations to achieve their clean energy targets. This acquisition also demonstrates the commitment of both the UAE and Masdar to bringing affordable, secure and sustainable energy to all. ΔΙΑΒΑΣΤΕ ΕΠΙΣΗΣ ΔΥΠΑ: Νέο πρόγραμμα επιδότησης εργασίας – 50.000 θέσεις Through the acquisition, Masdar will simultaneously support Greece’s National Energy and Climate Plan, the EU’s ambition to reach net zero emissions by 2050, and advance its own global target of achieving 100 gigawatts (GW) of clean energy capacity by 2030. TERNA ENERGY is targeting an operational portfolio capacity of 6GW by 2030 and will be supported by Masdar’s long-term capital and global expertise.” Mohamed Jameel Al Ramahi, Masdar CEO, said: “With TERNA ENERGY now delisted from the Athens Stock Exchange, we can maximize and leverage the combined expertise and experience of both workforces to accelerate the implementation of clean energy projects in Greece and across the region. By establishing TERNA ENERGY as our flagship platform for the region, we will both support our own renewable energy objectives and drive energy transformation in Europe.” On his part, Georgios Peristeris, Chairman and CEO of GEK TERNA and Executive Chairman of TERNA ENERGY, said: “The delisting of TERNA ENERGY following its acquisition by Masdar marks the full integration of the two companies, creating a strong platform for accelerated growth based on their shared commitment to clean, affordable, and domestically produced energy. As part of Masdar’s global network, TERNA ENERGY is now ideally positioned to expand its leadership in the renewable energy sector in Greece and the wider region. The delisting from ATHEX follows a productive first quarter for TERNA ENERGY, which has seen the continuation of construction on key projects in Greece and Bulgaria, including the Amphilochia plant, one of largest pumped storage hydropower projects in Europe, and Masdar’s first pumped hydro project in the region. The business has also reached final investment decisions on new solar, wind and battery projects with combined capacity of 250MW. These plants are due to be operational within the next two years.” Share: Share via Facebook Share via Twitter Share via LinkedIn Share via Email Ακολουθήστε μας στο Messenger και μάθετε πρώτοι όλες τις ειδήσεις! Ακολουθήστε μας στο Google News και μάθετε πρώτοι όλες τις ειδήσεις! Κάντε λήψη της εφαρμογής της «Ν» στο App Store! android Κάντε λήψη της εφαρμογής της «Ν» στο Google Play! Ακολουθήστε μας στο επίσημο κανάλι της «Ν» στο Viber Ακολουθήστε μας στο επίσημο κανάλι της «Ν» στο Youtube Δημοφιλή Προτεινόμενα για εσάς 03/11/2025 - 5:27 Naftemporiki to participate in World Travel Market (WTM) London 2025 03/11/2025 - 2:28 “Injection” of 16 billion euros into 7 strategic sectors of the Greek economy 03/11/2025 - 11:21 Mytilineos: The most expensive electricity in Europe threatens Greece’s leadership in aluminum 03/11/2025 - 10:22 Kikilias attends reception hosted by new US Ambassador to Greece, Kimberly Guilfoyle 03/11/2025 - 9:29 Eldorado Gold: Skouries project is progressing according to plan – expected average annual production of 140,000 ounces of gold 03/11/2025 - 8:33 Papastavrou at the 4th Economic Conference of “N”: EYDAP will remain public – Water is a public good and will remain accessible and cheap 03/11/2025 - 8:31 Higher demand for Greek silk 03/11/2025 - 8:27 Star Bulk: Μulti-year program to “green” its fleet 31/10/2025 - 2:44 Xenokostas at the 4th Economic Conference of “N”: Shipyards’ transformation into a regional energy and technological hub 31/10/2025 - 11:23 INTERCARGO on 45-year anniversary: Firmly at the top of dry bulk 31/10/2025 - 10:18 Port of Elefsis: 50 European experts within the framework of the European project EXCEED 31/10/2025 - 9:55 Mytilineos at the 4th Economic Conference of “N”: Greece must rely on its own strengths Περισσότερα"
  }
]