[
  {
    "url": "https://timesofmalta.com/article/banking-veteran-mark-watkinson-join-moneybase-board-directors.1111399",
    "url_mobile": "",
    "title": "Banking veteran Mark Watkinson to join Moneybase Board of Directors",
    "seendate": "20250613T151500Z",
    "socialimage": "https://cdn-attachments.timesofmalta.com/3b612f5bd678aa0ab31c4deb23a0e3f1d04d2730-1749816461-ba134fbd-1200x630.jpg",
    "domain": "timesofmalta.com",
    "language": "English",
    "sourcecountry": "Malta",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Moneybase has announced the appointment of Mark Watkinson to its Board of Directors. A highly respected figure in the banking industry, Watkinson brings with him nearly 40 years of experience in the financial services sector (34 of which were with the HSBC group) and between 2011 and 2015, Watkinson was CEO and Director of HSBC Malta Ltd. \"Mark’s appointment is a significant vote of confidence for Moneybase and underscores our commitment to operate at the highest standards of governance, compliance, and customer excellence, while attracting top-tier talent from across the financial industry,\" said Alan Cuschieri, CEO and Founder of Moneybase. “Mark's strategic insight, extensive expertise in banking and finance, his understanding of the industry and commitment to operational excellence align perfectly with Moneybase’s vision as it continues to innovate and expand its services in the financial sector. We are excited to leverage his leadership as we strengthen our position in the market and drive our commitment to excellence,\" added Cuschieri. \"I am delighted to join the Moneybase board and look forward to contributing to the growth of the business and its strategic imperative of transforming the financial experience for clients,\" said Watkinson. The appointment is subject to the MFSA’s approval. Moneybase Limited is licensed by the MFSA to transact the business of a Financial Institution in terms of the Financial Institutions Act, Cap 376. Sign up to our free newsletters Email: Get the best updates straight to your inbox: Daily newsletter (the day’s top headlines, sent every morning) From the editors (a curated selection of stories, sent every week) You can unsubscribe at any time by clicking the link in the footer of our emails. We use Mailchimp as our marketing platform. By subscribing, you acknowledge that your information will be transferred to Mailchimp for processing. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
  },
  {
    "url": "https://www.manilatimes.net/2025/06/13/tmt-newswire/globenewswire/temenos-named-best-selling-core-banking-provider-for-20th-consecutive-year-by-ibs-intelligence/2132868",
    "url_mobile": "https://www.manilatimes.net/2025/06/13/tmt-newswire/globenewswire/temenos-named-best-selling-core-banking-provider-for-20th-consecutive-year-by-ibs-intelligence/2132868/amp",
    "title": "Temenos named best - selling core banking provider for 20th consecutive year by IBS Intelligence",
    "seendate": "20250613T093000Z",
    "socialimage": "https://www.manilatimes.net/manilatimes/uploads/images/2025/06/13/653782.jpg",
    "domain": "manilatimes.net",
    "language": "English",
    "sourcecountry": "Philippines",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Temenos ranked #1 in 13 categories in the IBSi Sales League table, including core, digital, payments and wealth GRAND-LANCY, Switzerland, June 13, 2025 (GLOBE NEWSWIRE) -- Temenos (SIX: TEMN), a global leader in banking technology, today announced it has been recognized as the #1 best-selling software provider in 13 categories in the IBSi Sales League Table (SLT) 2025 . Temenos ranked #1 for core banking for the 20 th consecutive year, while also topping the table for categories covering digital, payments, wealth and Islamic banking. The results highlight the breadth of Temenos' leadership as the banking technology provider of choice across multiple product segments. The IBS Intelligence Annual Sales League Table is an annual benchmarking exercise, which is now in its 24 th year and is based on the number of new customer contracts signed in a calendar year. The SLT is recognized as the barometer for financial technology providers' sales performance across the banking industry. Jean-Pierre Brulard, CEO, Temenos, said: \"I'm delighted to see Temenos top the rankings in 13 different categories in the IBSi Sales League Table, highlighting the strength and breadth of our market-leading capabilities. Being named the number one core banking software provider globally for 20 years in a row reflects both our customer-centric focus and relentless investment in innovation. As we continue to lead banking forward with the launch of game-changing Generative and Agentic AI capabilities, the advanced functionality, agility and scalability of our solutions makes Temenos a compelling choice for banks of all sizes around the world.” Get the latest news delivered to your inbox Sign up for The Manila Times newsletters By signing up with an email address, I acknowledge that I have read and agree to the Terms of Service and Privacy Policy . Temenos ranked #1 In the IBSi SLT 2025 across the following 13 categories: Universal Banking - Core Digital Banking and Channels Payments - Retail Private Banking and Wealth Management Risk Management Treasury and Risk Management Digital Only Banks Datawarehouse & BI Islamic Banking - Universal Banking - Core Islamic Banking - Risk Management Islamic Banking - Payments - Retail Islamic Banking - Wholesale Banking Treasury Islamic Banking - Digital Banking and Channels With its market-leading core banking suite and best-in-class modular solutions, Temenos offers financial institutions choice, flexibility and a proven path to banking modernization - underpinned with cloud-native architecture, and embedded AI. Trusted by over 950 core banking clients and over 650 digital clients around the world, Temenos software can be deployed on-premises, in the cloud, or as SaaS. Advertisement Investing around 20% of revenues in R&D, Temenos continues to enhance its capabilities. Recent innovations include the launch of a Gen AI Copilot to help financial institutions design, launch, test and optimize financial products faster, as well as an FCM AI Agent that can help banks significantly reduce false positives in sanctions screening. Nikhil Gokhale, Director - Research & Digital Properties at IBS Intelligence, commented: \"The 2025 edition of the IBSi Sales League Table reflects the growing maturity of digital transformation across the global banking industry. With sustained investment in modern core platforms, intelligent digital channels, and real-time payments, banks are clearly prioritizing agility, scale, and customer experience. Temenos has once again demonstrated exceptional global leadership, with standout performance in Core, Digital, Payments, and Risk. On behalf of IBSi, I extend my congratulations to the Temenos team for consistently being at the forefront of innovation and execution. The SLT continues to serve as a trusted benchmark for momentum in banking technology worldwide.” Recognition in the IBSi SLT is the latest industry accolade for Temenos, which was also named a Leader in the 2024 IDC MarketScapes for Digital Core Banking Platforms in North America, EMEA and Asia Pacific and in the Forrester Wave™: Digital Banking Processing Platforms, Q4 2024 . CONTACT: Scott Rowe Advertisement Temenos + 44 (0) 20 7423 3857 [email protected] Advertisement Advertisement"
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-06/65643804-global-open-banking-market-size-to-reach-usd-136-13-billion-by-2030-growing-at-a-27-60-cagr-markntel-advisors-capgemini-oracle-global-payments-008.htm",
    "url_mobile": "",
    "title": "Global Open Banking Market Size to Reach USD 136 . 13 Billion by 2030 , Growing at a 27 . 60 % CAGR : MarkNtel Advisors ( Capgemini , Oracle , Global Payments , Tata Consultancy , Finastra & others ) ",
    "seendate": "20250612T060000Z",
    "socialimage": "https://www.finanznachrichten.de/chart-global-payments-inc-aktie-intraklein-tradegate.png",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Aktien » Nachrichten » GLOBAL PAYMENTS AKTIE » Global Open Banking Market Size to Reach USD 136.13 Billion by 2030, Growing at a 27.60% CAGR: MarkNtel Advisors (Capgemini, Oracle, Global Payments, Tata Consultancy, Finastra & others) Push Mitteilungen GLOBAL PAYMENTS INC WKN: 603111 | ISIN: US37940X1028 | Ticker-Symbol: GLO Tradegate 11.11.25 | 12:58 65,76 Euro -1,38 % -0,92 Branche Finanzdienstleistungen Aktienmarkt S&P 500 1-Jahres-Chart 5-Tage-Chart Realtime Geld Brief Zeit 66,52 66,80 11.11. 66,02 67,34 11.11. Nachrichten Analysen Kurse Chart Xetra-Orderbuch PR Newswire 12.06.2025 07:36 Uhr 611 Leser Artikel bewerten: ( 2 ) Global Open Banking Market Size to Reach USD 136.13 Billion by 2030, Growing at a 27.60% CAGR: MarkNtel Advisors (Capgemini, Oracle, Global Payments, Tata Consultancy, Finastra & others) Global Open Banking Market Report Overview: NEW DELHI, June 12, 2025 /PRNewswire/ -- The Global Open Banking Market size is experiencing significant growth, projected to rise from approximately USD 31.54 billion in 2024 to USD 136.13 billion by 2030 , with a robust CAGR of around 27.60% during the 2025-2030 period, according to MarkNtel Advisors. This growth is driven by the ongoing digital transformation within the banking sector, where both innovative digital banks and traditional institutions are modernizing their operations to remain competitive. Approximately 23% of the population in the surveyed 28 countries have opened digital bank accounts, spurring financial institutions to accelerate their digital initiatives and securely share data with third-party providers, thereby enhancing Open Banking adoption. The open banking market report highlights that regions like Asia-Pacific and the Middle East are leading in digitalization efforts, prompting increased investment in open banking solutions. Interested User Can Get a FREE PDF sample of the report here - https://www.marknteladvisors.com/query/request-sample/open-banking-market.html Global Open Banking Market Value & Statistics Market Value in 2024 : USD 31.54 Billion Projected Valuation by 2030 : USD 136.13 Billion Forecast Period CAGR (2025-2030) : 27.60% Base Year : 2024 Historical Years : 2020-2023 Leading Segment by Service : Corporate Banking & Retail Banking Leading Region : Europe Industry Dynamic: 1.) Open Banking Market Trend Transformation in Banking Onboarding - The onboarding process in banking is undergoing a significant transformation with the rise of open banking. Financial institutions are leveraging this trend to simplify the onboarding journey, reducing customer stress by allowing seamless access to user data and automating information retrieval. This not only enhances efficiency and user-friendliness but also prepares the way for a greater adoption of open banking solutions, ultimately contributing to substantial growth in the market as more consumers embrace these improvements. 2.) Factor Affecting Open Banking Market Growth The The surge in digital transformation has significantly increased online financial transactions, enhancing the convenience of banking services. However, this growth comes with heightened data security threats. Financial institutions are becoming increasingly cautious about sharing sensitive financial information through APIs, driven by fears of potential financial losses, reputational damage, and regulatory penalties linked to security breaches. This heightened sense of caution is impeding the widespread adoption of open banking practices. As a result, the market's potential for growth is being constrained, as institutions grapple with balancing innovation and robust security measures in an evolving digital landscape. 3.) Open Banking Market Driver In an increasingly globalized world, governments recognize the importance of fostering connections between financial institutions and consumers, both domestically and internationally. Countries such as the UK, Mexico, and the US are actively promoting the adoption of open banking services, which simplify cross-border financial transactions and enhance global trade relationships. Over the past decade, North American and European nations have also proactively worked to democratize access to financial products and services. A significant milestone in this effort was the European Banking Authority's introduction of the Payment Services Directive Two (PSD2) in 2015, which officially marked the beginning of the open banking era. Following this, the UK's Competition and Markets Authority (CMA) implemented guidelines requiring banks to adopt open banking practices by 2018. These regulatory mandates have compelled banks to share their previously restricted financial data with third-party providers, encouraging more entities to enter the market and significantly driving the growth of the Global Open Banking Market. 4.) Global Open Banking Market Opportunity The Impact of CBDCs on the Financial Landscape - The emergence of Central Bank Digital Currencies (CBDCs) is significantly transforming the financial landscape, with many countries exploring or implementing these digital versions of national currencies. Driven by the need to modernize financial systems and enhance monetary policy, over 10 nations have launched CBDCs, while over 100 others are exploring their possibilities, according to the Atlantic Council. China's digital yuan, a leading CBDC initiative, aims for expansion after its pilot began in 2014. As digital currencies gain traction, banks must adapt their systems to support these assets. This presents a unique opportunity for open banking solution providers to facilitate the integration of CBDCs into existing banking infrastructures, paving the way for growth in the Open Banking Market. For in-depth analysis, market data, and forecasts, access the complete study - https://www.marknteladvisors.com/research-library/open-banking-market.html Competitive Landscape: List of Emerging Open Banking Companies Globally The competitive landscape of the open banking market is characterized by dynamic strategic initiatives among leading players. Companies are actively engaging in mergers, collaborations, and acquisitions to enhance their market presence. Key participants include: F5 Solutions Finleap Financial Details Revolut Ltd Tink AB Salesforce, Inc. Worldline S.A. TATA Consultancy Services Limited Capgemini Oracle Finicity (Mastercard) Jack Henry & Associates, Inc. Finastra Global Payments Virtusa Corp. Plaid Inc. Others These initiatives are aimed at strengthening their positions within the evolving open banking ecosystem, underscoring a commitment to innovation and competitiveness in the financial technology space. Industry Recent Development: 2024 : Paysend formed a partnership with Tink , an open banking platform and Visa solution provider, to strengthen and speed up money transfers powered by open banking. Through the integration of Tink's advanced open banking technology, Paysend now allows customers, especially within the EU, to verify and fund international transfers directly from their bank accounts. This removes the need for manual data input or complex security procedures, offering a faster, smoother, and more secure payment process while minimizing errors and the risk of fraud. Schedule a Consultation with Our Experts ! - https://www.marknteladvisors.com/query/talk-to-our-consultant/open-banking-market.html Open Banking Market Segments By Service ( Retail Banking [Aggregation & Financial Management, Credit Risk Decisioning, Payments, Origination & Onboarding, Others], Corporate Banking [Corporate Treasury, Financial Management, Credit Decisioning, Payments, Value Added Services, Others], Capital Markets, Others) By Distribution Channel (Bank Channel, App Market, Distributors, Aggregators) By Deployment (On-premise, Cloud, Hybrid) Payments, a Segment Under Corporate Banking & Retail Banking Segment Leads in Market The open banking market is increasingly segmented into various service categories, including Retail Banking, Corporate Banking, and Capital Markets. Among these, payment services in both Retail and Corporate Banking are experiencing notable growth and capturing a significant market share. Innovative fintech companies like Google, Amazon, Facebook, and Apple are harnessing open banking principles to develop solutions that enhance and simplify payment processes for individuals and businesses. As a result, the adoption of open banking for payments is witnessing a considerable increase, showcasing its potential to transform financial transactions. Global Open Banking Market Regional Breakdown : Geographically , the Global Open Banking Market expands across: North America South America Europe The Middle East & Africa Asia-Pacific Europe's Rapid Growth in Open Banking Europe has emerged as a frontrunner in the Open Banking Market, primarily driven by widespread adoption and several key factors. Standardized APIs, diverse national standards, strong expertise in non-retail payments, and influential mobile payment associations play vital roles in this growth. The UK and France have taken the lead in API standardization, laying a solid groundwork for successful Open Banking initiatives, which enhances integration and compatibility across the region. Additionally, countries like the Netherlands, Switzerland, and Spain are notable for their advancements in digital technologies and the establishment of trust in digital practices. Spain, in particular, excels in digital engagement, boasting the highest number of \"passported-in\" third-party providers (TPPs). As a result, the adoption of Open Banking is witnessing significant momentum throughout Europe. Open Banking Market Report : List of Tables Table 1: Market Segmentation Table 2: Global Open Banking Startup Ecosystem Table 3: Global Open Banking Current Status of Integration & Implementation - A Survey of Financial Institutions Table 4: R esults of Integrating Open Banking Table 5: G lobal Open Banking Case Studies Table 6: G lobal Open Banking Market Porter's Five Forces Analysis Table 7: G lobal Open Banking Market Trends & Insights Table 8: G lobal Open Banking Market Dynamics Table 9: G lobal Open Banking Market Value Chain Analysis Table 10: Global Open Banking Market Policies, Regulations, and Service Standards Table 11: Global Open Banking Market Size & Analysis by Revenues Table 12: Market Share & Analysis by Service Table 13: North America Open Banking Market Outlook, 2020-2030F Table 14: The US Open Banking Market Outlook, 2020-2030F Table 15: Canada Open Banking Market Outlook, 2020-2030F Table 16: Europe Open Banking Market Outlook, 2020-2030F Table 17: The Middle East & Africa Open Banking Market Outlook, 2020-2030F Table 18: Asia-Pacific Open Banking Market Outlook, 2020-2030F Table 19: Global Open Banking Market Strategic Imperatives for Success & Growth Table 20: Competitive Outlook Table 21: Company Profiles - Overview Table 22: Recent Developments of Key Players Looking for Regional or country-specific reports on this market? Visit our website - https://www.marknteladvisors.com/query/request-customization/open-banking-market.html Open Banking Market Report: List of Figures Figure 1: Evolution of Open Banking Figure 2: Region-wise Current Status of Integrating Open Banking Figure 3: Region-wise Purpose of Adopting Open Banking Figure 4: Top Applications for Which Open Banking has been Implemented by Financial Institutions Figure 5: Global Open Banking Market Hotspots & Opportunities Figure 6: Market Size & Forecast for Retail Banking Services Figure 7: Distribution Channel Analysis Figure 8: Deployment Analysis of Open Banking Services Figure 9: Trends in Global Open Banking Market Figure 10: Key Players in the Global Open Banking Ecosystem About Us - MarkNtel Advisors is a leading consulting, data analytics, and market research firm that provides an extensive range of strategic reports on diverse industry verticals. We being a qualitative & quantitative research company, strive to deliver data to a substantial & varied client base, including multinational corporations, financial institutions, governments, and individuals, among others. We have our existence across the market for many years and have conducted multi-industry research across 80+ countries, spreading our reach across numerous regions like America, Asia-Pacific, Europe, the Middle East & Africa, etc., and many countries across the regional scale, namely, the US, India, the Netherlands, Saudi Arabia, the UAE, Brazil, and several others. Similar Report Topic - Asia Neobanking Market Research Report: Forecast (2025-2030) - The research involves an in-depth examination of the various strategies and methodologies employed in the development of market products and services. The research examines a variety of factors, including industry chain analysis, cost structure analysis, and end-use segments, to present readers with a plethora of information. Eastern Europe Core Banking Market Research Report: Forecast (2023-2028) - The Eastern Europe Core Banking Market is projected to grow at a CAGR of around 16.5% during the forecast period, i.e., 2023-28. US Cash Management Services Market Research Report: Forecast (2025-2030) - The US Cash Management Services Market size was valued at around USD 388.19 million in 2024 and is projected to reach USD 629.22 million in 2030. Along with this, the market is estimated to grow at a CAGR of around 7.99% during the forecast period, i.e., 2025-30 GCC Cash Management Services Market Research Report: Forecast (2025-2030) - Valued at USD 70.17 million in 2024, The GCC Cash Management Services Market is likely to reach USD 109 million by 2030. Along with this, the market is estimated to grow at a CAGR of around 7.62% during the forecast period, i.e., 2025-30. Saudi Arabia Cards and Payments Market Research Report: Forecast (2025-2030) - The Saudi Arabia Cards and Payments Market is estimated to grow at a CAGR of around 8.5% during the forecast period, 2025-30 India Cards and Payments Market Research Report: Forecast (2025-2030) - The study goes into great detail regarding how the India Cards and Payments Market is expanding and becoming beneficial. Furthermore, important stakeholders can learn about main trends, drivers, investments, market player's actions, to increase product/service adoption in the coming years, and commercial product insights. US Cards and Payments Market Research Report: Forecast (2025-2030) - The US Cards and Payments market research report reveals the current market standards as well as the latest patterns and strategic developments of the market participants in an unbiased manner. Canada Mobile Wallet and Payment Market Research Report Forecast: (2025-2030) - The Canada Mobile Wallet and Payment Market size was valued at around USD 1.39 billion in 2024 and is projected to reach USD 20.48 billion by 2030. Along with this, the market is estimated to grow at a CAGR of around 55.88% during the forecast period, i.e., 2025-30. Global Green Bond Market Research Report: Forecast (2025-2030) - The Global Green Bond Market size was valued at around USD 224 billion in 2024 and is projected to reach USD 350 billion by 2030. Along with this, the market is estimated to grow at a CAGR of around 8% during the forecast period, i.e., 2025-30. India UPI Apps Market Research Report: Forecast (2024-2030) - The India UPI Apps Market size is projected to grow at a CAGR of around 10.5% during the forecast period, i.e., 2024-30. The India Unified Payments Interface (UPI) Apps Market has various factors presenting robust growth Contact: MarkNtel Advisors Office No.109, H-159, Sector 63, Noida, Uttar Pradesh-201301, India Contact No: +91 8719999009 Email: sales@marknteladvisors.com Visit our Website: https://www.marknteladvisors.com Content Source: https://www.marknteladvisors.com/press-release/open-banking-market-size Logo: https://mma.prnewswire.com/media/2687299/MarkNtel_Advisors_Logo.jpg View original content:https://www.prnewswire.co.uk/news-releases/global-open-banking-market-size-to-reach-usd-136-13-billion-by-2030--growing-at-a-27-60-cagr-markntel-advisors-capgemini-oracle-global-payments-tata-consultancy-finastra--others-302479939.html © 2025 PR Newswire Nachrichten zu CAPGEMINI SE Zeit Aktuelle Nachrichten Mo Capgemini: Six in 10 organizations expect AI to be an active team member or supervisor to other AI in the next 12 months Enterprise Gen AI adoption has grown fivefold in the last two years, outpacing enterprise readiness and intensifying challenges around cost, workforce adaptation, and governance PARIS... ► Artikel lesen 04.11. Capgemini SE: Capgemini and Orano deploy the first intelligent humanoid robot in the nuclear sector Capgemini press contact: Elsa Estager Bergerou Tél.: + 33 6 59 62 55 13 E-mail: elsa.estager-bergerou@capgemini.comOrano press contact:Service... ► Artikel lesen 03.11. Christoph Bornschein wechselt zu Capgemini Invent 03.11. French Capgemini closes acquisition of Cloud4C 03.11. Capgemini SE: Capgemini announces the closing of the acquisition of Cloud4C Media relations:Sam ConnattyTel.: +44 (0)370 904 3601 sam.connatty@capgemini.com Investor relations:Vincent BiraudTel.: +33 1 47 54 50 87vincent.biraud@capgemini.com Capgemini announces the closing... ► Artikel lesen Nachrichten zu FINASTRA Zeit Aktuelle Nachrichten 29.10. Belize Bank upgrades core banking system to Finastra Essence 28.10. Belize Bank Group Reimagines Core Banking with Finastra Essence Strategic project enhances agility and governance while transforming the customer experience for Belize Bank and Belize Bank International LAKE MARY, Fla., Oct. 28, 2025 /PRNewswire/... ► Artikel lesen 23.10. Nelnet übernimmt kanadisches Studiendarlehensgeschäft von Finastra 17.10. Deutsche Bank and Goldman to offload $1.2bn debt tied to Apax Partners' Finastra deal 16.10. Banks Prepare to Sell Debt Associated With Apax Acquisition of Finastra Unit Nachrichten zu GLOBAL PAYMENTS INC Zeit Aktuelle Nachrichten Di Smart Money Move: Patricia A Watson Grabs $99K Worth Of Global Payments Stock Di Global Payments unveils modular point-of-sale device for Genius platform Do Global Payments begins marketing $6.2B debt offering for Worldpay deal - report 05.11. Global Payments price target raised to $95 by RBC on Genius momentum 05.11. Global Payments stock price target raised to $125 by Mizuho on strong FCF outlook Nachrichten zu ORACLE CORPORATION Zeit Aktuelle Nachrichten 00:42 Oracle Commodity Holding Corp: Oracle Commodity eight-million-share private placement Di Nvidia, Oracle, Alphabet & Co.: Tech-Aktien: Das ist Michael Burrys gefährlichster Satz des Jahres © Foto: Imago Images / ZUMA Press Wire\"Eine der häufigsten Betrugsmethoden der Moderne\" - Burry warnt, dass Tech-Giganten ihre Gewinne durch Bilanztricks künstlich aufblähen. 176 Milliarden US-Dollar... ► Artikel lesen Di Oracle Rises 44.5% YTD on Cloud Strength: Buy the Stock Now or Hold? Di Oracle in der Diskussion - Münchener Rück & CoreWeave mit Zahlen Di Michael Burry Doubles Down On AI Bubble Claims As Short Trade Backfires: Says Oracle, Meta Are Overstating Earnings By 'Understating Depreciation' Nachrichten zu TATA CONSULTANCY SERVICES LTD Zeit Aktuelle Nachrichten Mo Tata Consultancy Services: TCS goIT Challenges at TCS-Sponsored Marathons Encourage Students To Develop Apps Focused on Health and Wellbeing TCS goIT Student Challenges at the TCS Toronto Waterfront Marathon and the TCS New York City Marathon Support U.N. Sustainable Development Goals NORTHAMPTON, MA / ACCESS Newswire / November 10, 2025... ► Artikel lesen So Seven of top 10 valued firms lose Rs 88,600 crore; Airtel, TCS lead decline So Market Cap Of Seven Top Companies Falls By Rs 88,635 Crore As Bharti Airtel, TCS Lead Weekly Declines So Mcap of 7 of top-10 most valued firms erodes by Rs 88,635 cr; Airtel, TCS biggest laggards Fr Tata Consultancy Services: TCS' goIT Program Invites Students to Innovate for Children Rights and Wellbeing The November goIT Monthly Challenge invites students to compete for mentoring, recognition and more with ideas to protect and improve quality of life for children NORTHAMPTON, MA / ACCESS Newswire /... ► Artikel lesen Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://www.taipeitimes.com/News/biz/archives/2025/06/12/2003838449",
    "url_mobile": "",
    "title": "FSC to restrict finance sector hostile takeovers",
    "seendate": "20250611T213000Z",
    "socialimage": "https://www.taipeitimes.com/images/2025/06/12/P09-250612-002.jpg",
    "domain": "taipeitimes.com",
    "language": "English",
    "sourcecountry": "Taiwan",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Front Page Taiwan News Business Editorial & Opinion Sports World News Features Bilingual Pages Search Search All Front Page Taiwan News Business Editorial & Opinion Sports World News Features Bilingual Pages GO Home Business Thu, Jun 12, 2025 page9 FSC to restrict finance sector hostile takeovers Bloomberg The Financial Supervisory Commission late on Tuesday announced plans to effectively block hostile takeovers in the nation’s crowded financial sector, months after preventing a roughly US$4.1 billion deal that would have created Taiwan’s largest financial group. The commission would amend rules to close the door to nonconsensual mergers and acquisitions to ensure market stability, it said in a statement. In the future, acquiring financial firms must get a board resolution from the target company indicating no objection, or show that they can secure a majority of shares or board seats to complete the acquisition, the commission said. The name and logo of the Financial Supervisory Commission are pictured in New Taipei City on April 25. Photo: Kelson Wang, Taipei Times The changes aim to establish an environment for mergers and acquisitions in the financial sector while maintaining market stability, it said, adding that the proposed amendment would be open to public feedback for 60 days. Last year, the commission rejected CTBC Financial Holding Co’s (中信金控) takeover bid for smaller rival Shin Kong Financial Holding Co (新光金控), citing reasons including potential disputes over management rights. While Shin Kong Financial then pursued a separate, agreed merger, many analysts have said that Taiwan has too many financial groups for a country of about 23 million people. The proposed amendments would also demand that public takeovers be paid in cash, to avoid volatility in share prices. The commission also wants to increase the minimum initial investment by those seeking to take over a financial company, to 25 percent from 10 percent. Most Popular 1 Typhoon could trigger sea warning, hit central Taiwan 2 Cancelations announced as sea warning issued for Typhoon Fung-wong 3 Exports soar 49.7% to all-time high 4 China ignores new airport safety concerns, CAA says 5 Fung-wong approaches Taiwan, batters Philippines You might also like No China sales: Nvidia 2025-11-08 PERSISTENT RUMORS: Nvidia’s CEO said the firm is not in talks to sell AI chips to China, but he would welcome a change in US policy barring the activity Nvidia Corp CEO Jensen Huang (黃仁勳) said his company is not in discussions to sell its Blackwell artificial intelligence (AI) chips to Chinese firms, waving off speculation it is trying to engineer a return to the world’s largest semiconductor market. Huang, who arrived in Taiwan yesterday ahead of meetings with longtime partner Taiwan Semiconductor Manufacturing Co (TSMC, 台積電), took the opportunity to clarify recent comments about the US-China AI race. The Nvidia head caused a stir in an interview this week with the Financial Times, in which he was quoted as saying “China will win” the AI race. Huang yesterday said Nissan to sell global HQ building amid low sales 2025-11-07 Nissan Motor Co has agreed to sell its global headquarters in Yokohama for ￥97 billion (US$630 million) to a group sponsored by Taiwanese autoparts maker Minth Group (敏實集團), as the struggling automaker seeks to shore up its financial position. The acquisition is led by a special purchase company managed by KJR Management Ltd, a Japanese real-estate unit of private equity giant KKR & Co, people familiar with the matter said. KJR said it would act as asset manager together with Mizuho Real Estate Management Co. Nissan is undergoing a broad cost-cutting campaign by eliminating jobs and shuttering plants as it grapples China bans foreign chips from projects 2025-11-06 The Chinese government has issued guidance requiring new data center projects that have received any state funds to only use domestically made artificial intelligence (AI) chips, two sources familiar with the matter told Reuters. In recent weeks, Chinese regulatory authorities have ordered such data centers that are less than 30 percent complete to remove all installed foreign chips, or cancel plans to purchase them, while projects in a more advanced stage would be decided on a case-by-case basis, the sources said. The move could represent one of China’s most aggressive steps yet to eliminate foreign technology from its critical infrastructure amid a MSCI upgrades Taiwan stock index weighting 2025-11-08 MORE WEIGHT: The national weighting was raised in one index while holding steady in two others, while several companies rose or fell in prominence MSCI Inc, a global index provider, has raised Taiwan’s weighting in one of its major indices and left the country’s weighting unchanged in two other indices after a regular index review. In a statement released on Thursday, MSCI said it has upgraded Taiwan’s weighting in the MSCI All-Country World Index by 0.02 percentage points to 2.25 percent, while maintaining the weighting in the MSCI Emerging Markets Index, the most closely watched by foreign institutional investors, at 20.46 percent. Additionally, the index provider has left Taiwan’s weighting in the MSCI All-Country Asia ex-Japan Index unchanged at 23.15 percent. The latest index adjustments are to Front Page Taiwan News Business Editorial & Opinion Sports World News Features Bilingual Pages About Us Employment Contact Us RSS Copyright © 1999-2025 The Taipei Times. All rights reserved."
  },
  {
    "url": "https://www.livemint.com/economy/fm-urges-expedited-refunds-seamless-kyc-at-the-29th-fsdc-meeting-11749611936036.html",
    "url_mobile": "https://www.livemint.com/economy/fm-urges-expedited-refunds-seamless-kyc-at-the-29th-fsdc-meeting/amp-11749611936036.html",
    "title": "FM urges expedited refunds , seamless KYC at the 29th FSDC meeting",
    "seendate": "20250611T043000Z",
    "socialimage": "https://www.livemint.com/lm-img/img/2025/06/11/600x338/PTI05-30-2025-000453B-0_1749614203114_1749614244359.jpg",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "View Market Dashboard FM urges expedited refunds, seamless KYC at the 29th FSDC meeting The FSDC also deliberated on issues related to macro-financial stability and India’s preparedness to deal with them. Rhik Kundu Published 11 Jun 2025, 09:44 AM IST Union Finance Minister Nirmala Sitharaman, ( @nsitharamanoffc ) Union Finance Minister Nirmala Sitharaman called for swift action to refund unclaimed financial assets to rightful owners and emphasized streamlining know-your-customer (KYC) norms to improve user experience at the 29th meeting of the Financial Stability and Development Council (FSDC) held on Tuesday. The FSDC also deliberated on issues related to macro-financial stability and India’s preparedness to deal with them, the finance ministry said in a statement. Also Read: How India’s prime ministers influenced the performance of finance ministers “In light of the analysis of cybersecurity regulations, sectoral preparedness, and the recommendations of the Financial Sector Assessment Programme (FSAP) 2024-25, the FSDC considered strengthening the cyber resilience framework of the Indian financial sector through a financial sector-specific cybersecurity strategy,” the statement said. The FSDC also outlined a roadmap to implement past decisions and Budget announcements, focusing on regulatory efficiency, unclaimed assets, and investor onboarding at its latest meeting, it added. At the FSDC meeting, chaired by Sitharaman in Mumbai, regulators were asked to organize coordinated multi-agency district-level camps to facilitate claims of unclaimed amounts—ranging from dormant bank deposits to insurance and pension funds. Also Read: Those pesky KYC updates may soon be a thing of the past The interest of common citizens must be kept in mind, Sitharaman said, adding that claims must be refunded expeditiously. Sitharaman also urged members to take proactive steps to ensure a seamless KYC experience across financial services. Meanwhile, the FSDC also discussed prescribing common KYC norms, including for NRIs, and greater digitalization of the onboarding process apart from reviewing progress on earlier decisions and budget announcements. Key discussions included strategies to reduce unclaimed financial assets, enhance regulatory responsiveness, boost investments, expand factoring services, and strengthen the account aggregator ecosystem, the finance ministry said. The council assessed global and domestic macro-financial developments and highlighted the need to remain vigilant against potential systemic risks, the ministry said, adding that the FSDC reviewed cybersecurity preparedness in the financial sector, following the Financial Sector Assessment Programme (FSAP) 2024–25, and discussed building a sector-specific cyber resilience strategy. Also Read: India’s KYC crisis: A bank dedicated to welfare payments could resolve it The 29th meeting of the FSDC was attended by top ministry of finance officials including MoS finance Pankaj Choudhary, finance secretary Ajay Seth, chief economic adviser V. Anantha Nageswaran, RBI governor Sanjay Malhotra, and heads of Sebi, Irdai, PFRDA, IFSCA, IBBI, and CERT-In. Nirmala Sitharaman KYC Norms Economy Banking Get Latest real-time updates Catch all the Business News , Economy news , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates. Business News Economy FM urges expedited refunds, seamless KYC at the 29th FSDC meeting More Story Url has been added to your clipboard Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue"
  },
  {
    "url": "https://www.thehindubusinessline.com/economy/fm-sitharaman-asks-regulators-to-take-steps-to-reduce-unclaimed-assets-and-expedite-refunds/article69679704.ece",
    "url_mobile": "https://www.thehindubusinessline.com/economy/fm-sitharaman-asks-regulators-to-take-steps-to-reduce-unclaimed-assets-and-expedite-refunds/article69679704.ece/amp/",
    "title": "FM Sitharaman asks regulators to take steps to reduce unclaimed assets and expedite refunds",
    "seendate": "20250610T160000Z",
    "socialimage": "https://bl-i.thgim.com/public/incoming/7q0kch/article69679821.ece/alternates/LANDSCAPE_1200/PTI06_10_2025_000041B.jpg",
    "domain": "thehindubusinessline.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. FM Sitharaman asks regulators to take steps to reduce unclaimed assets and expedite refunds The Finance Minister emphasised that the interest of common citizens has to be kept in mind and therefore expeditiously refund the claims of the rightful claimants By BL Mumbai Bureau Updated - June 10, 2025 at 09:20 PM. | Mumbai × Share WhatsApp X Facebook LinkedIn Messenger Reddit Mail https://www.thehindubusinessline.com/economy/fm-sitharaman-asks-regulators-to-take-steps-to-reduce-unclaimed-assets-and-expedite-refunds/article69679704.ece Copy Union Finance Minister Nirmala Sitaraman with RBI Governor Sanjay Malhotra during the 29th meeting of the Financial Stability and Development Council (FSDC), at RBI headquarters in Mumbai on Tuesday | Photo Credit: PTI The Financial Stability and Development Council (FSDC) on Tuesday discussed the need for taking necessary steps to reduce unclaimed assets and expediting refunds, simplification and digitalisation of the KYC process, and increasing investment ratio, among others. The 29th meeting of FSDC, which was held in Mumbai and chaired by Nirmala Sitharaman, Union Minister for Finance and Corporate Affairs, deliberated on strategy for taking necessary steps to reduce unclaimed assets in the financial sector (banks deposits, dividends, shares, post office accounts, insurance and pension funds etc.) and the expeditious and seamless refund of such assets to rightful owners. Sitharaman urged the regulators and departments to expedite the process to refund the unclaimed amounts to the rightful owners by holding special district level camps. This drive is to be conducted in coordination with RBI, SEBI, MCA, PFRDA and IRDA along with banks, pension agencies, insurance companies etc. The unclaimed amounts comprise of deposits in banks, unclaimed shares and dividends are managed by IEPFA (Investor Education Protection Fund Authority), and unclaimed insurance and pension funds are with IRDAI and PFRDA. The Finance Minister emphasised that the interest of common citizens has to be kept in mind and therefore expeditiously refund the claims of the rightful claimants. Digital KYC Further, the need to prescribe common KYC (know-your-customer) norms, simplification and digitalisation of the KYC process, including digital onboarding for Non-Resident Indians (including PIOs and OCIs), in the Indian securities market were also discussed. Sitharaman exhorted the Council to take proactive steps to ensure that citizens should have a seamless experience with respect to KYC processes across the financial sector. The Council also analysed trends in financing flows as part of the strategy to increase the investment ratio. Further, the need for taking measures to improve the reach and scope of factoring services and effective use of account aggregator networks was also discussed. The FSDC also discussed issues relating to formulating a strategy for establishing appropriate framework by regulators for evaluating and enhancing responsiveness of regulations and subsidiary instructions. The Council deliberated on issues related to macro financial stability and India’s preparedness to deal with them. In light of the analysis of cybersecurity regulations, sectoral preparedness, and the recommendations of Financial Sector Assessment Programme (FSAP) 2024-25, the FSDC considered strengthening the cyber resilience framework of the Indian financial sector through a financial sector-specific cybersecurity strategy. The FSDC, according to a finance ministry statement, deliberated on the emerging trends from domestic and global macro-financial situation and stressed upon the need to be vigilant. The Council recognised the need for proactive efforts to mitigate potential risks to financial stability while adopting adequate safeguards for financial system’s resilience. The members decided to strengthen the inter-regulatory coordination for wider development of the financial sector. The Council was set up by the Centre as the apex level forum in December 2010 to strengthen and institutionalise the mechanism for maintaining financial stability, enhancing inter-regulatory coordination and promoting financial sector development. The Chairman of the Council is the Finance Minister and its members include the heads of financial sector Regulators (RBI, SEBI, PFRDA, IRDA) Finance Secretary and/or Secretary, Department of Economic Affairs, Secretary, Department of Financial Services, and Chief Economic Adviser. Comments Published on June 10, 2025 READ MORE THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per month Access to comment on every story Sign up/Manage to our newsletters Get notified by email for early preview to new features, discounts & offers ✕ Looks like you are already logged in from more than 5 devices! To continue logging in, remove at least one device from the below list Log out Log Out from all devices Terms & conditions | Institutional Subscriber"
  },
  {
    "url": "https://www.thehindubusinessline.com/economy/finance-minister-nirmala-sitharaman-chairs-29th-fsdc-meeting-in-mumbai/article69678529.ece",
    "url_mobile": "https://www.thehindubusinessline.com/economy/finance-minister-nirmala-sitharaman-chairs-29th-fsdc-meeting-in-mumbai/article69678529.ece/amp/",
    "title": "Finance Minister Nirmala Sitharaman chairs 29th FSDC meeting in Mumbai",
    "seendate": "20250610T124500Z",
    "socialimage": "https://bl-i.thgim.com/public/incoming/at7ef3/article69678651.ece/alternates/LANDSCAPE_1200/PTI06_10_2025_000049A.jpg",
    "domain": "thehindubusinessline.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "SENSEX 83,216.28 -94.73 NIFTY 25,492.30 -17.40 CRUDEOIL 5,304.00 + 42.00 GOLD 121,071.00 + 458.00 SILVER 147,724.00 + 655.00 SENSEX 83,216.28 -94.73 NIFTY 25,492.30 -17.40 NIFTY 25,492.30 -17.40 CRUDEOIL 5,304.00 + 42.00 CRUDEOIL 5,304.00 + 42.00 GOLD 121,071.00 + 458.00 THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Finance Minister Nirmala Sitharaman chairs 29th FSDC meeting in Mumbai In the last meeting, the 28th FSDC meeting, one of the primary objectives of the FSDC was to ensure macro-prudential supervision of the economy, including monitoring the functioning of large financial conglomerates By ANI Updated - June 10, 2025 at 05:00 PM. | New Delhi × Share WhatsApp X Facebook LinkedIn Messenger Reddit Mail https://www.thehindubusinessline.com/economy/finance-minister-nirmala-sitharaman-chairs-29th-fsdc-meeting-in-mumbai/article69678529.ece Copy Mumbai: Union Finance Minister Nirmala Sitaraman with RBI Governor Sanjay Malhotra and Union Minister of State for Finance Pankaj Chaudhary during the 29th meeting of the Financial Stability and Development Council (FSDC), at RBI headquarters, in Mumbai, | Photo Credit: SHASHANK PARADE The Union Minister for Finance and Corporate Affairs, Nirmala Sitharaman, chaired the 29th meeting of the Financial Stability and Development Council (FSDC) in Mumbai on Tuesday. The meeting was also attended by Union Minister of State for Finance Pankaj Chaudhary. A senior official of the finance ministry, RBI Governor Sanjay Malhotra and SEBI Chairman Tuhin Kanta Pandey are also attending the meeting. \"Also present during the #FSDC meeting are Governor @RBI; Finance Secretary and Secretary, D/o Economic Affairs; Secretaries of @DFS_India; D/o Revenue; OSD DEA @FinMinIndia; and @MCA21India; Chief Economic Adviser; Chairpersons @SEBI_India, @IFSCA_Official, senior representatives from @PFRDAOfficia, @IBBIlive, IRDAI, @IndianCERT, and other senior officials of @FinMinIndia,\" the Ministry of finance said on social media platform 'X'. Union Minister for Finance and Corporate Affairs Smt. @nsitharaman chairs the 29th meeting of the Financial Stability and Development Council #FSDC in presence of Union Minister of State for Finance Shri @mppchaudhary , in Mumbai, today. Also present during the #FSDC meeting are… pic.twitter.com/L2qVP4cH36 — Ministry of Finance (@FinMinIndia) June 10, 2025 The Financial Stability and Development Council (FSDC), established by the Government in December 2010, serves as the apex forum aimed at fortifying financial stability, fostering inter-regulatory coordination and advancing the development of the financial sector. The gathering provided a platform to deliberate on critical issues concerning financial stability, inter-regulatory coordination and the development of the financial sector in India. Also read Finance Minister to review economy at FSDC meeting on June 10 In the last meeting, the 28th FSDC meeting, one of the primary objectives of the FSDC was to ensure macro-prudential supervision of the economy, including monitoring the functioning of large financial conglomerates. Additionally, the council addressed matters about inter-regulatory coordination and financial sector development, with a focus on enhancing financial literacy and fostering financial inclusion initiatives across the nation. The FSDC meeting underscored the government's commitment to maintaining a robust and resilient financial system that not only fosters economic growth but also safeguards the interests of all stakeholders. As India continues its journey towards becoming a global economic powerhouse, forums like the FSDC play a pivotal role in shaping policies and regulations to navigate the complexities of the financial landscape. Comments Published on June 10, 2025 READ MORE THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per month Access to comment on every story Sign up/Manage to our newsletters Get notified by email for early preview to new features, discounts & offers ✕ Looks like you are already logged in from more than 5 devices! To continue logging in, remove at least one device from the below list Log out Log Out from all devices Terms & conditions | Institutional Subscriber"
  },
  {
    "url": "http://thepeninsulaqatar.com/article/06/06/2025/qatars-financial-sector-continues-to-grow-despite-challenges-facing-international-capital-markets",
    "url_mobile": "",
    "title": "Qatar financial sector continues to grow despite challenges facing international capital markets",
    "seendate": "20250606T084500Z",
    "socialimage": "http://thepeninsulaqatar.com/get/maximage/20250606_1749190746-612.jpg",
    "domain": "thepeninsulaqatar.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Cycling from Everest to Antarctica to raise climate awareness"
  },
  {
    "url": "https://www.2merkato.com/news/capital-market-and-commodity-exchange/8472-wegagen-capital-investment-bank-launches-as-ethiopias-first-private-investment-bank",
    "url_mobile": "",
    "title": "Wegagen Capital Investment Bank Launches as Ethiopia First Private Investment Bank",
    "seendate": "20250604T203000Z",
    "socialimage": "",
    "domain": "2merkato.com",
    "language": "English",
    "sourcecountry": "Ethiopia",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Wegagen Capital Investment Bank S.C. has officially launched operations, becoming Ethiopia’s first private investment bank under the country's new capital market framework. The launch event, held at Hilton Addis Ababa, was attended by prominent figures, including Dr. Tilahun Ismael, CEO of the Ethiopian Securities Exchange (ESX); Hana Tehelku, Director General of the Ethiopian Capital Market Authority (ECMA); and State Minister of Trade & Regional Integration, Yasmin Wohabrebbi. Dr. Aklilu Wubet, Chairperson of Wegagen Capital’s Board, noted that the bank was founded with a paid-up capital of Birr 385 million by visionary individuals and institutions committed to boosting Ethiopia’s economic growth. He emphasized the bank’s pioneering status, having received its operational license from ECMA on March 21, 2025, and becoming the first trading member of ESX on May 14, 2025. CEO Brutawit Dawit Abdi stated that Wegagen Capital is committed to setting a new benchmark in Ethiopia’s financial sector through integrity, innovation, and impact. She stressed the bank’s role in unlocking capital, driving investment, and supporting national development. Wegagen Capital offers a wide range of services including capital raising, securities underwriting, trading advisory, mergers and acquisitions consulting, and intermediation between issuers and investors. Its clients will include government entities, public enterprises, corporations, and high-net-worth individuals. The firm operates independently from Wegagen Bank, opening opportunities for broader collaboration across the financial sector. Source (including image): A press release sent to 2Merakato from Wegagen Capital Investment Bank on June 4, 2025"
  },
  {
    "url": "http://thepeninsulaqatar.com/article/04/06/2025/qfba-organizes-2nd-tot-national-development-program",
    "url_mobile": "",
    "title": "QFBA organizes 2nd TOT National Development Program",
    "seendate": "20250604T174500Z",
    "socialimage": "http://thepeninsulaqatar.com/get/maximage/20250604_1749051096-694.JPG",
    "domain": "thepeninsulaqatar.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Cycling from Everest to Antarctica to raise climate awareness"
  },
  {
    "url": "https://www.globenewswire.com/news-release/2025/06/02/3092149/0/en/Temenos-Named-Best-Core-Banking-System-at-Banking-Tech-Awards-USA.html",
    "url_mobile": "",
    "title": "Temenos Named Best Core Banking System at Banking Tech",
    "seendate": "20250602T163000Z",
    "socialimage": "https://ml.globenewswire.com/Resource/Download/e552d1ef-cf6e-4976-a6e3-9419ad8d374f",
    "domain": "globenewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "GRAND-LANCY, Switzerland, June 02, 2025 (GLOBE NEWSWIRE) -- Temenos (SIX: TEMN), a global leader in banking technology, today announced it has received the award for Best Core Banking System at the Banking Tech Awards USA 2025. These prestigious industry awards recognize the cutting-edge innovations and outstanding achievements driving the future of banking technology across the United States. With its best-of-suite core banking and modular core solutions, Temenos offers US financial institutions choice, flexibility and a proven path to banking modernization – all underpinned with cloud-native architecture, and embedded AI. Trusted by over 950 banks around the world, Temenos’ core banking software can be deployed on-premises, in the cloud, or as SaaS. US financial institutions using Temenos also benefit from robust regionalization, pre-configured banking capabilities for the US market, and a Model Bank framework which enables faster, more cost-efficient implementation. Rodrigo Silva, President Americas, Temenos, commented: “Winning this major award demonstrates the strength and depth of Temenos’ US banking capabilities, as well as our continued investment in this strategic growth market, which is helping to drive innovation in the US banking industry. With its advanced functionality, US-specific capabilities and flexible deployment options, Temenos is a compelling choice for US financial institutions.” Temenos has further strengthened its commitment to innovation for the US market with the announcement of a new Innovation Hub in Central Florida . This modern, collaborative space will be home to around 200 technology and product developers, enabling co-innovation with US financial institutions and fueling cutting-edge research and development for US-specific solutions. Investing around 20% of revenues in R&D, Temenos continues to enhance its core banking suite. Recent innovations include the launch of a Gen AI Copilot to help financial institutions design, launch, test and optimize financial products faster. The tool makes it easier for banking employees to access the full breadth of Temenos’ core banking functionality in a simple, conversational way. This builds on Temenos’ existing leadership in AI, with its launch of the first Responsible Generative AI solutions for core banking in 2024. Temenos was also named a Leader in the IDC MarketScape for North America Digital Core Banking Platforms 2024 Vendor Assessment and in the The Forrester Wave™: Digital Banking Processing Platforms, Q4 2024 ."
  },
  {
    "url": "https://www.moneycontrol.com/news/india/rbi-to-prepare-framework-for-ethical-adoption-of-ai-in-financial-sector-13071466.html",
    "url_mobile": "https://www.moneycontrol.com/news/india/rbi-to-prepare-framework-for-ethical-adoption-of-ai-in-financial-sector-13071466.html/amp",
    "title": "RBI to prepare framework for ethical adoption of AI in financial sector",
    "seendate": "20250530T110000Z",
    "socialimage": "",
    "domain": "moneycontrol.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Home News India RBI to prepare framework for ethical adoption of AI in financial sector Trending Topics Delhi blast news Live Bihar Exit Polls Live Bihar Elections 2025 Asaduddin Owaisi PM Modi Amit Shah RBI to prepare framework for ethical adoption of AI in financial sector PTI May 30, 2025 / 15:48 IST RBI The Reserve Bank will prepare a framework for responsible and ethical adoption of artificial intelligence (AI) in the financial sector during the current financial year, the central bank's annual report said. Driven by rapid advances in computing power and the vast availability of digital data, AI and machine learning (ML) technologies have seen growing interest and significant progress in recent years, with financial institutions globally and domestically increasingly adopting these technologies. Story continues below Advertisement Remove Ad The Reserve Bank will prepare a framework for responsible and ethical adoption of AI in the financial sector, as per the agenda for 2025-26 spelt in the RBI's annual report for 2024-25. \"The Reserve Bank is exploring and implementing AI/ML-driven solutions in its own functions,\" it said. It has constituted an external committee in December 2024, comprising experts with a mandate to recommend a Framework for Responsible and Ethical Enablement of AI in the financial sector. The Reserve Bank said it undertook several measures to safeguard the financial system by further strengthening the regulatory and supervisory framework of banking and non-banking sectors in line with global best practices. Going forward, the RBI said concerted efforts would be made, inter alia, towards rationalisation and harmonisation of regulations across regulated entities; preparing a framework for responsible and ethical adoption of AI in the financial sector; and strengthening of liquidity stress tests of commercial banks, among others. Further, fine-tuning the existing complaint management and grievance redress mechanism, including exploring the use of AI, would remain in focus, the report said. Story continues below Advertisement Remove Ad On AI governance policy, the report said framework for AI Policy for the Reserve Bank for responsible and ethical use of AI/machine learning (ML) technologies by employees, vendors, and third-party partners will also be initiated. By providing clear guidelines on data handling, consent and security, the policy seeks to maintain the integrity of the Reserve Bank's operations while using the opportunities that AI offers, it said. PTI first published: May 30, 2025 03:48 pm Discover the latest Business News , Sensex , and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Advertisement Remove Ad Subscribe to Tech Newsletters Al Edge Newsletter On Saturdays Find the best of Al News in one place, specially curated for you every weekend. MC Tech 3 Newsletter Daily-Weekdays Stay on top of the latest tech trends and biggest startup news. Subscribe Trending news When UPSC Fails You: 12 Attempts, 7 Mains, 5 Interviews but NO Selection — the Most Heartbreaking IAS Story Ever Warren Buffett left his 3 kids $500 million a year to give away: 'Ruling from the grave does not...' Man gets Rs 5.7 crore plastic surgery after being bullied: 'If I become world’s most beautiful...' Dharmerndra discharged from hospital, family decides to take him home Jimmy Kimmel’s childhood friend and bandleader Cleto Escobedo III passes away at 59 IIT Factory: A small village in Bihar sends more students to IIT than most big cities JEE Main 2026: What Are Your Chances of Getting an IIT Admission? Last Year, Only 16.96% Qualified for JEE Advanced 11:11 Portal Opens Today (Nov 11, 2025): Manifestation Guide for Love, Wealth & Success - Dos, Don’ts, Rituals and Affirmations This hidden southeast Asian gem lets Indians travel abroad for under Rs 2,000 a day—and it’s absolutely stunning! Zoho founder Sridhar Vembu says he has a 'Plan B' for India if US bans Google, Meta, and Microsoft platforms Domino’s Pizza takes a jab at GTA VI launch delay; asks Rockstar Games if they need help Reliance Jio announces referral program for its customers: Rewards, benefits and all you need to know Nephrologist reveals 7 most common daily habits that cause damage to your kidneys Expert shares 5 best vegetables to reverse fatty liver naturally Weight loss drugs causing hair fall? Delhi-based dermatologist has easy solutions to stop hair loss Advisory Alert: It has come to our attention that certain individuals are representing themselves as affiliates of Moneycontrol and soliciting funds on the false promise of assured returns on their investments. We wish to reiterate that Moneycontrol does not solicit funds from investors and neither does it promise any assured returns. In case you are approached by anyone making such claims, please write to us at grievanceofficer@nw18.com or call on 02268882347 You got 30 Day’s Trial of Grab it Now Ad-Free Experience Top Articles from Financial Times Actionable Insights MC Research Economic Calendar & Many More You are already a Moneycontrol Pro user. OK Yeeshu Yadav"
  },
  {
    "url": "https://www.zawya.com/en/business/fintech/16-fintech-firms-licensed-leading-digital-transformation-in-non-banking-sector-egypts-fra-lp90r5yr",
    "url_mobile": "",
    "title": "16 FinTech firms licensed , leading digital transformation in non - banking sector : Egypt FRA",
    "seendate": "20250527T054500Z",
    "socialimage": "",
    "domain": "zawya.com",
    "language": "English",
    "sourcecountry": "United Arab Emirates",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "RELATED TOPICS EGYPT FINTECH PHOTO Egypt - Sixteen companies have obtained financial technology (FinTech) licences from Egypt’s Financial Regulatory Authority (FRA) and are spearheading digital transformation efforts in the non-banking sector, its chairperson Mohamed Farid said on Monday. Four companies currently offer outsourcing services and are registered with the authority, with new entrants anticipated, Farid stated. Speaking at the fourth edition of Caisec25, an information security and cybersecurity conference and exhibition in Cairo, Farid said that approximately 110 institutions and entities currently comply with the FRA’s cybersecurity requirements. He noted, however, that the total number of companies and institutions under the FRA’s supervision across various activities and markets exceeds 3,500. Farid added that four companies currently provide outsourcing services, with significant potential for this number to grow into the dozens. “These companies are listed in a special FRA registry and conduct electronic identification, verification, and authentication; electronic customer identification; electronic contracting for non-banking financial products; and electronic registration, storage, and retrieval from digital records,” he detailed. In his conference address, Farid outlined the FRA’s ongoing efforts to foster a secure and stable environment that strengthens the non-banking financial sector’s contribution to the national economy. This is part of its continuous endeavour to implement all necessary measures and policies to protect customer data and ensure market stability. “The Authority, as the regulator of the non-banking financial sector—which encompasses the capital market, insurance activities, and non-banking financing activities—places significant importance on cybersecurity,” Farid stated. “This involves developing policies and systems to protect customer data, thereby ensuring market stability, a key role for any financial sector regulator.” He emphasised that the FRA is working to create a secure data environment and stable markets for non-banking financial institutions, aiming to bolster the non-banking financial sector’s role in the national economy. Farid added that the regulatory framework established by the FRA primarily recognises that “cyberattacks and database breaches have become the new battleground.” Therefore, enhancing cybersecurity measures is crucial, “especially given the accelerating pace of digital transformation across all sectors, which, while creating new opportunities, also generates increased cyber threats,” he said. He explained that this “necessitates swift action to develop policies and operational systems that strengthen FinTech governance and ensure non-banking financial institutions utilise these technologies in a manner that promotes market stability.” The FRA chairperson noted the “rapid and revolutionary pace of development in artificial intelligence (AI),” stressing the importance of enhancing the recovery capabilities of institutions and markets, particularly as development inherently involves risks. He advocated for increased preparedness to ensure “a resilient non-banking financial sector capable of leveraging technological advancements and managing associated risks more efficiently and effectively.” Farid also highlighted that “technological capability development must go hand-in-hand with enhancing human resource efficiency to achieve desired objectives and bridge information gaps.” He explained that “the human element remains paramount in corporate business models,” and consequently, “specialists in electronic and cybersecurity technologies and innovations must focus on providing extensive, varied, and continuous training for personnel.” The FRA chairperson affirmed that such training has become essential following the recent acceleration in the digitisation of non-banking financial transactions. This acceleration was spurred by the FRA’s issuance of a package of executive decisions to implement Law No. 5 of 2022, which provides the regulatory and legislative framework for organising and promoting the use of technology in non-banking financial activities and services. He continued: “The Financial Regulatory Authority issued Decision No. 139 of 2023 concerning the technological equipment, infrastructure, information systems, and protection and security measures necessary for using FinTech to conduct non-banking financial activities. This was followed by Decision No. 140 of 2023, regarding digital identity, digital contracts, digital registries, and the scope of FinTech use in non-banking financial activities, along with compliance requirements. This latter decision is considered the first regulatory directive from financial sector supervisory bodies to detail requirements for electronic customer identification. Furthermore, Decision No. 141 of 2023 pertains to the outsourcing registry for FinTech in non-banking financial activities, specifying companies authorised to provide electronic customer identification and contract record services to financial firms in the sector.” © 2024 Daily News Egypt. Provided by SyndiGate Media Inc. ( Syndigate.info ). Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. Read our full disclaimer policy here . © ZAWYA 2025"
  },
  {
    "url": "https://bulawayo24.com/index-id-news-sc-national-byo-252635.html",
    "url_mobile": "",
    "title": "SECZim seeks to bolster financial sector integrity",
    "seendate": "20250508T171500Z",
    "socialimage": "https://img.bulawayo24.com/articles/seczim_seczim_0.jpg",
    "domain": "bulawayo24.com",
    "language": "English",
    "sourcecountry": "Zimbabwe",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "News / National SECZim seeks to bolster financial sector integrity by Staff reporter 08 May 2025 at 16:39hrs | 109 Views The Securities and Exchange Commission of Zimbabwe (SECZim) recently held a two-day workshop in Mutare focused on Anti-Money Laundering, Combating the Financing of Terrorism, and Proliferation Financing (AML/CFT/CPF) best practices, as part of its ongoing commitment to strengthening regulatory compliance and preserving the integrity of Zimbabwe's financial sector. The workshop was designed to equip financial sector players with the necessary tools and knowledge to ensure full compliance with AML/CFT/CPF regulations, reinforcing SECZim's determination to combat illicit financial activities in Zimbabwe's financial markets. In a statement, SECZim noted that the training was aimed at covering the comprehensive spectrum of AML/CFT/CPF compliance, preparing all involved to execute their obligations effectively. This initiative comes as the commission prepares for the third round of Eastern and Southern Africa Anti-Money Laundering Group (ESAAMLG) mutual evaluations. \"This training was structured to provide participants with the necessary skills to understand and implement AML/CFT/CPF regulations,\" read part of the statement. \"The programme included SECZim presentations, a peer review exercise, a case study, and a multiple-choice assessment to further enhance the learning experience.\" SECZim's operations director, Mr. Norman Maferefa, emphasized the commission's commitment to enhancing AML/CFT/CPF awareness and compliance across Zimbabwe's financial sector. He also announced that further capacity-building opportunities are planned for 2025, focusing on both AML/CFT/CPF and prudential regulations. \"The involvement of members from the Criminal Investigation Department (CID) and the Asset Forfeiture Unit during the training was essential, especially in light of the collaborative efforts conducted in partnership with the CID Training Centre,\" Maferefa said. Participants commended the workshop for its depth and practical insights, with one stating: \"The training was thorough and informative. It helped me understand more about Enhanced Due Diligence (EDD) and Customer Due Diligence (CDD) in the context of AML, with a focus on empowering compliance officers and managers.\" Another participant added, \"This training was invaluable, providing us with deeper insights into AML activities that stockbrokers need to understand to contribute to the economy's growth.\" The AML/CFT/CPF compliance training covered a broad range of topics, from foundational concepts to more advanced subjects, including governance, enterprise-wide risk assessment, key elements of AML/CFT/CPF policy, customer due diligence (CDD), Know Your Customer (KYC) principles, and customer risk assessments. Other key areas of focus included enhanced due diligence (EDD) to manage high-risk cases, transaction monitoring, structuring AML/CFT/CPF compliance officer reports, and the reporting requirements for the goAML portal (STRs and CTRs). The training also addressed critical operational areas such as the recruitment and vetting of AML/CFT/CPF staff, record-keeping, and training for board members, management, and staff. SECZim, established under the Securities and Exchange Act [Chapter 24:25], is responsible for regulating the capital markets and protecting investors. The commission's primary objective is to foster a fair, efficient, transparent, and orderly capital market, and it reports directly to the Ministry of Finance and Economic Development. SECZim currently oversees over 200 capital markets intermediaries and collective investment schemes. This workshop is part of SECZim's broader strategy to enhance regulatory compliance in Zimbabwe's financial sector and maintain a high level of integrity within the capital markets. Source - the herald More on: #SecZim , #CID , #CFT Join the discussion Loading comments… Enable JavaScript to view comments."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/tonik-achieves-record-growth-and-innovation-milestones-with-finastras-essence-software-302449712.html",
    "url_mobile": "",
    "title": "Tonik achieves record growth and innovation milestones with Finastra Essence software",
    "seendate": "20250508T073000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Bank benefitting from new Agile streams and AI capabilities within the software; Scaling at speed, enhancing customer experience, and pioneering digital banking in the Philippines SINGAPORE , May 8, 2025 /PRNewswire/ -- Tonik, a leading neobank in the Philippines , continues to set new benchmarks in digital banking with rapid growth, operational excellence, and groundbreaking customer experience enhancements — powered by Finastra's Essence core banking solution. With a vision to drive financial inclusion in Southeast Asia , where over 70% of the population remains unbanked or underbanked, Tonik has leveraged Finastra's cloud-native capabilities to scale efficiently and deliver seamless, secure banking services. Since its launch in 2021, Tonik reports it has disbursed over one million cumulative loans, expanded its loan portfolio by seven times in the past two years and reduced unit operational service costs fivefold. Recently, Tonik's partnership with Finastra has deepened through dedicated Agile Streams engagement across functional, operational, and architectural capabilities. This collaboration has enabled Tonik to deliver a modern, transparent, and seamless digital banking experience, setting new standards for financial services in the region. Tonik is also at the forefront of AI-powered banking in the Philippines , pioneering innovations that aim to enhance customer engagement, streamline processes, and improve security, supported by Essence. The incorporation of AI in operations has seen gains of over 5X in efficiency across multiple areas such as quality control, underwriting, and advanced voice analysis. The integration of generative AI in customer service has also transformed the banking experience, with 90% of inquiries handled in-app and 75% resolved autonomously. AI-driven efficiencies have enhanced customer care productivity by over four times, reducing response times and operational costs while enabling reinvestment in better services and lower fees. Tonik's commitment to digital transformation has earned multiple global acclaim. Recently, the bank, along with Finastra, received the \"Best Core Banking System Initiative\" award at the 16th Annual Retail Banker International (RBI) Awards 2025. Additionally, Tonik was chosen as regional winner – Asia and category winner – for \"Customer Experience\" at the IBSi Digital Banking Awards 2025. These recognitions celebrate Tonik's leadership in digital banking transformation and its impact on financial inclusion in the Philippines. \"Winning these awards is testament to our mission to push the boundaries of digital banking,\" said Greg Krasnov , Founder and CEO at Tonik. \"Agility built on Essence's open architecture and integration of AI capabilities in our operations has empowered us to build a future-ready, scalable infrastructure that delivers unparalleled customer experiences while supporting our rapid expansion. This award-winning work with Finastra highlights our commitment to innovation and excellence.\" \"Tonik's achievements showcase the power of a core banking platform that provides a combination of rich, broad and deep banking functionality with advanced technology in delivering customer-centric, digital banking at scale,\" said Siobhan Byron , EVP for Universal Banking at Finastra. \"We are proud to support Tonik in its journey to reimagine banking in the Philippines .\" About Finastra Finastra is a global provider of financial services software applications across Lending, Payments, Treasury and Capital Markets, and Universal (retail and digital) Banking. Committed to unlocking the potential of people, businesses, and communities everywhere, its vision is to accelerate the future of finance through technology and collaboration, and its pioneering approach is why it is trusted by ~8,100 financial institutions, including 45 of the world's top 50 banks. For more information, visit finastra.com About Tonik Tonik is the first neobank in the Philippines , offering innovative, fully digital banking solutions. Licensed by the Bangko Sentral ng Pilipinas (BSP), Tonik is committed to revolutionizing financial services through technology-driven banking, AI-powered solutions, and customer-first experiences. For more information about Tonik, visit https://tonikbank.com . Logo: https://mma.prnewswire.com/media/1916021/5306000/FINASTRA_Logo.jpg SOURCE Finastra 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.zawya.com/en/economy/islamic-reports/qatar-islamic-finance-report-2025-expanding-horizons-voo1vvjr",
    "url_mobile": "",
    "title": "Qatar Islamic Finance Report 2025 : Expanding Horizons",
    "seendate": "20250505T110000Z",
    "socialimage": "https://static.zawya.com/view/acePublic/alias/contentid/e14d1377-e708-427e-99bc-c82dfef75e8e/0/qatar-if-report_zawya-cover-1.jpeg?f=3%3A2",
    "domain": "zawya.com",
    "language": "English",
    "sourcecountry": "United Arab Emirates",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "RELATED TOPICS ISLAMIC FINANCE SUKUK FINTECH SUSTAINABILITY MENA COUNTRIES GCC QATAR ISLAMIC FINANCE REPORTS PHOTO Qatar is a key player in the regional and global Islamic finance industries, using its strong financial infrastructure and strategic initiatives to promote growth and innovation. By the end of 2024, Islamic finance assets in Qatar had reached QAR 694 billion, with Islamic banking and sukuk contributing 97% of that figure. Despite challenges from the Covid-19 pandemic, the sector grew at a robust compound annual growth rate (CAGR) of 6.4% between 2020 and 2024. Qatar’s strategic prioritisation of the financial sector is integral to its economic diversification efforts, supported by worldclass infrastructure, competitive tax policies, and progressive regulatory reforms. The Third Financial Sector Strategic Plan, launched by the Qatar Central Bank (QCB) in 2023, aims to position Qatar as a regional leader in financial innovation. The plan places a strong emphasis on Islamic finance, which is integrated into each of its four central pillars: banking, insurance, digital finance, and capital markets. The Qatar Islamic Finance Report 2025” presents the current Islamic finance landscape in Qatar, highlighting key developments and regulatory initiatives over the past five years and providing insights into emerging trends for each of its segments. The report also evaluates the progress Qatar’s Islamic finance industry has made towards achieving the objectives of the Financial Sector Strategic Plan and positioning the country as a leading hub for financial innovation and Islamic finance. Access the full report to find out more about:"
  },
  {
    "url": "https://www.adb.org/where-we-work/fiji/economy",
    "url_mobile": "",
    "title": "Fiji : Economy",
    "seendate": "20250503T191500Z",
    "socialimage": "",
    "domain": "adb.org",
    "language": "English",
    "sourcecountry": "Philippines",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Skip to main content Fiji and ADB ADB supports Fiji’s development objectives through policy analysis and advice, sovereign and private sector financing, and targeted technical assistance and knowledge services. Economic forecasts for Fiji Share on social media Fiji's GDP growth is expected at 3.0% in 2025 and 2026 – ADO September 2025 Fiji's inflation rates forecasted at 0.5% in 2025 and 1.0% in 2026 – ADO September 2025 Figures are based on the latest edition of ADB's Asian Development Outlook, which analyzes economic and development issues in developing countries in Asia and the Pacific. This includes forecasting the inflation and gross domestic product growth rates of countries throughout the region. Download data Comparative economic forecasts The latest available economic data for Fiji compared to countries in the Pacific. More resources Asian Development Bank and Fiji: Fact Sheet The Fact Sheets summarize ADB's partnerships with member economies, providing key facts and figures and an overview of activities and future directions. Asian Development Outlook The Asian Development Outlook analyzes economic and development issues in developing countries in Asia. Key Indicators The Key Indicators for Asia and the Pacific publication presents data regarding the economic, financial, social, and environmental situations in a broad range of countries across the region. Basic Statistics The Basic Statistics brochure presents data on selected social, economic, and SDG indicators such as population, poverty, annual growth rate of gross domestic product, inflation, and government finance for economies in Asia and the Pacific. Subscriber Services Subscribe to ADB's Newsletters, Alerts and RSS feeds. Connect with Us: Follow us on X (formerly Twitter) Subscribe to our Youtube Channel Find us on Facebook Follow us on Flickr Follow us on Instagram Follow us on LinkedIn About ADB ADB is a leading multilateral development bank supporting sustainable, inclusive, and resilient growth across Asia and the Pacific. Working with its members and partners to solve complex challenges together, ADB harnesses innovative financial tools and strategic partnerships to transform lives, build quality infrastructure, and safeguard our planet. Founded in 1966, ADB is owned by 69 members—50 from the region. Headquarters 6 ADB Avenue, Mandaluyong City 1550, Metro Manila, Philippines +63 2 8632 4444 +63 2 8636 2444 Browse ADB.org Business Center Projects & Tenders Investor Relations Data & Research News & Events Independent Evaluation Other ADB Sites ADB Blogs Asia Regional Integration Center Asian Bonds Online ADB Data Library Development Asia ADB Knowledge Events © 2025 Asian Development Bank. ADB Contacts Access to Information Anticorruption and Integrity Scams Cybersecurity Sitemap Terms of Use ADB encourages websites and blogs to link to its web pages."
  },
  {
    "url": "https://tribune.com.pk/story/2543242/from-glass-ceilings-to-corner-offices",
    "url_mobile": "",
    "title": "From glass ceilings to corner offices",
    "seendate": "20250501T143000Z",
    "socialimage": "https://i.tribune.com.pk/media/images/photo-2025-04-30-15-44-341746026056-0/photo-2025-04-30-15-44-341746026056-0.jpg",
    "domain": "tribune.com.pk",
    "language": "English",
    "sourcecountry": "Pakistan",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Home Business From glass ceilings to corner offices By collaborating with governments, businesses, and regulators, ACCA ensures that financial inclusion is a reality Sponsored Content May 01, 2025 SPONSORED 4 min read facebook twitter whatsup linkded email Association of Chartered Certified Accountants Press Release Throughout history, the financial sector has predominantly been shaped by male leadership. However, as time has progressed, the landscape has transformed, with an increasing number of women breaking barriers and stepping into influential roles. This shift not only brings diverse perspectives but also reshapes the industries for the better. Ayla Majid, the first South Asian to lead the Association of Chartered Certified Accountants (ACCA) stands as a testament to this evolution. In her role as the President of ACCA and a leader in corporate governance, energy, decarbonisation, and finance, she illustrates how talent from our region is stepping into global leadership roles across corporate, academic, and public sectors. Women’s progress in finance: A Global perspective Throughout the world, women’s leadership role in finance has been increasing with them fostering innovation and showing resilience. Within the FTSE 350 companies, women now hold 43.4% of board positions. Yet, the financial sector still has a long way to go in achieving true inclusivity as their representation in executive roles has only seen a slight increase of 5% over the past three years. According to ACCA’s Leading Inclusion: Simple Steps and Significant Leaps report, gender diversity in finance helps improve decision-making, strengthens governance, and leads to more sustainable business practices. Inclusive organisations have consistently outperformed others by bringing in diverse perspectives and innovative approaches. Along with serving as the President of ACCA, Ms Majid has successfully held board positions including chairing boards across various industries - energy, banking, pharmaceuticals, and financial services. Over the past 15 years, she has seen significant progress in enhancing diversity and inclusion in leadership, but much more remains to be done. While women have come a long way, their participation in the Pakistani workforce has been consistently low with a labour force participation of approximately 22.74% as of 2023 significantly below the global average of 52.6% . The disparity is further reflected in the corporate sector in 2023, where women held only 3% of CEO roles among listed companies on the Pakistan Stock Exchange which further emphasises on the persistent gender gap in executive roles and employment within the corporate landscape of Pakistan. The economic imperative of financial inclusivity When women lead, economies thrive; hence it is an economic imperative!! A financial times research highlights that an increase in women’s participation in the workforce helps to boost global GDP significantly while simultaneously helping in stronger risk management and innovation in the financial sector. How so? Research by McKinsey indicates that companies with the highest proportion of women on executive committees earn 47% higher returns on equity than those with no women executives over a 10-year period, indicating that inclusiveness needs to be strengthened further. Cultural normals and institutional challenges are one the major barrier women face which restrict stheir access to leadership roles and limits their operationally to excel in the financial sector. Regardless of progress being made, a pressing need for structured intervention is still important to promote and support the professional growth of women. Skill development and mentorship opportunities along with introducing flexible policies such as remote work options and equal parental leave are crucial to support career advancement and support work life balance. It is also imperative for progress to be driven by creating spaces and platforms that enable women to connect, share and support each other, which leads to more inclusive workplace cultures. Initiatives like ACCA’s Women in Finance provide mentorship, guidance, and advocacy to help women advance in their careers wherewomen have the opportunity to lead, innovate, and drive meaningful change. The role of professional bodies in advancing inclusion Professional bodies play a significant role in progressing financial inclusion by setting up industry standards and driving policy changes to create a more diverse culture. ACCA has successfully been at the forefront of this effort by promoting gender diversity within the profession where approximately 50% of our global membership comprises of women Through research, advocacy, and collaboration with governments, businesses and regulators, ACCA continues to work to ensure that financial inclusion is not just a goal, but a measurable reality. As well as promoting and measuring inclusivity in finance, ACCA's Leading Inclusion report highlights the importance of data-driven approaches. Research also indicates that teams perform better when organisations have a diverse leadership team, with a McKinsey study finding that companies with a high gender diversity rate outperform their peers by 25% . Therefore, such evidence based strategies and data driven insights will help to break systematic barriers which will lead to a financial sector where opportunity and talent are accessible to all. Looking ahead: The path towards sustainable change The journey to create a more inclusive financial sector is on going which requires unwavering support and commitment from policy makers, organisations and industry players to create environments where women can thrive The future of finance now depends on the ability to accept and drive talent. Prioritising inclusivity and removing the barriers women face will help to create a profession which is more resilient and equitable which may ultimately reflect the world we live in – one that is enhanced by innovation and diverse perspectives. facebook twitter whatsup linkded email COMMENTS Replying to X Saved ! Your comment will be displayed after the approval. Error ! Denied! You can post your comment in 10 minutes. Error! Invalid Email. Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see our Comments FAQ Join Us Business Pakistan's stock market needs depth, not drama Updated 5 hours ago FDI: big market, small confidence Updated 5 hours ago Policy framework and structural change Updated 5 hours ago Is the economy suffocating under red tape? Updated 5 hours ago Diversification of Muslim economies over the years Updated 5 hours ago Diverging trade strategies at ASEAN Updated 5 hours ago LATEST Pakistan's stock market needs depth, not drama FDI: big market, small confidence Diversification of Muslim economies over the years Diverging trade strategies at ASEAN Is the economy suffocating under red tape? Policy framework and structural change MOST READ Punjab announces winter vacation schedule Why an army chief as CDF fits Pakistan's strategic realities Mamdani picks Pak-American to co-lead transition team Gold prices dip in local market after global decline President can't be arrested, booked in any case for lifetime, new clause added on PPP's demand CPEC gone sour? OPINION India's contribution to the world's talent pool Restrooms become risk rooms Pakistan done with Afghan Taliban? Pakistan's gateway dilemma Mamdani, muse and Pakistan Pakistan's leap towards digital ID and NDEL Pakistan Business World Opinion Life & Style T.Edit Sports Blog Videos Prayer Timing Pakistan Ramazan Calendar Pakistan Weather Forecast Pakistan Karachi Weather Lahore Weather Islamabad Weather About Us Online Advertising RSS Feeds Subscribe to the Paper Contact Us Careers Cricket News Football News UFC News NBA News NFL News WWE News Style Guide Privacy Policy Copyright Code of ethics Mobile App FOLLOW US facebook twitter youtube linkedin Instagram This material may not be published, broadcast, rewritten, redistributed or derived from. Unless otherwise stated, all content is copyrighted © 2025 The Express Tribune."
  },
  {
    "url": "https://www.thestar.com.my/business/business-news/2025/05/01/labuan-fsa-announces-appointment-of-affendi-rashdi-as-dg",
    "url_mobile": "",
    "title": "Labuan FSA announces appointment of Affendi Rashdi as DG",
    "seendate": "20250501T104500Z",
    "socialimage": "https://apicms.thestar.com.my/uploads/images/2025/05/01/3293921.JPG",
    "domain": "thestar.com.my",
    "language": "English",
    "sourcecountry": "Malaysia",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "LABUAN: Labuan Financial Services Authority (Labuan FSA) has announced the appointment of Bank Negara Malaysia (BNM) chief services officer Affendi Rashdi as its Director General for a two-year term from May 1, 2025 to April 30, 2027. The appointment was made by the Ministry of Finance (MOF), Labuan FSA said in a statement on Thursday. Affendi brings over two decades of experience in financial sector development, policy, and institutional services. At BNM, he held senior roles including director of the finance department and was part of the Financial Sector Blueprint team. He also contributed to the corporatisation of Bank Pertanian Malaysia Bhd (Agrobank), establishment of Small Medium Enterprise Development Bank Malaysia Bhd, and review of the Development Financial Institutions Act 2012. Labuan FSA said Affendi holds degrees from Harvard University and Universiti Teknologi MARA, and is a member of several professional accounting bodies. The board thanked outgoing director general Nik Mohamed Din Nik Musa, whose term ended on April 30, 2025, for his contributions to the Labuan IBFC’s growth. \"With the appointment of Affendi Rashdi as the new Director-General, Labuan FSA is confident the centre will continue to innovate and grow, building on its success and further strengthening its position as a preferred financial centre in Asia,\" it said. - Bernama Follow us on our official WhatsApp channel for breaking news alerts and key updates! Tags / Keywords: Labuan FSA , BNM , Affendi Rashdi , appointment , Director General , Ministry of Finance Topic: Corporate News Report a mistake What is the issue about? Spelling and grammatical error Factually incorrect Story is irrelevant This field is mandatory. Please provide details of the report. Email (optional) Please enter valid email. Report issue Report issue Cancel Invalid captcha response. Please re-try again. Thank you for your report! Related News Corporate News 07 Nov 2025 Corporate bond world to get first daily auction Corporate News 06 Nov 2025 PNB Merdeka Ventures issued Asean’s largest corporate sustainability sukuk of RM6bil Corporate News 05 Nov 2025 AWC’s corporate proposals to strengthen capital"
  },
  {
    "url": "https://www.zawya.com/en/press-release/government-news/ministry-of-finance-organises-2nd-edition-of-financial-media-forum-on-1-may-hqg9nhim",
    "url_mobile": "",
    "title": "Ministry of Finance organises 2nd edition of Financial Media Forum on 1 May",
    "seendate": "20250428T170000Z",
    "socialimage": "https://static.zawya.com/view/acePublic/alias/contentid/2f7dea11-5d03-46e6-a7a7-9305ae95bd3b/0/ministryoffinanceorganises2ndeditionoffinancialmediaforumonmay1-jpg.jpeg?f=3%3A2",
    "domain": "zawya.com",
    "language": "English",
    "sourcecountry": "United Arab Emirates",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "RELATED TOPICS UAE RELATED COMPANIES EMIRATES NEWS PHOTO Dubai, UAE, The Ministry of Finance is all set to host the second edition of the “Financial Media Forum” on 1 May under the theme “Shaping the Future of Financial sector: The Balance Between Influence and Responsibility”. Held in collaboration with the media and educational insinuations across the UAE, the event aims to promote transparency and financial literacy. Building on the success of its first edition, the forum will bring together subject-matter experts and decision-makers to explore current trends in the financial sector and the evolving role of the media in shaping public financial awareness. Also taking part in the event are government officials, along with representatives from over 40 financial, media, and academic institutions, in addition to more than 100 participants, including journalists, university students specialising in finance and economics, and representatives from public and private sector institutions. The gathering will be inaugurated by His Excellency Younis Haji AlKhoori, Undersecretary of the Ministry of Finance. Other confirmed speakers include His Excellency Mohammed Saeed Al Shehhi, Secretary General of the UAE Media Council; His Excellency Mohammed Al Hammadi, Director General of Emirates News Agency (WAM); and Mr Ali Abdullah Sharafi, Acting Assistant Undersecretary for the International Financial Relationship Sector at the MoF. Senior officials from national universities and editors-in-chief of media outlets are also expected to attend. Strategic platform His Excellency Younis Haji AlKhoori said, “The Financial Media Forum will provide a strategic platform for media professionals and financial experts to foster a shared understanding of financial and economic developments.” Through this forum, AlKhoori added, we aim to empower the community by equipping professionals with the latest knowledge and insights from the financial sector. We want to promote financial literacy and improve economic transparency, in line with the government’s vision for achieving sustainability and long-term economic growth. Today, financial media is more important than ever. It plays a fundamental role in delivering accurate information and interpreting economic trends—contributing to the development of a society that is not only informed but also capable of adapting to changes, whether at the level of government, businesses, or individuals, he further said. Forum Agenda The forum, taking place in Dubai, aims to explore the future of the UAE’s financial sector through a series of panel discussions. Key topics on the agenda include the future of the financial landscape, public-private partnerships, sustainability and the future of government spending, the role of media in enhancing financial literacy, and a dedicated session on financial awareness and social welfare. The forum will also feature several interactive activities. These include a session on training and employment opportunities for university students in international financial institutions as part of the \"UAE Global Cadres\" Initiative, and a specialised workshop showcasing best practices in financial journalism and highlighting governance principles as well as financial data analysis tailored for media professionals. This is in addition to presentations to enrich dialogue and encourage the exchange of expertise among participants. The Ministry of Finance launched the first edition of the forum last year under the theme “Government Financial Data”. That edition featured many presentations and interactive panel discussions, including an expert talk titled “Government Data and Public Financial Awareness,” a panel on “Leveraging Financial Data,” a session on “Government Financial Data and Statistics,” and an open dialogue with national media outlets. The event attracted representatives from more than 30 media organisations across the country. Send us your press releases to pressrelease.zawya@lseg.com Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release. The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk. To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages. © ZAWYA 2025"
  },
  {
    "url": "https://www.fibre2fashion.com/news/textile-news/world-bank-urges-fiscal-reforms-to-sustain-bangladesh-s-growth-302222-newsdetails.htm",
    "url_mobile": "https://www.fibre2fashion.com/news/textile-news/world-bank-urges-fiscal-reforms-to-sustain-bangladesh-s-growth-302222-newsdetails.htm?amp=true",
    "title": "World Bank urges fiscal reforms to sustain Bangladesh growth",
    "seendate": "20250426T060000Z",
    "socialimage": "https://static.fibre2fashion.com/Newsresource/images/302/adobestock-517454496_313810.jpeg",
    "domain": "fibre2fashion.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Sponsored Experience future-ready design and sourcing at Heimtextil 2026 | Register Now Transform textiles with sustainability and smart tech at ShanghaiTex 2025 | Register Today FREE Webinar on Smart Sourcing Beyond China: Data-Driven Strategies for 2025 | Register Now Intelligence Trade Fairs & Events Marketplace Marketing Solutions Digital Advertisement Print Advertisement Webinar Marketing Media Booster Magazine Subscription More News Articles F2F Prime Emerge - Fashion Accelerator Corporate Sign In All Categories Articles News Buyers Suppliers Trade Fairs Interview Market Intelligence X F2F Prime For You Textiles Apparel Fashion Retail E-commerce Technology Sustainability Chemicals Technical Textiles News Flash Comment: US–China hit pause, not peace Switzerland’s apparel imports rise 7% in Jan-Sept, China retains lead UK footfall declines 0.7% in Oct, high streets see mild lift UK outlines revised pathway to net zero in 2025 carbon plan US, Uzbekistan sign several bilateral trade, economic agreements Textiles World Bank urges fiscal reforms to sustain Bangladesh's growth 26 Apr '25 3 min read Pic: Adobe Stock Insights Bangladesh's GDP growth slowed to 4.2 per cent in FY24 and is projected to decline to 3.3 per cent in FY25 due to low investment, inflation, and financial sector vulnerabilities. However, growth may rebound in the medium term with key reforms. The World Bank urges bold action in financial sector reform, trade facilitation, and revenue mobilisation to strengthen resilience. A significant decrease in export growth and low investment have contributed to economic slowdown in Bangladesh in fiscal 2024 (FY24), however, growth is expected to rebound in the medium term, said the World Bank in its twice-yearly update. The latest Bangladesh Development Update highlights the recent economic developments and outlook for the medium term, with a special focus on financial sector stability. After a fall in real GDP growth to 4.2 per cent in FY24 from 5.8 per cent in FY23, economic activity slowed further in FY25. The economy continues to face significant challenges, including investment moderation, elevated inflation and vulnerabilities within the financial sector. However, external sector pressures have apparently eased, with robust growth in remittance inflows and exports bolstering the current account balance in FY25. Real GDP growth is projected to further moderate to 3.3 per cent in FY25 due to declining private and public investment. Political uncertainty and rising costs associated with borrowing and inputs are expected to constrain private investment growth and keep industrial growth subdued. Public investment will decline as the government reduces capital expenditure in FY25. The fiscal deficit is expected to remain under 5 per cent of GDP in the medium term, with capital expenditure increasing only gradually. Inflation is likely to remain elevated in the near term. Bangladesh's GDP growth slowed to 4.2 per cent in FY24 and is projected to decline to 3.3 per cent in FY25 due to low investment, inflation, and financial sector vulnerabilities. However, growth may rebound in the medium term with key reforms. The World Bank urges bold action in financial sector reform, trade facilitation, and revenue mobilisation to strengthen resilience. “Multiple shocks over the past decade have left South Asian countries with limited buffers to withstand an increasingly challenging global environment,” said Martin Raiser, World Bank vice president for South Asia . “The region needs targeted reforms to strengthen economic resilience and unlock faster growth and job creation. Now is the time to open to trade, modernise agricultural sectors, and boost private sector dynamism.” “Bangladesh will need bold and urgent reforms to bolster the financial sector, facilitate trade, and enhance domestic revenue mobilisation,” Gayle Martin, World Bank interim country director for Bangladesh, said in a press release. Real GDP is expected to rise gradually in the medium term, if backed by critical reforms. Inflation is expected to gradually subside in the medium term on the back of tight monetary policy, fiscal consolidation and easing import restrictions on key food commodities. Rising trade uncertainties are expected to put pressure on the external sector. “The risks to the outlook are on the downside as uncertainties related to trade, persistent inflationary pressure, weak demand in Bangladesh's major export markets, and intensifying financial sector vulnerabilities could weigh on growth,” said Dhruv Sharma, World Bank senior economist and co-author of the report . Fibre2Fashion News Desk (RR) More Textiles News - Bangladesh... Favourite Print this story Comments Submit Press Release Popular News Apparel German company Puma achieves major sustainability milestones in 2023 Textiles QCO makes Indian polyester fibre 35% costlier than China Textiles From tariffs to trust: India–EU FTA talks gain heat Textiles ICE cotton slips as weak US stocks, grains pressure market Textiles Global cotton trade down as Chinese imports slump 65% in 2024-25: ICAC Textiles Are nations drifting from US to build new alliances? Press Release Letter to Editor RSS Feed Search Companies Submit your press release on editorial@fibre2fashion.com Letter To Editor Your Comments are with Us. Your Name Your Email Comments (Max. 8000 char.) Submit Search Companies Type Corporate Association Name Search Leave your Comments Editor’s Pick Textiles EU Parliament backs 90% emissions cut target by 2040 to reach net zero Nov 11, 2025 3 min read Textiles US, Uzbekistan sign several bilateral trade, economic agreements Nov 11, 2025 2 min read Retail UK footfall declines 0.7% in Oct, high streets see mild lift Nov 11, 2025 3 min read Interviews View All Face2Face Industry Speak Fashion Talk Ankit Jain Neelam Thread Pvt Ltd Telephone brand is celebrated for its commitment to... Volker Schuster Outlast Technologies GmbH Transparency and scientific precision have always been part ... Vikrant Dalvi Ascento Overseas Pvt Ltd We deliver premium, reliable yarns that meet global... Malvika Poddar Carma India Supporting emerging talent is a cornerstone of our... Devon Murrie Living Ink Algae Black has a verified carbon-negative footprint Rajesh Singh Don & Julio Don & Julio is dedicated to introducing international... Julien Pérault Label - Julien Pérault Fashion has always been my most authentic means of... Pallavi Singhee Label - Verb The blend of old and new is key to our distinct style Ms. Nicole Rycroft Canopy Next Gen Solutions are game-changing alternatives to... Esteemed Clients X Your Daily Dose of News - Just a Click Away. Subscribe now for curated top stories and updates. By submitting, you agree to our Terms of Use and Privacy Policy. News Textile News Apparel News Fashion News Retail News Technology News E-Commerce News Sustainability Chemicals Technical Textiles Partner News Submit your press release Download News App Articles Analyst Corner Editor's Pick Advertorials Contributors' Profiles Become a Contributor - Submit Your Article Interviews Face2Face Industry Speak Fashion Talk Market Intelligence TexPro - Take a free demo Market Watch Report Cotton Report - Download Sample Report Customised Report Download Texpro App Videos Webinar Marketing Web Stories Resources Fibre2Fashion Magazine Subscribe Advertise in Magazine Browse Archives Sustainability Compendium Machinery Compendium Nonwoven Compendium © 2025, Fibre2Fashion. All rights reserved. × Advanced Search Category Select Category Apparel/Garments Textiles Fashion Technical Textiles Information Technology E-commerce Retail Corporate Association Press Release Chemicals SubCategory Select Sub-Category Country Select Country Afghanistan Albania Algeria Andorra Angola Argentina Armenia Aruba Asia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin bhutan Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Canary Islands Chad Chile China Colombia Congo Costa Rica Cote d Ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Eswatini Ethiopia Europe Fiji Finland France French Polynesia Gabon Gambia General Georgia Germany Ghana Global Greece Grenada Guatemala Guinea Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle Of Man Israel Italy Ivory Coast Jamaica Japan Jordan Kazakhstan Kenya kosova kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Mauritania Mauritius Mexico Micronesia Moldova Monaco Mongolia Morocco Mozambique Myanmar Namibia Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria North Korea Norway Oman Pakistan Palestine Panama Papua New Guinea Paraguay Peru Philippines Poland Portugal Puerto Rico Qatar Romania Russia Rwanda Sahara Saipan Samoa San Marino Saudi Arabia Scotland Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Somalia South Africa South Korea Spain Sri Lanka Sudan Surinam Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Trinidad & Tobago Tunisia Turkiye Turkmenistan Uganda Ukraine United Arab Emirates United Kingdom United States Of America Uruguay Uzbekistan Vanuatu Vatican city Venezuela Vietnam West Indies Yemen Yugoslavia Zambia Zimbabwe Year Select Year 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 Month Select Month January February March April May June July August September October November December Type Corporate Association Company"
  },
  {
    "url": "https://www.bangkokpost.com/business/general/3009921/thailand-invites-korea-to-invest-in-sustainable-finance",
    "url_mobile": "",
    "title": "Bangkok Post - Thailand invites Korea to invest in sustainable finance",
    "seendate": "20250424T054500Z",
    "socialimage": "https://static.bangkokpost.com/media/content/dcx/2025/04/24/5572921_700.jpg",
    "domain": "bangkokpost.com",
    "language": "English",
    "sourcecountry": "Thailand",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Business General Thailand invites Korea to invest in sustainable finance Deputy finance minister in South Korea to promote Thai financial hub initiative PUBLISHED : 24 Apr 2025 at 04:51 WRITER: Poramet Tangsathaporn Small Medium Large 1 Listen to this article Play Pause Deputy Finance Minister Julapun Amornvivat says Thailand has made a commitment to provide transparent and globally competitive incentives to investors in the financial sector. SEOUL - Deputy Finance Minister Julapun Amornvivat has invited South Korean investors to invest in the Thai government’s sustainable finance initiatives. “I would like to invite South Korean investors to invest in the financial sector in Thailand through the Thai government’s newly unveiled Thailand Financial Hub initiatives,” Mr Julapun told a business forum on Wednesday. He said the initiatives, recently approved by the Thai cabinet, aim to establish Thailand as a leading financial centre in Asia. Mr Julapun was speaking at the Lotte Hotel Seoul during the 2025 Ignite Thailand–Korea Business Forum, held to promote business relations between Thailand and South Korea. The two-day forum, which ended on Wednesday, was co-hosted by the Royal Thai Embassy in South Korea, The Korea Herald, the Thailand Industrial Estate Authority, the Korea Chamber of Commerce and Industry (KCCI), the Asean-Korea Centre, and the Korean-Thai Chamber of Commerce. Mr Julapun said the initiatives are built on four foundations. These include a commitment to providing transparent and globally competitive incentives, such as a clear tax framework, a streamlined company registration process, and an expedited pathway for foreign professionals and investors. Another key area is the establishment of world-class regulatory standards, spearheaded by the Supervisory and Promotion of Financial Hub Business. He also highlighted the prioritisation of human capital development, aimed at helping the workforce achieve technological expertise, digital proficiency, and cross-cultural competence. Lastly, the initiatives include a clear strategy for market participation, focusing on cross-border regional financial transactions while encouraging partnerships between international financial players and domestic firms where mutually beneficial. He added that he would like to encourage South Korean financial institutions, investors, and businesses to invest in these initiatives and in Thailand’s financial sector. He said Thailand’s strategic location offers South Korean investors an efficient gateway to the emerging Southeast Asian market, while providing cost-effective solutions that complement — rather than compete with — established financial hubs like Seoul. “It will create targeted opportunities for Korean businesses, offering a reliable gateway to Southeast Asia’s vibrant economies, supported by favourable incentives and adaptable solutions,” he told the forum. Furthermore, Thailand is strongly committed to sustainable finance and responsible digital innovation, especially in this time of climate urgency. The country also offers regulatory clarity around digital assets, blockchain, and fintech — paving the way for revolutionary financial services while upholding international standards. Such collaboration would significantly upskill Thai professionals, Mr Julapun said. KEYWORDS Financial hub Thailand South Korea Do you like the content of this article? COMMENT (1)"
  },
  {
    "url": "https://www.standardmedia.co.ke/business/opinion/article/2001517079/balancing-economic-growth-and-tax-revenue-mobilisation",
    "url_mobile": "https://www.standardmedia.co.ke/amp/business/opinion/article/2001517079/balancing-economic-growth-and-tax-revenue-mobilisation",
    "title": "Balancing economic growth and tax revenue mobilisation",
    "seendate": "20250422T094500Z",
    "socialimage": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/f153TBgdEazuxXqTQzJmhetNM71ctm3qLA2sY9Ax.jpg",
    "domain": "standardmedia.co.ke",
    "language": "English",
    "sourcecountry": "Kenya",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "The National Treasury building in Nairobi. [File, Standard] Have you ever noticed how every Marvel movie ends with a teaser, hinting at the next one? This builds anticipation, much like Kenya's National Tax Policy (NTP) and Medium-Term Revenue Strategy (MTRS), which outline a forward-looking approach to taxation. These policies shape fiscal expectations and provide a roadmap for economic reforms. Get Full Access for Ksh99/Week Uncover the stories others won’t tell. Subscribe now for exclusive access Unlock the Truth Now 》 Unlimited access to all premium content Uninterrupted ad-free browsing experience Mobile-optimized reading experience Weekly Newsletters MPesa, Airtel Money and Cards accepted Already a subscriber? Log in"
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65169537-10x-banking-announces-new-ai-capabilities-to-accelerate-core-banking-transformation-004.htm",
    "url_mobile": "",
    "title": "10x Banking Announces New AI Capabilities to Accelerate Core Banking Transformation",
    "seendate": "20250422T080000Z",
    "socialimage": "https://cts.businesswire.com/ct/CT?id=bwnews&sty=20250422502632r1&sid=gefi2&distro=ftp",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Nachrichten » 10x Banking Announces New AI Capabilities to Accelerate Core Banking Transformation Push Mitteilungen Business Wire 22.04.2025 09:06 Uhr 372 Leser Artikel bewerten: ( 2 ) 10x Banking Announces New AI Capabilities to Accelerate Core Banking Transformation The AI-enriched core banking features speed up processes and reduce costs for financial services 10x Banking, the cloud-native core banking platform, today unveiled a suite of new AI capabilities being integrated into 10x Banking's meta core to accelerate banking transformation, improve operational efficiency, and enhance decision-making for banks. The AI features will be integrated into 10x's modern, cloud-native meta core banking platform. Unveiled in July last year, the meta core is a new next-generation category of core that solves the challenges of legacy cores and avoids the complex set-up and scale challenges of neo cores, providing a de-risked, accelerated path to full cloud-native transformation. Research commissioned by 10x Banking, surveying over 200 senior IT decision-makers in banking and Financial Services, reveals that only 32% of banks are currently using AI at the core. Almost half (41%) cite AI integration with third-party platforms as their top challenge. For the first time financial institutions and banks will be able to leverage AI in the core in a meaningful way to speed up innovation, offer real-time personalised products and reduce their cost to serve. The new AI capabilities mean banks can automate the mapping of legacy banking data to accelerate core migration, create and launch new financial products to market in days rather than months and be able to access granular real-time insights, instead of relying on IT teams for outdated batch reports. With the 10x Banking Platform, banks can deliver market-leading scale to their corporate customers in real time and achieve flexibility and security in product and deployment. Importantly, the 10x Banking Platform provides corporate banks with a core solution, capable of meeting the scale of their operations in real time, supporting over 100,000 transactions per second per bank and up to 2,000 transactions per individual customer account approximately 80x faster than legacy batch transactions. Antony Jenkins, Founder and CEO of 10x Banking said, \" To get the full benefits of AI, you've got to have real-time data at scale. That's where 10x's meta core really stands out, delivering real-time insights at massive scale combined with a suite of AI capabilities that can work with bank's existing systems The 10x Banking AI product suite will comprise of three cutting-edge AI-powered solutions purpose-built to address industry-wide challenges and unlock the tremendous opportunity of AI-driven banking. AI Migrate AI-powered legacy data mapping, automating the complex migration process to reduce risk, cut costs, and accelerate transformation. AI Build GenAI-driven product customisation, enabling banks to create and test new innovative products in minutes without engineering bottlenecks AI View Instant AI-driven data insights, providing instant access to key banking metrics without manual reporting or IT dependencies. Antony Jenkins, Founder and CEO of 10x Banking continued, \" Legacy platforms slow down innovation and decision-making migrating to more modern cloud-native cores has historically been costly, complex, and time-consuming. We created 10x to help build better banks and that means putting the customer at the centre of all they do. In today's world, that means harnessing real-time data and AI but only 32% of banks have achieved this in any meaningful way. These new capabilities mean banks can finally move at the speed of AI to better serve their customers 10x Banking's CPO Okan Ozaltin will present at Money2020 Asia (22 nd April 14.00 ICT). For interviews, please contact 10x@thoughtldr.com. About 10x Banking 10x Banking is a cloud-native core banking platform for financial institutions and their partners. Founded by former banking executives and built by technologists, the 10x Banking platform empowers its customers with best-in-class security, scalability and speed. Proven across transformational deployments including Westpac, Chase and Old Mutual, 10x Banking offers banks the fastest, most cost-effective and derisked path to full cloud-native transformation through its unique 'meta core' approach. Its scalable, resilient, and flexible technology is built to empower financial institutions to better serve their customers and communities. 10x Banking is a B-Corp certified business with local presence in London, UK, Sydney, Australia and Singapore and is funded by a portfolio of world-class investors including BlackRock and J.P. Morgan. For more information, visit https://www.10xbanking.com and follow us on LinkedIn. View source version on businesswire.com: https://www.businesswire.com/news/home/20250422502632/en/ Contacts: Media contact: Cat Lenheim ThoughtLDR cat@thoughtldr.com +44 7511117587 © 2025 Business Wire Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://www.standardmedia.co.ke/business/article/2001517079/balancing-economic-growth-and-tax-revenue-mobilisation",
    "url_mobile": "https://www.standardmedia.co.ke/amp/business/article/2001517079/balancing-economic-growth-and-tax-revenue-mobilisation",
    "title": "Balancing economic growth and tax revenue mobilisation",
    "seendate": "20250422T074500Z",
    "socialimage": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/f153TBgdEazuxXqTQzJmhetNM71ctm3qLA2sY9Ax.jpg",
    "domain": "standardmedia.co.ke",
    "language": "English",
    "sourcecountry": "Kenya",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "The National Treasury building in Nairobi. [File, Standard] Have you ever noticed how every Marvel movie ends with a teaser, hinting at the next one? This builds anticipation, much like Kenya's National Tax Policy (NTP) and Medium-Term Revenue Strategy (MTRS), which outline a forward-looking approach to taxation. These policies shape fiscal expectations and provide a roadmap for economic reforms. Get Full Access for Ksh99/Week Unlock the Full Story — Join Thousands of Informed Kenyans Today Unlock the Truth Now 》 Unlimited access to all premium content Uninterrupted ad-free browsing experience Mobile-optimized reading experience Weekly Newsletters MPesa, Airtel Money and Cards accepted Already a subscriber? Log in Follow The Standard channel on WhatsApp"
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/LIVESTREAMED-Kwahu-Business-Forum-2025-1980555",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/NewsArchive/LIVESTREAMED-Kwahu-Business-Forum-2025-1980555",
    "title": "LIVESTREAMED : Kwahu Business Forum 2025",
    "seendate": "20250419T184500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/610/61062480.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - News Election 2024 TWI News | TV Polls Press Release News Blogs News Archive Crime & Punishment Politics More Regional Editorial Health Ghanaians Abroad Tabloid Africa Religion Coronavirus News Videos | TV Photo Archives News Headlines Cartoons Year In Review Eyes On The Ground | TV The Untold | TV People & Places | TV The Lowdown | TV Say It Loud | TV News You are here: Home → News → 2025 04 19 → Article 1980555 General News of Saturday, 19 April 2025 Source: www.ghanaweb.com 2025-04-19 LIVESTREAMED: Kwahu Business Forum 2025 « Prev Next » Show Video Comments (13) Listen to Article Share: play video The forum explored ways to enhance and support Ghana’s business landscape The Kwahu Business Forum has taken place at the Mpraeso Social Centre in the Eastern Region, where experts gathered to discuss national economic strategies and policies. The event featured high-profile personalities, including President John Dramani Mahama , Minister of Finance Dr Cassiel Ato Forson , and other key members of his economic team. Themed “The Future of Business: The Role of the Financial Sector,” the forum explored ways to enhance and support the growth of Ghana’s business landscape. The initiative is part of a government agenda to accelerate local enterprise development, with a target of supporting over 600 businesses by the end of President Mahama’s current term. Chief Executive Officers (CEOs) of various financial institutions shared insights on improving the country’s economic prospects. Renowned governance experts and economists also participated as panelists and discussed how the financial sector can help stimulate business activity and strengthen the national economy. The event attracted significant public interest, coinciding with the ongoing 2025 Kwahu Easter festivities. Meanwhile, there are plans to transform the Kwahu Business Forum into a national platform that attracts entrepreneurs from across the country. Chief of Staff Julius Debrah hinted at future collaborations, including potential involvement from the Ghana Revenue Authority (GRA) and other key public institutions. With strong presidential backing and growing public-private collaboration, the Kwahu Business Forum is poised to become a key driver of entrepreneurship and economic transformation in Ghana. Watch a live stream of the event on GhanaWeb TV below: Comments: This article has 13 comment(s) , give your comment Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Business Former BOST MD reportedly arrested at KIA while trying to leave Ghana Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Six-key-points-from-President-Mahama-s-speech-at-2025-Kwahu-Business-Forum-1980574",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/NewsArchive/Six-key-points-from-President-Mahama-s-speech-at-2025-Kwahu-Business-Forum-1980574",
    "title": "Six key points from President Mahama speech at 2025 Kwahu Business Forum",
    "seendate": "20250419T143000Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/543/54390937.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - News Election 2024 TWI News | TV Polls Press Release News Blogs News Archive Crime & Punishment Politics More Regional Editorial Health Ghanaians Abroad Tabloid Africa Religion Coronavirus News Videos | TV Photo Archives News Headlines Cartoons Year In Review Eyes On The Ground | TV The Untold | TV People & Places | TV The Lowdown | TV Say It Loud | TV News You are here: Home → News → 2025 04 19 → Article 1980574 General News of Saturday, 19 April 2025 Source: www.ghanaweb.com 2025-04-19 Six key points from President Mahama's speech at 2025 Kwahu Business Forum « Prev Next » Comments (7) Listen to Article Share: President John Dramani Mahama President John Dramani Mahama has outlined a comprehensive vision for economic transformation at the second edition of 2025 Kwahu Business Forum held in Mpraeso in the Eastern Region. Addressing entrepreneurs, financial leaders, and government officials, President Mahama touched on rebuilding Ghana’s economy through a strong, inclusive financial sector. Here are six key initiatives President Mahama outlined in his speech to help transform Ghana's economy. Role of financial sector in empowering businesses President Mahama emphasised the need for the financial sector to drive economic growth for all businesses. “The financial sector is the bloodstream of any economy. Without it, businesses cannot grow, jobs cannot be created, and innovation cannot thrive,” he stated. He reiterated the need for the financial system to support a broad range of businesses, from roadside vendors to large manufacturers, to build a resilient economy. Launch of a National Venture Capital Fund As part of efforts to support youth-and women-led businesses, President Mahama announced plans to launch a national venture capital fund. “We will launch a national venture capital fund to support youth- and women-led businesses and introduce regulatory reforms that encourage banks and financial institutions to lend to productive sectors of the economy. \"Financial inclusion will be at the heart of this agenda. No economy can grow if its people remain excluded from formal financial systems. We will work with banks, fintechs, and mobile money operators to expand access to financial services, particularly in rural and underserved communities\", he noted. The 24-Hour Economy Addressing his vision for the 24-Hour Economy, President Mahama emphasised that the initiative also aims to create an environment where businesses can operate seamlessly around the clock. “The future of business in Ghana must be digital, green, and inclusive. We are entering an era where digital infrastructure is just as important as roads and bridges. As part of our 24-Hour Economy strategy, we will establish the necessary conditions, through reliable electricity, efficient logistics, and enhanced public safety, for businesses to operate continuously. “This will boost productivity, create jobs, and expand opportunities across the country,” he said. Jobs and Skills compact to align education with industry He further announced the introduction of a “Jobs and Skills Compact” to align education and training skills with industry demands \"We will provide incentives to companies that create sustainable, decent jobs, and support youth entrepreneurship to unlock the creativity of our young people. \"Our vision is a Ghana where no young person needs to leave their hometown in search of opportunity. Where communities like Mpraeso, Nkawkaw, and Abetifi become hubs of innovation, enterprise, and decent work\", he stated. Economic recovery with focus on transformation President Mahama acknowledged the challenges facing the country, including inflation, a weakened cedi, and rising debt, but expressed optimism about Ghana’s path to recovery. “There are early signs of macroeconomic stabilization: inflation is gradually easing, and with disciplined management, we are restoring a measure of confidence in our economy,” he stated. Restoration of investor confidence President Mahama talked about steps to build investor confidence, such as being more transparent and making sure investments follow clear and fair rules. \"We are pursuing a targeted program to restore investor confidence by enhancing transparency, cutting bureaucratic red tape, and promoting a rules-based investment climate. \"We are prioritising sectors that can absorb labour and grow our economy sustainably agro-processing, ICT, manufacturing, tourism, renewable energy, and the green economy. But our focus is not only on attracting foreign investment. We are equally committed to empowering Ghanaians to become owners and drivers of enterprise\", he noted. JKB/EB GhanaWeb to stream Kwahu Business Forum as government targets 600 businesses by 2028 Related Articles: 'I will never give up in the fight against illegal mining' - President Mahama assures We cannot discount the economic importance of Mahama's 'Big Push' - Suhuyini What President Mahama said about President of Germany during his visit to Ghana Yaw Dabo appeals to President Mahama to support football academies financially President Mahama attends Paris Peace Forum Read all related articles Comments: This article has 7 comment(s) , give your comment Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Business Former BOST MD reportedly arrested at KIA while trying to leave Ghana Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/LIVESTREAMING-Kwahu-Business-Forum-2025-1980555",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/NewsArchive/LIVESTREAMING-Kwahu-Business-Forum-2025-1980555",
    "title": "LIVESTREAMING : Kwahu Business Forum 2025",
    "seendate": "20250419T103000Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/610/61062480.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - News Election 2024 TWI News | TV Polls Press Release News Blogs News Archive Crime & Punishment Politics More Regional Editorial Health Ghanaians Abroad Tabloid Africa Religion Coronavirus News Videos | TV Photo Archives News Headlines Cartoons Year In Review Eyes On The Ground | TV The Untold | TV People & Places | TV The Lowdown | TV Say It Loud | TV News You are here: Home → News → 2025 04 19 → Article 1980555 General News of Saturday, 19 April 2025 Source: www.ghanaweb.com 2025-04-19 LIVESTREAMED: Kwahu Business Forum 2025 « Prev Next » Show Video Comments (13) Listen to Article Share: play video The forum explored ways to enhance and support Ghana’s business landscape The Kwahu Business Forum has taken place at the Mpraeso Social Centre in the Eastern Region, where experts gathered to discuss national economic strategies and policies. The event featured high-profile personalities, including President John Dramani Mahama , Minister of Finance Dr Cassiel Ato Forson , and other key members of his economic team. Themed “The Future of Business: The Role of the Financial Sector,” the forum explored ways to enhance and support the growth of Ghana’s business landscape. The initiative is part of a government agenda to accelerate local enterprise development, with a target of supporting over 600 businesses by the end of President Mahama’s current term. Chief Executive Officers (CEOs) of various financial institutions shared insights on improving the country’s economic prospects. Renowned governance experts and economists also participated as panelists and discussed how the financial sector can help stimulate business activity and strengthen the national economy. The event attracted significant public interest, coinciding with the ongoing 2025 Kwahu Easter festivities. Meanwhile, there are plans to transform the Kwahu Business Forum into a national platform that attracts entrepreneurs from across the country. Chief of Staff Julius Debrah hinted at future collaborations, including potential involvement from the Ghana Revenue Authority (GRA) and other key public institutions. With strong presidential backing and growing public-private collaboration, the Kwahu Business Forum is poised to become a key driver of entrepreneurship and economic transformation in Ghana. Watch a live stream of the event on GhanaWeb TV below: Comments: This article has 13 comment(s) , give your comment Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Business Former BOST MD reportedly arrested at KIA while trying to leave Ghana Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/LIVESTREAMING-Kwahu-Business-Forum-2025-1980556",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/LIVESTREAMING-Kwahu-Business-Forum-2025-1980556",
    "title": "LIVESTREAMING : Kwahu Business Forum 2025",
    "seendate": "20250419T091500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/610/61062480.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2025 04 19 → Article 1980556 Business News of Saturday, 19 April 2025 Source: www.ghanaweb.com 2025-04-19 LIVESTREAMED: Kwahu Business Forum 2025 « Prev Next » Show Video Comments (8) Listen to Article Share: play video Various institutions shared insights on how to improve the country’s economic prospects The Kwahu Business Forum has taken place at the Mpraeso Social Centre in the Eastern Region, where experts gathered to discuss national economic strategies and policies. The event featured high-profile personalities, including President John Dramani Mahama, Minister of Finance Dr Cassiel Ato Forson, and other key members of his economic team. Themed “The Future of Business: The Role of the Financial Sector,” the forum explored ways to enhance and support the growth of Ghana’s business landscape. The initiative is part of a government agenda to accelerate local enterprise development, with a target of supporting over 600 businesses by the end of President Mahama’s current term. Chief Executive Officers (CEOs) of various financial institutions shared insights on improving the country’s economic prospects. Renowned governance experts and economists also participated as panelists and discussed how the financial sector can help stimulate business activity and strengthen the national economy. The event attracted significant public interest, coinciding with the ongoing 2025 Kwahu Easter festivities. Meanwhile, there are plans to transform the Kwahu Business Forum into a national platform that attracts entrepreneurs from across the country. Chief of Staff Julius Debrah hinted at future collaborations, including potential involvement from the Ghana Revenue Authority (GRA) and other key public institutions. With strong presidential backing and growing public-private collaboration, the Kwahu Business Forum is poised to become a key driver of entrepreneurship and economic transformation in Ghana. Watch a live stream of the event on GhanaWeb TV below: Comments: This article has 8 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "http://english.anhuinews.com/newscenter/headline/202504/t20250418_8406504.html",
    "url_mobile": "",
    "title": "China improves cross - border flow of financial data",
    "seendate": "20250418T043000Z",
    "socialimage": "",
    "domain": "english.anhuinews.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "E-mail lunthesis@163.com Phone 0551-65179860-203 Home Page Photos Hui Culture Travel Guide Audio & Video Sci-tech Service Publications China improves cross-border flow of financial data Pub Date: 2025-04-18 09:51 Source: Xinhua BEIJING, April 17 (Xinhua) -- China has issued a guideline to facilitate and regulate cross-border flow of financial data amid efforts to boost high-standard opening up of the financial sector, the central bank said Thursday. The guideline, released by six departments, including the People's Bank of China and the National Financial Regulatory Administration, aims to improve efficiency and compliance of cross-border flow of financial data. It further clarifies the conditions for data export and specifies the list of data items permitted for cross-border transfer to facilitate smoother data flow. Regarding areas such as cross-border payments, remittances, account openings, and shopping, the guideline specifies scenarios where data export is exempt from security assessments for outbound data transfers, where personal information export standard contracts can be signed, or where data export is permitted through personal information protection certification. For cases where data cross-border compliance obligations cannot be exempted but practical needs require data export, the guideline has categorized over 60 common financial business scenarios. Financial institutions should adopt effective data security protection efforts and technical measures to safeguard data security, according to the guideline. Industry experts believe that providing financial institutions with clear regulatory guidance will facilitate safer, more orderly, and efficient cross-border data flow in the financial sector. This will help create a more business-friendly and inclusive environment, further enhancing international competitiveness, as well as influence in rule-making.■ Editor:Zheng Chen Related News - Column: Cambodia-China ties -- A partnership built on mut... 2025-04-18 09:51 - Official: Domestic demand contributes to 80% of China's e... 2025-04-17 19:37 - GLOBALink | Chinese-invested expressway benefits liveliho... 2025-04-17 16:39 - Across China: China rides new wave of inbound cruise tour... 2025-04-17 16:39 photo >> Wuhu, Anhui: 100,000 mu of canola flowers blossoming Guest countries of honor attract visitors at 6th CIIE Video >> Anhui Perfectly Integrates Culture and Technology into Its Development Global Influencers at iFLYTEK 1024 Global Developer Festival: Why Chinese AI Shocks the World？ People >> Hebei rolls out red carpet for talent Transnational couple revives ancient dwelling in east China Travel >> 出发 世界屋脊 八廓街 City Walk Contact Us Copyright ©2000-2021 anhuinews.com All rights reserved. Reproduction in whole or in part without permission is prohibited. 皖B2-20080023-7 China improves cross-border flow of financial data 28665 Headline38006002000000000 新闻 38027 961 2025-04-18 0"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/digital-banking-platform-market-disruptions-the-15-77-billion-opportunity-vendors-cant-afford-to-miss-302430337.html",
    "url_mobile": "",
    "title": "Digital Banking Platform Market Disruptions : The $15 . 77 Billion Opportunity Vendors Cant Afford to Miss",
    "seendate": "20250416T151500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Digital Banking Platform Market Set for Explosive Growth, Projected to Reach $15.77 Billion by 2030 MIDDLETON, Mass. , April 16, 2025 /PRNewswire/ -- QKS Group , a premier market intelligence and advisory firm, has unveiled its latest comprehensive analysis of the global Digital Banking Platform Market, providing crucial insights for industry leaders aiming to capitalize on this rapidly evolving segment. The newly released reports- ' Market Share: Digital Banking Platform , 2024, Worldwide & Regional Report' and 'Market Forecast: Digital Banking Platform (AMR) , 2025-2030, Worldwide & Regional Report' - reveal a projected market valuation of $15.77 billion by 2030, growing at a CAGR of 15.24% from 2025 to 2030. This analysis equips businesses with the strategic intelligence needed to navigate the dynamic Digital Banking landscape and make informed decisions as the market scales new heights. The Next Growth Frontier in Digital Banking Platform Digital Banking Platforms are redefining how financial institutions deliver services, engage customers, and scale innovation. These platforms provide the foundational infrastructure for banks and credit unions to offer omnichannel experiences, personalized financial insights, and real-time transactions across retail, corporate, and SME segments. As digital-native challengers gain traction and customer expectations evolve rapidly, traditional institutions are embracing cloud-native, API-first digital banking platforms to accelerate modernization, reduce operational friction, and drive continuous innovation. According to VVVD Akhilesh, Senior Analyst at QKS Group , \"The evolution of Digital Banking Platforms marks a pivotal moment for the financial services industry. As customer behavior shifts toward hyper-personalized, real-time engagement, banks can no longer afford legacy inertia. The winners will be those who embrace composable architecture, AI-driven insights, and open ecosystem integration, not as future goals, but as immediate imperatives. The Digital Banking Platform is no longer just IT infrastructure; it is the bank's competitive core.\" Key Market Insights from QKS Group's Report Global and Regional Market Analysis: An in-depth examination of worldwide and regional digital banking adoption trends, competitive landscapes, and future growth projections. Competitive Benchmarking: A comparative analysis of top digital banking platform vendors, their market positioning, and strategic differentiators. Industry Adoption Trends: Insights into which sectors are investing most heavily in digital banking platform and why. Technology Disruption & AI's Role: AI, cloud-native architecture, and API orchestration are driving a fundamental shift in digital banking. Banks are leveraging AI to deliver predictive financial services, automate customer interactions, and enable real-time fraud detection. At the same time, microservices and low-code capabilities are empowering faster product rollouts, ecosystem partnerships, and hyper-scalable infrastructures. These innovations are not just optimizing operations, they're redefining what it means to be a digital-first bank. Market Leaders & Competitive Landscape The report covers key industry players, including Alkami Technology, Avaloq, Backbase, Bottomline Technologies, BPC, Coconet, Codebase Technologies, CR2, Data Action, Data Center Inc, Edgeverve, Finastra, Fisa Group, Fiserv, ieDigital, Intellect Design Arena, Kiya.ai, Mambu, Oracle, Sandstone Technology, Silverlake Axis, Sopra Banking Software, Tagit, TCS, Thought Machine, Ultradata, and Veritran. Why This Matters for AMR Vendors For CEOs, CMOs, and Chief Product Officers of digital banking solution providers, this is a critical inflection point. The demand for hyper-agile, secure, and intelligent digital banking experiences is not just growing, it's being expected. Vendors must go beyond feature parity and focus on delivering platforms that are cloud-native, integration-ready, and built for adaptability. Offering composable banking, real-time analytics, and regulatory agility will be key to capturing mindshare and wallet share in a fiercely competitive, rapidly evolving market. Get Access to Exclusive Market Insights (single report or subscription offering) Market Share: Digital Banking Platform, 2024, Worldwide https://qksgroup.com/market-research/market-share-digital-banking-platforms-2024-worldwide-2472 Market Forecast: Digital Banking Platform (AMR), 2025-2030, Worldwide https://qksgroup.com/market-research/market-forecast-digital-banking-platforms-2025-2030-worldwide-2276 The comprehensive research package includes: Most Comprehensive Market Forecast Analysis: A separate market forecast report for each of the regions, including North America , Asia Pacific , European Union, MEA, Latin America Unmatched Competitive Analysis: A separate market share report for each of the regions, including North America , Asia Pacific , European Union, MEA, Latin America QKS TrendsNXT on Digital Banking Platform Market QKS TAMSAM Insights report on Digital Banking Platform Market Exclusive Analyst Advisory Sessions for strategic decision making and validation About QKS Group QKS Group, formerly Quadrant Knowledge Solutions, is a leading global advisory and research firm, dedicated to empowering technology innovators to accelerate their growth journeys and enable technology adopters to achieve their digital transformation objectives. Click below to learn more about Competitive Intelligence Service: https://www.youtube.com/watch?v=bhUQYdKd90A To gain access to the full market insights, growth forecasts, and competitive analysis, Connect: Shraddha Roy PR & Media Relations QKS Group Regus Business Center 35 Village Road, Suite 100, Middleton Massachusetts 01949 United States Email: [email protected] Content Source: https://qksgroup.com/newsroom/digital-banking-platform-market-disruptions-the-15-77-billion-opportunity-vendors-can-t-afford-to-miss-1055 Connect with us on LinkedIn- https://www.linkedin.com/company/qksgroup/ Logo: https://mma.prnewswire.com/media/2501519/QKS_Group_Logo.jpg SOURCE QKS Group 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://aninews.in/news/business/prutech-to-lead-the-digital-transformation-of-the-bihar-state-cooperative-bank-ltd20250414115008/",
    "url_mobile": "/news/business/prutech-to-lead-the-digital-transformation-of-the-bihar-state-cooperative-bank-ltd20250414115008?amp=1",
    "title": "PruTech to Lead the Digital Transformation of The Bihar State Cooperative Bank Ltd . ",
    "seendate": "20250414T090000Z",
    "socialimage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20250414061948.jpg",
    "domain": "aninews.in",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "PruTech to Lead the Digital Transformation of The Bihar State Cooperative Bank Ltd. ANI | Updated: Apr 14, 2025 11:50 IST ANI News Join our Whatsapp channel BusinessWire India Patna (Bihar) [India], April 14: In a significant step toward modernizing its banking operations, The Bihar State Cooperative Bank Ltd. (BSCB) has entrusted PruTech Solutions with the responsibility of driving its digital transformation. This large-scale initiative will integrate advanced technologies, including Generative AI within the Core Banking System, to enhance operational efficiency and deliver a seamless, customer-centric banking experience across BSCB and its branches. The bank is presently doing business through 13 branches and 23 District Central Cooperative Banks (DCCB) affiliated with it. The project will be implemented across all the branches of BSCB and 23 DCCBs. With a project value exceeding Rs. 190 crore, this initiative represents one of the most significant technology investments in the cooperative banking sector. The project will include a centralized technology infrastructure, ensuring greater transparency, efficiency, and accessibility across Bihar's extensive banking network. By implementing a suite of advanced digital solutions, PruTech will redefine how banking services are delivered, ensuring greater efficiency, security, and customer-centricity. A Comprehensive Suite of Banking Solutions To ensure a holistic transformation, PruTech is deploying a next-generation banking ecosystem that will revolutionize BSCB's day-to-day operations. At the core of this project is the Core Banking System, a scalable platform that enables real-time transactions, centralized financial management, and seamless end to end banking services across all branches. This system will not only enhance transaction speed and accuracy but also enable unified banking operations, ensuring a seamless experience for customers. To strengthen regulatory compliance and security, PruTech is integrating an Anti-Money Laundering solution, which proactively detects fraudulent activities and ensures adherence to national and international financial regulations. By leveraging advanced risk assessment tools, this solution will safeguard BSCB against financial crimes, reinforcing trust and transparency in its banking operations. The transformation also focuses on improving accessibility and customer engagement. The Loan Origination System will digitize and streamline the entire loan process, from application to approval and disbursement, enabling faster credit decisions and reducing manual processing delays. Meanwhile, the Micro-ATM Client Application will extend financial services to rural and remote areas, ensuring cash withdrawals and transactions beyond traditional branch networks, thus expanding financial inclusion across Bihar. To further elevate operational efficiency and customer experience, Generative AI is also being leveraged to bring intelligent automation and personalized banking solutions to BSCB. Gen AI-powered virtual assistants will enhance customer interactions by providing human-like responses and contextual support in multiple languages, ensuring seamless customer engagement. Furthermore, a centralized Helpdesk & Grievance Management system will ensure faster resolution of customer complaints, improving service reliability and customer satisfaction. Additionally, by automating key functions such as human resource management, regulatory compliance, and customer service, BSCB will strengthen its operational efficiency while ensuring a seamless and transparent banking experience for its customers. At the heart of this transformation is Converge, PruTech's Integrated Command and Control Center (ICCC). This powerful platform will provide centralized oversight of all banking operations, infrastructure, and services, equipping administrators with real-time insights, proactive monitoring, managing and data-driven decision-making capabilities. With Converge, BSCB will gain unmatched agility and control over its operations, enabling smarter decision-making, increased security, and a more seamless banking experience for customers. A separate, isolated cloud IT infrastructure at the DC and DR site will be used to host the bank's applications, utilizing the Infrastructure as a Service (IaaS) model. This infrastructure will provide compute, storage, networks, and other fundamental resources to deploy and run CBS software, along with allied applications, as per the bank's requirements. By integrating these innovative solutions, PruTech is not just enhancing operational efficiency--it is empowering BSCB to streamline its core banking operations, enabling secure, real-time transaction processing while enhancing compliance, risk mitigation, and financial governance. \"This project marks a defining moment for cooperative banking in Bihar. By embracing digital innovation, BSCB is creating a more secure, efficient, and inclusive financial ecosystem that will serve as a benchmark for the sector. With Converge at the core, we are bringing the power of Gen AI, smart analytics, and seamless automation to banking oversight. By integrating various banking applications and real-time operational intelligence, we are enabling seamless banking experiences, strengthening risk management, and fostering greater financial accessibility across Bihar. This transformation will redefine how cooperative banks operate, ensuring they remain resilient and future-ready in an increasingly digital world,\" said Ambika Prasad Mohapatra, Executive VP, PruTech Solutions . Redefining the Future of Cooperative Banking BSCB is setting a benchmark for cooperative banking modernization in India by embracing intelligent automation, AI-driven solutions, and real-time operational insights. The bank is not only future-proofing its services but also expanding financial accessibility across Bihar. The solutions implemented as part of this transformation are flexible, secure, and scalable, offering seamless integration across various banking functions and branches. This ensures that BSCB can adapt to evolving financial needs, enhance service delivery, and maintain uninterrupted banking operations while meeting the highest standards of compliance and security. As a trusted technology partner, PruTech Solutions remains committed to enabling innovation-driven growth for financial institutions . With a proven track record in delivering large-scale banking solutions, PruTech is driving a new era of digital-first banking, ensuring a more secure, efficient, and customer-centric financial ecosystem. (ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India . ANI will not be responsible in any way for the content of the same)"
  },
  {
    "url": "https://www.newkerala.com/news/o/carnegie-global-tech-summit-experts-discuss-data-protection-act-340",
    "url_mobile": "",
    "title": "India Data Protection Act Reshapes Digital Financial Ecosystem",
    "seendate": "20250413T084500Z",
    "socialimage": "https://one.newkerala.com/images/t/newkerala-com-news250.webp",
    "domain": "newkerala.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Key Points Consent managers enhance personal data protection Financial sector demonstrates advanced digital governance DPDPA introduces progressive data handling regulations New Delhi, April 12 The Indian financial sector is highly digitized, with established consent-based data sharing and governance structures in place, experts said on Saturday and noted that rules concerning the Digital Personal Data Protection Act provide a framework towards a more accountable digital ecosystem while also presenting some challenges. \"The financial sector in India is not only most digitized or matured ecosystem, it's also deeply regulated. - Saranya Gopinath, Razorpay\" Speaking at the 9th Carnegie Global Tech Summit on Saturday during the session 'India's approach to data governance', they said that consent managers could help manage personal information and age-gating mechanisms are geared towards restricting children's access to harmful content. Saranya Gopinath, director, government affairs and policy, Razorpay, said it is a matter of great comfort for people that India's financial sector is properly regulated and governed. \"The financial sector in India is not only most digitized or matured ecosystem, it's also deeply regulated. As citizens, we can all take a lot of comfort in the fact that it is deeply governed,\" she said. Asked about the changes the financial sector will face due to the Digital Personal Data Protection Act (DPDPA), she noted that the financial sector is already familiar with concepts like consent and data sharing, and has advanced data structures in place. Gopinath said substantial thought has been given towards individual rights in the financial sector. She said banks undergo regular audits and there are protocols for data handling. \"Consent is not an alien term in the financial sector. It is an understood concept,\" she said. Bhuvnesh Kumar, Additional Secretary, Ministry of Electronics and Information Technology, spoke about the provisions of DPDP Act including \"right to be forgotten\". He laid thrust on the significance of rules regarding the legislation. Aman Jain, Director of Public Policy at Amazon, said global companies can face challenges in implementing the provisions of DPDPA regarding data storage and deletion. Jain highlighted the challenge of identifying the data principal in cases where a single device is used by multiple individuals, such as a household. In such cases, it is difficult to determine who the data principal is and how their rights should be protected. \"When the Act came out, a lot of us in the industry said, Look, this is progressive. This is different. You know, when the details came out and the rules came out, suddenly, the government announced that there'll be a committee that will decide on what data subjects can be or topics can be under data localization,\" he said. He said the draft rules require e-commerce companies to automatically delete data of user after three years after it is not required. \"Let's say you've gone on Amazon, you bought something today, and come 2027 we are required to delete your data if you've been inactive in that period. Now, practically, what ends up happening is we have enough use cases of folks coming back because they want to see if the warranty still exists for a TV they bought five years back, right? Or they just want to know the model you don't remember it you bought something,\" he said. \"I had a thing very recently, where I wanted to check what book I bought in 2015? And I need to be able to go back. And it doesn't mean that I need to, you know, we'd love you to shop every single day. But if you were inactive for a little while and then you were going back, then you it just creates for bad experience, right? So, so that's, I think, one so practical example,\" he added. Sunil Abraham, Public Policy Director for Data Economy and Emerging Tech at Meta India, said the decision to leave the regulations technologically neutral and future-proof is a step in the right direction. - ANI India's Data Protection Act Reshapes Digital Financial Ecosystem The Carnegie Global Tech Summit highlighted India's progressive stance on digital data protection and governance in the financial sector. Experts discussed the nuanced approach of the Digital Personal Data Protection Act, emphasizing consent-based frameworks and robust regulatory mechanisms. Industry leaders like Saranya Gopinath and Aman Jain shared insights into the challenges and opportunities presented by the new legislation. The discussions underscored India's commitment to creating a more accountable and user-centric digital ecosystem. Read more World News Share this article: Reader Comments P Priya M. This is such an important discussion! India's digital infrastructure is truly world-class. The consent-based approach makes me feel much safer about online transactions. 👏 R Rahul K. While I appreciate the protections, the 3-year data deletion rule seems impractical. Like the Amazon example shows, we often need access to older purchase records. Maybe there should be an opt-in system for data retention? A Anjali P. The 'right to be forgotten' provision is interesting but how will it work in practice? If I delete my UPI history, will banks still have access for regulatory purposes? More clarity needed. S Sanjay D. Great to see India leading in digital governance! The financial sector's maturity gives me confidence in digital payments. Though I wonder how small businesses will adapt to these new regulations. N Neha T. Age-gating mechanisms for children are long overdue! As a parent, I'm relieved to see this being discussed. The internet can be dangerous for kids without proper safeguards. V Vikram S. The shared device issue is real! In joint families, multiple people use the same phone for UPI payments. How will data rights work in such cases? Hope the committee addresses this properly. We welcome thoughtful discussions from our readers. Please keep comments respectful and on-topic. Leave a Comment Name * Email * (won't be published) Comment * (min 50 characters) Minimum 50 characters 0/50 Post Comment Thank you! Your comment has been submitted."
  },
  {
    "url": "https://aninews.in/news/world/asia/carnegie-global-tech-summit-experts-discuss-data-protection-act-hail-digitisation-regulation-in-indias-financial-sector20250412224604/",
    "url_mobile": "/news/world/asia/carnegie-global-tech-summit-experts-discuss-data-protection-act-hail-digitisation-regulation-in-indias-financial-sector20250412224604?amp=1",
    "title": "Carnegie Global Tech Summit : Experts discuss Data Protection Act ; hail digitisation , regulation in India financial sector",
    "seendate": "20250412T203000Z",
    "socialimage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20250412171551.jpg",
    "domain": "aninews.in",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Carnegie Global Tech Summit: Experts discuss Data Protection Act; hail digitisation, regulation in India's financial sector ANI | Updated: Apr 12, 2025 22:46 IST ANI News Join our Whatsapp channel New Delhi [India], April 12 (ANI): The Indian financial sector is highly digitized, with established consent-based data sharing and governance structures in place, experts said on Saturday and noted that rules concerning the Digital Personal Data Protection Act provide a framework towards a more accountable digital ecosystem while also presenting some challenges. Speaking at the 9th Carnegie Global Tech Summit on Saturday during the session 'India's approach to data governance', they said that consent managers could help manage personal information and age-gating mechanisms are geared towards restricting children's access to harmful content. Saranya Gopinath , director, government affairs and policy, Razorpay, said it is a matter of great comfort for people that India's financial sector is properly regulated and governed. \"The financial sector in India is not only most digitized or matured ecosystem, it's also deeply regulated. As citizens, we can all take a lot of comfort in the fact that it is deeply governed,\" she said. Asked about the changes the financial sector will face due to the Digital Personal Data Protection Act (DPDPA), she noted that the financial sector is already familiar with concepts like consent and data sharing, and has advanced data structures in place. Gopinath said substantial thought has been given towards individual rights in the financial sector. She said banks undergo regular audits and there are protocols for data handling. \"Consent is not an alien term in the financial sector. It is an understood concept,\" she said. Bhuvnesh Kumar, Additional Secretary, Ministry of Electronics and Information Technology, spoke about the provisions of DPDP Act including \"right to be forgotten\". He laid thrust on the significance of rules regarding the legislation. Aman Jain , Director of Public Policy at Amazon, said global companies can face challenges in implementing the provisions of DPDPA regarding data storage and deletion. Jain highlighted the challenge of identifying the data principal in cases where a single device is used by multiple individuals, such as a household. In such cases, it is difficult to determine who the data principal is and how their rights should be protected. \"When the Act came out, a lot of us in the industry said, Look, this is progressive. This is different. You know, when the details came out and the rules came out, suddenly, the government announced that there'll be a committee that will decide on what data subjects can be or topics can be under data localization,\" he said. He said the draft rules require e-commerce companies to automatically delete data of user after three years after it is not required. \"Let's say you've gone on Amazon, you bought something today, and come 2027 we are required to delete your data if you've been inactive in that period. Now, practically, what ends up happening is we have enough use cases of folks coming back because they want to see if the warranty still exists for a TV they bought five years back, right? Or they just want to know the model you don't remember it you bought something,\" he said. \"I had a thing very recently, where I wanted to check what book I bought in 2015? And I need to be able to go back. And it doesn't mean that I need to, you know, we'd love you to shop every single day. But if you were inactive for a little while and then you were going back, then you it just creates for bad experience, right? So, so that's, I think, one so practical example,\" he added. Sunil Abraham , Public Policy Director for Data Economy and Emerging Tech at Meta India, said the decision to leave the regulations technologically neutral and future-proof is a step in the right direction. (ANI)"
  },
  {
    "url": "https://www.forbes.com/councils/forbestechcouncil/2025/04/09/ai-in-fintech-revolution-or-threat/",
    "url_mobile": "",
    "title": "AI In FinTech : Revolution Or Threat ? ",
    "seendate": "20250409T133000Z",
    "socialimage": "https://imageio.forbes.com/specials-images/imageserve/65c519ee74867c6e539b7726/0x0.jpg?format=jpg&fit=bounds",
    "domain": "forbes.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Innovation AI In FinTech: Revolution Or Threat? By Andrew Riabchuk , Forbes Councils Member. for Forbes Technology Council COUNCIL POST Expertise from Forbes Councils members, operated under license. Opinions expressed are those of the author. | Membership (fee-based) Apr 09, 2025, 07:00am EDT Share Save Andrew Riabchuk is the Founder and CTO of Akurateco , a white-label payment gateway platform driving innovation in fintech. getty Artificial intelligence (AI), no longer a mere trend, is emerging as a powerful tool in the transformation of the financial sector. Its versatility and speed offer advantages from optimizing processes and reducing costs to enhancing security. However, beneath these opportunities lie hidden risks and ethical challenges that the industry is only beginning to confront. The question arises: Is AI a true revolution in financial technology, or does it introduce threats that need to be carefully managed? AI In Financial Technologies: What Lies Behind The Term? Today, much of the conversation centers on large language models (LLMs), which have proven effective in areas like text generation and image creation. Yet, AI encompasses a much broader range of technologies and approaches. Algorithms capable of identifying patterns in data offer solutions even when data isn’t directly comparable. Machine learning and the use of LLMs—powering systems like ChatGPT, Le Chat and DeepSeek—open significant opportunities, particularly in the fight against fraud within the financial sector. AI models are being used to filter traffic and detect anomalies, enabling the timely identification of fraudulent transactions. The Positive Impact Of AI On Financial Technologies AI holds the potential to replace the human factor in certain aspects of the financial sector, eliminating errors and improving service quality. However, such a statement requires nuance. While AI can drive greater efficiency, its implementation is not without risks. A study published in Artificial Intelligence and Law in 2024 highlighted how algorithms can be biased, leading to unfair decisions. This concern is especially pertinent in financial services. In this context, questions about accountability arise, particularly when it comes to safeguarding sensitive data. Ensuring fairness and transparency in AI systems is critical. Cybersecurity risks also play a significant role. The U.S. Department of the Treasury outlined unique threats AI presents in the financial sector in a 2024 report . These risks call for the adoption of best practices for data protection and anomaly monitoring to mitigate potential cyberattacks. However, AI doesn’t replace an architectural approach; instead, it helps analyze large amounts of data, identify anomalies and automate security processes. Its strength lies in processing logs, predicting threats and optimizing responses. Machine Learning In Fraud Prevention And Payment Process Optimization Machine learning has long been a valuable asset in combating fraud. By analyzing data within financial transactions and identifying anomalies, AI can pinpoint suspicious activity, reducing the chances of financial loss. Additionally, AI helps optimize payment processes by streamlining transaction routes, improving conversion rates and lowering costs. For payment solution providers relying on multiple financial partners, such optimizations are key to selecting the most effective path for each transaction. AI In Payment System Automation And Software Development AI plays an essential role in automating payment processes, from creating integrations to updating systems. By speeding up integration creation, AI reduces labor costs and enhances user experience. However, it’s important to acknowledge that AI models can occasionally produce incorrect or suboptimal solutions, necessitating additional verification before implementation. The Future Of AI In The Financial Sector The potential for AI to optimize and improve processes in the financial sector is vast. However, successful implementation requires careful attention to ethical considerations, cybersecurity and algorithmic transparency. Data quality is foundational for AI model accuracy, and ongoing auditing for bias or errors is necessary to improve reliability and minimize risks. Establishing clear ethical standards for AI is essential to avoid unintended consequences like discrimination or data leakage. These standards will safeguard the ethical and responsible use of this technology. Equally important is cybersecurity. Protecting AI systems from attacks and maintaining constant anomaly detection is critical for their reliable operation. AI is not a superintelligence but a powerful tool for rapid data search and analysis. It should not replace human thinking but only help implement ideas. Ethical questions arise when AI is perceived as an independent entity rather than a tool requiring responsible use and independent audit. While AI presents numerous opportunities, its integration into the financial sector must be approached cautiously. Ultimately, a strong focus on security and risk management will ensure its safe and effective use. Forbes Technology Council is an invitation-only community for world-class CIOs, CTOs and technology executives. Do I qualify? Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video"
  },
  {
    "url": "https://www.prokerala.com/news/articles/a1622726.html",
    "url_mobile": "",
    "title": "India financial system has become more resilient , diverse : SEBI",
    "seendate": "20250405T130000Z",
    "socialimage": "",
    "domain": "prokerala.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "New Delhi, April 5 : India's financial system has become more resilient and diverse, driven by rapid economic growth, and regulatory framework in securities markets has been enhanced in line with international practice to manage and prevent emerging risks, the Securities and Exchange Board of India (SEBI) said on Saturday, citing a latest IMF-Financial System Stability Assessment (FSSA) report. New Delhi, April 5 (IANS) Indiaâ€™s financial system has become more resilient and diverse, driven by rapid economic growth, and regulatory framework in securities markets has been enhanced in line with international practice to manage and prevent emerging risks, the Securities and Exchange Board of India (SEBI) said on Saturday, citing a latest IMF-Financial System Stability Assessment (FSSA) report. The markets regulator said, in a statement, that the financial sector in India has shown recovery from various distress episodes of the 2010s and withstood the pandemic well. \"In terms of evolution of the financial sector landscape, the Non-Banking Financial Intermediaries (NBFI) sector has become diverse but more interconnected. Banks and Non-Banking Financial Companies (NBFCs) have sufficient aggregate capital to support moderate lending even in severe macro-financial scenarios,\" the SEBI said, citing the IMF report findings. On regulation and supervision of NBFCs, the IMF acknowledged Indiaâ€™s systematic approach for prudential requirements of NBFCs with scale based regulatory framework. The IMF also appreciated Indiaâ€™s approach on introduction of bank-like Liquidity Coverage Ratio (LCR) for large NBFCs. For supervision of banks, the IMF suggested strengthening credit risk management through \"IFSR 9 adoption and upgrading supervision over individual loans, collateral valuation, connected borrower groups, large exposure limits, and related-party transactions\". The report further stated that notable improvements include establishing the Corporate Debt Market Development Fund (CDMDF), introducing swing pricing, and liquidity requirements for bond mutual funds. The regulatory scope has also been expanded over emerging areas such as sustainability and investor protection measures for fast-growing equity derivatives products, according to the IMF-FSSA report. According to the SEBI, the \"FSSA report acknowledges that Indiaâ€™s insurance sector is strong and growing, with a significant presence in both life and general insurance. The sector has remained stable, supported by better regulations and digital innovations\". The report noted Indiaâ€™s progress in improving oversight, risk management and governance and suggests further steps toward risk-based solvency/supervision frameworks and stronger group supervision. It acknowledged transition plans towards a risk-based approach in the insurance sector. \"This reflects Indiaâ€™s commitment to global best practices and a resilient insurance sector,\" said the capital markets regulator. The Financial Sector Assessment Programme (FSAP), a joint programme of the IMF and the World Bank (WB), undertakes a comprehensive and in-depth analysis of a countryâ€™s financial sector."
  },
  {
    "url": "https://blogs.worldbank.org/en/team/h/harish-natarajan",
    "url_mobile": "",
    "title": "Harish Natarajan | Lead Financial Sector Specialist",
    "seendate": "20250403T164500Z",
    "socialimage": "https://blogs.worldbank.org/content/dam/sites/blogs/img/detail/mgr/blog-default.png",
    "domain": "blogs.worldbank.org",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Harish Natarajan Lead Financial Sector Specialist This page in: English English English Harish is a Lead Financial Sector Specialist with the Payment Systems Development Group, at the World Bank (April 2009 to present). His responsibilities include assisting countries in improving safety, reliability and efficiency of payments, remittances and securities settlement systems; participating in country and regional payment systems diagnostic studies; and supporting countries in implementation of payment systems and payment systems reforms. He is currently working on projects in these areas in several countries across all World Bank regions. He also represents the World Bank in the retail payments working groups of the Committee on Payment Market Infrastructures at the Bank for International Settlements. He has participated in the Financial Sector Assessment Program (FSAP) in Papua New Guinea, Oman, India, Malaysia, Vietnam, Kazakhstan and Suriname. Prior to joining the World Bank, Harish worked with VISA Inc, in the South Asia region in various senior level positions in business development, operations and risk management. Prior to VISA, Harish worked in technology and project management roles in Citigroup, Infosys and other technology companies, primarily in the areas of payment systems. Harish holds an under-graduate degree in Electrical Engineering from Indian Institute of Technology-Madras and a Post Graduate Diploma, from Indian Institute of Management-Calcutta, specializing in IT systems and Finance. More Posts By Harish"
  }
]