[
  {
    "url": "https://www.yahoo.com/news/judge-cancels-self-defense-hearing-024653551.html",
    "url_mobile": "",
    "title": "Judge cancels self - defense hearing for man charged in deadly Twin Peaks shooting",
    "seendate": "20241231T050000Z",
    "socialimage": "https://media.zenfs.com/en/whnt_huntsville_articles_930/41d9c4dfe71a89c899e606ec57349633",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "HUNTSVILLE, Ala. ( WHNT ) — A Madison County judge has reversed a decision to hold a self-defense hearing for a man charged in the Twin Peaks deadly shooting — before his preliminary hearing. Attorneys for Jeremiah Matkins say the issue of the immunity or self-defense, hearing has not yet been resolved, but the court has issued a new order setting his preliminary hearing for Jan. 8 and withdrawing its Dec. 17 order that set a Jan. 14 immunity hearing. NWS confirms additional surveys of storm damage across Tennessee Valley was ‘straight-line wind’ Advertisement Advertisement Advertisement Advertisement Matkins, 21, is charged with killing Ray’shun Markelle Bates, 23, of Decatur on Nov. 9 inside the restaurant. The Huntsville Police Department said the shooting took place during an altercation between two groups of people. Under Alabama law, if a defendant can successfully argue to a judge he was acting in self-defense in a deadly encounter, the murder case is over. Matkins’ defense attorney Larry Marsili has argued Alabama law does not require the self-defense hearing to take place after a preliminary hearing, but it is uncommon. The defense says the law doesn’t require a defendant to wait an extended period before being allowed to show he acted in self-defense. The Madison County District Attorney’s Office opposed the request. But District Court Judge Linda Coats ruled on Dec. 17 in favor of the defense, finding that she could hold the immunity hearing and not wait for the case move to Madison County Circuit Court following an indictment. Advertisement Advertisement Advertisement Advertisement POLICE: Huntsville woman arrested after man injured in shooting But on Dec. 19, Coats issued a new order saying the Dec. 17 order was withdrawn, the immunity hearing was canceled and the matter is under “further advisement by the court.” Last week she set Matkins’ preliminary hearing for Jan. 8. Marsili told News 19 today that Alabama’s self-defense law is unclear, but that it was aimed at preventing long delays before a person could make a self-defense argument in a murder case. “The spirit of that law is to shield people who act in self-defense from the tedious and costly process of being prosecuted for actions that are justified under the law,” Marsili said. “I can’t imagine the lawmakers meant for a person acting in self-defense to have to wait potentially several years to be exonerated.” Advertisement Advertisement Advertisement Advertisement Generally, during a preliminary hearing, prosecutors introduce police testimony that spells out the case against the defendant and asks the court to send to the case to a grand jury for an indictment. The defense can cross-examine witnesses and call their own witnesses. The court is charged with deciding if there is probable cause to send the case to a grand jury. Copyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. For the latest news, weather, sports, and streaming video, head to WHNT.com. About Our Ads"
  },
  {
    "url": "https://en.interfax.com.ua/news/general/1037560.html",
    "url_mobile": "https://en.interfax.com.ua/news/general/1037560-amp.html",
    "title": "Umerov , members of Rear Logistics Operator , Defense Procurement Agency outline priorities for 2025",
    "seendate": "20241230T231500Z",
    "socialimage": "https://media.interfax.com.ua/media/thumbs/images/2023/01/iHpRIQpCe8Dj.jpg",
    "domain": "en.interfax.com.ua",
    "language": "English",
    "sourcecountry": "Ukraine",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "20:34 30.12.2024 Umerov, members of Rear Logistics Operator, Defense Procurement Agency outline priorities for 2025 2 min read Ukrainian Defense Minister Rustem Umerov and members of the supervisory boards of the State Rear Logistics Operator and the Defense Procurement Agency have outlined priorities for 2025 aimed at creating effective defense procurement institutions, the press service of the Ministry of Defense said. \"I held important meetings with the supervisory boards of the State Rear Logistics Operator and the Defense Procurement Agency,\" the ministry's press service said on Monday, citing Umerov. As the minister reported, priorities for 2025 were discussed at the meeting with members of the supervisory boards. Namely, improving procurement mechanisms; monitoring and control over contract implementation; expanding cooperation with international partners; ensuring prompt and timely feedback for companies and suppliers; creating an effective internal control system. \"Our common goal with both supervisory boards is to form strong and effective institutions capable of promptly fulfilling key strategic tasks. The strength and defense capability of our army depend on their work,\" Umerov said. The minister also said defense procurement is a strategic area that directly affects the combat capability of the Ukrainian army. \"The introduction of modern approaches to resource management will improve the quality of provision of our military,\" the Ukrainian Defense Minister said. Umerov thanked the members of the supervisory boards for their work. \"Only joint, coordinated actions between the Defense Ministry, supervisory boards and agencies can ensure the effectiveness of defense procurement and strengthen public confidence in this process,\" Umerov said. Tags: #purchase #supervisory #umerov #defense"
  },
  {
    "url": "https://menafn.com/1109041530/Japan-looks-to-enhance-defense-spending",
    "url_mobile": "",
    "title": "Japan looks to enhance defense spending",
    "seendate": "20241230T123000Z",
    "socialimage": "https://menafn.com/updates/pr/Menafn_News_Images/Local_Politics_1117.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.yahoo.com/news/ukraine-secures-over-156-million-133418051.html",
    "url_mobile": "",
    "title": "Ukraine secures over $156 million for defense industry from European allies , defense minister says",
    "seendate": "20241229T151500Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/x0vBl3l2kCMIwl3sR2Qz5A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/kyiv_independent_articles_496/1e1a58a156ab02892e93ce593da25c0c",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways Ukraine has received over 150 million euros ($156 million) in funding from Denmark, France, and Lithuania to bolster its defense industry, Defense Minister Rustem Umerov said on Dec. 29. The funds will support the production of long-range drones , missiles, and artillery, which are critical to Ukraine’s defense strategy. These domestically produced weapons provide an alternative to Western arms, which often come with usage restrictions , and help address shortages of artillery ammunition on the battlefield. Advertisement Advertisement Advertisement Advertisement Denmark contributed 111 million euros ($116 million) through agreements between Ukraine's Defense Ministry, the Strategic Industries Ministry, and the Danish Defense Ministry to strengthen the Armed Forces with advanced domestically made munitions. France provided a 29 million euros ($30 million) grant to enhance Ukraine’s security and defense capabilities. Lithuania allocated 10 million euros ($10.4 million) under a memorandum involving the Lithuanian and Ukrainian defense ministries and Ukraine’s Strategic Industries Ministry to support the development of Ukraine’s defense industry. \"I thank our partners for their important support and contribution to strengthening Ukraine's defense capabilities,\" Umerov said . Advertisement Advertisement Advertisement Advertisement President Volodymyr Zelensky previously announced plans for Ukraine to produce at least 30,000 long-range drones in the coming year as part of the country's resilience plan. The funding marks a significant step in boosting Ukraine’s self-reliance in arms production as the war continues. Read also: Ukrainian drones made up over 96% of UAVs military used in 2024, defense minister says We’ve been working hard to bring you independent, locally-sourced news from Ukraine. Consider supporting the Kyiv Independent . About Our Ads"
  },
  {
    "url": "https://www.foxnews.com/politics/european-officials-pitch-new-idea-shore-up-defenses-trump-return",
    "url_mobile": "https://www.foxnews.com/politics/european-officials-pitch-new-idea-shore-up-defenses-trump-return.amp",
    "title": "European officials pitch new idea to shore up defenses with Trump return",
    "seendate": "20241229T101500Z",
    "socialimage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/US-Service-Members-in-Europe.jpg",
    "domain": "foxnews.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "close Video How will Trump’s Defense Department picks affect weapons development? Fox News chief national security correspondent Jennifer Griffin reports on how President-elect Trump’s Defense Department picks could affect the United States keeping up with China on ‘Special Report.’ NEW You can now listen to Fox News articles! As NATO member states struggle to meet their defense spending goals and war rages on Europe's eastern front, officials are struggling to agree on a plan to shore up hundreds of billions of dollars to bolster defenses. Eight NATO countries did not meet their 2% target for defense spending in 2024. And as many member states struggle with chronically stressed budgets, calls to meet those goals are not being heeded quickly. The European Commission estimates about 500 billion euros, the equivalent of $524 billion in investments, are needed in the coming decade to defend Europe against evolving threats. NATO LEADERS PREDICT ERA OF 2% DEFENSE SPENDING 'PROBABLY HISTORY' AS TRUMP REPORTEDLY FLOATS HIGHER TARGET The EU's budget cannot be used to fund defense directly, and some European officials and NATO experts are proposing a global defense bank to dole out funds for military modernization. A defense, security and resilience (DSR) bank would issue bonds backed by AAA ratings for financially strapped countries to upgrade their defenses and would provide guarantees for commercial banks to offer credit to defense suppliers. European officials are struggling to agree on a plan to shore up hundreds of billions of dollars to bolster defenses. (U.S. Army photo by Spc. Ryan Parr) \"This is not a substitute to raising defense spending in each of these countries. I think it should be a supplemental tool,\" Giedrimas Jeglinskas, chairman of the national security committee in the Lithuanian parliament and a former NATO official, told Fox News Digital. His remarks echo those of incoming President Trump, who has long threatened to pull the U.S. out of NATO due to the number of nations missing the mark on the 2% goal for defense spending. \"I think we have to look at it also as an opportunity for the U.S. as well,\" Jeglinskas added. \"I understand the skepticism by Donald Trump of the World Bank and then the IMF [International Monetary Fund] and IFC [International Finance Corporation] and other institutions. I think there's been a lot of capital deployed and a lot of investments that these banks or institutions do. The real impact is, at best, questionable. So, I think we have to have very clear KPIs [key performance indicators]. We need to build defense.\" The United States' $824 billion defense budget in 2023 equaled half of total defense spending by all NATO member states combined at $1.47 trillion. PUTIN SAYS RUSSIA READY TO COMPROMISE WITH TRUMP ON UKRAINE WAR The return of Trump to the White House, coupled with a U.S. push to refocus on China, has left Europeans wondering whether the U.S. will have less of an appetite to defend Europe in years to come. More EU defense chiefs and foreign ministers have pitched the idea of issuing joint debt through bonds to finance military projects. But some countries like Germany have voiced concerns about maintaining their own sovereignty and a disproportionate financial burden on some countries. The DSR bank idea is explained at length in a new Atlantic Council report by defense fellow Rob Murray. The EU's budget cannot be used to fund defense directly. (Ukrainian Defense Ministry Press Service via AP, File) \"For allies across both the Euro-Atlantic and Indo-Pacific regions, the bank could go beyond offering low-interest loans for defense modernization to facilitating equipment leasing, currency hedging, and supporting critical infrastructure and rebuilding efforts in conflict zones like Ukraine,\" Murray wrote. \"An additional critical function of the DSR bank would be to underwrite the risk for commercial banks, enabling them to extend financing to defense companies across the supply chain.\" The goal would be to offer financing to small and medium-sized defense companies that often struggle with access to funds. \"By providing loans with extended maturities, the bank would offer predictable and sustainable funding for defence modernisation. Its governance structures would align funding with collective security goals, such as upgrading arsenals and investing in emerging technologies,\" Jeglinskas wrote in a recent op-ed for the Financial Times. A defense, security and resilience (DSR) bank would issue bonds backed by AAA ratings for financially strapped countries to upgrade their defenses. (Alexandra Beier/Getty Images) Asked how the DSR bank would get countries to agree on defense funding priorities, Jeglinskas likened the idea to the U.K.-led Joint Expeditionary Force, a military alliance that includes Denmark, Estonia, Finland, Iceland, Latvia, Lithuania, the Netherlands, Norway and Sweden. Jeglinskas noted the 33 trillion euros in European assets under management across the continent. \"There's really no political will, no risk appetite to move them anywhere besides the kind of bond markets where they rest now,\" he said. \"But several nations need to build that initial capital, and then, by using the sovereign rating to get to hopefully AAA in capital markets, raise that money from bond markets and to start funding defense programs.\" The European Investment Bank has doled out long-term loans and guarantees to European nations' projects that align with EU policy goals. \"But even they are struggling with kind of shifting their mandate towards more dual-use technologies is still not allowed in their funding package,\" said Jeglinskas. CLICK HERE TO GET THE FOX NEWS APP \"Of course, every other bank in Europe is looking at EIB for their signals. That signaling hasn't been there yet. So, that's the point. We need to create some sort of mechanism, and that kind of global defense bank would be one of the tools that we could use to rally the capital and really direct it toward defense. So, it's really creating another multilateral lending institution.\" Fox News Politics Get the latest updates from the 2024 campaign trail, exclusive interviews and more Fox News politics content. Arrives Weekdays By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use , and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time. Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter!"
  },
  {
    "url": "https://timesofindia.indiatimes.com/world/pakistan/pak-minister-defends-military-trial-of-civilians/articleshow/116659815.cms",
    "url_mobile": "https://timesofindia.indiatimes.com/world/pakistan/pak-minister-defends-military-trial-of-civilians/amp_articleshow/116659815.cms",
    "title": "Pakistani Minister Military Trial Civilians : Pak minister defends military trial of civilians",
    "seendate": "20241225T190000Z",
    "socialimage": "https://static.toiimg.com/thumb/msid-116659863,width-1070,height-580,imgsize-672366,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "domain": "timesofindia.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Edition IN IN US Sign In TOI Today's ePaper News World News Pakistan News Pak minister defends military trial of civilians Trending Kamala Harris Tibet Earthquake Elon Musk Donald Trump Gulf of America China HMPV Cases Sheikh Hasina Kamala Harris Tibet Earthquake Elon Musk Donald Trump Gulf of America China HMPV Cases Sheikh Hasina Kamala Harris Tibet Earthquake Elon Musk Donald Trump Gulf of America China HMPV Cases Sheikh Hasina Pak minister defends military trial of civilians PTI / Updated: Dec 25, 2024, 22:02 IST Share AA + Text Size Small Medium Large Follow us Pakistani minister Attaullah Tarar defends the use of military courts for civilian trials related to attacks on defense facilities, asserting they are competent and necessary for such cases. He urges opposition PTI to avoid politicizing the issue, while reiterating that military trials adhere to fair trial principles. File photo (Picture credit: ANI) ISLAMABAD: A Pakistani minister on Wednesday defended the military trial of civilians, saying that such courts were competent to deal with the cases related to attacks on army facilities. Information minister Attaullah Tarar also urged the opposition Pakistan Tehreek-e-Insaf (PTI) led by Imran Khan to refrain from politicising or disputing the issue of military trials. \"When an attack is carried out on a defence institution or its property is set ablaze, it becomes the responsibility of the relevant authorities to apprehend the culprits. Just as railway police handle crimes on railway premises, military courts address offences targeting military assets. So, when attacks on military assets occur, the Military Act is enforced,\" he said while addressing a press conference. Tarar criticised Khan's party for using military courts as a political tool, aiming to create controversy around them. He clarified that military courts only handle cases involving attacks on defence establishments, citing incidents such as the attack on the Corps Commander's House in Lahore. The minister also criticised the PTI for changing its stance regarding trials of civilians in the military courts, recalling that during Khan's tenure, military court trials were praised. \"The statements praising the military courts from PTI's leadership are still available on social media. Yet now, the same individuals are lobbying internationally against these courts,\" Tarar said. He assured that military trials adhere to fair trial principles and dismissed claims of injustice in military trials. The military courts tasked to hear cases of suspects involved in the attacks on military facilities on the May 9, 2023 protest last week sentenced 25 civilians to prison terms ranging from 2-10 years. Khan's party criticized the verdicts, arguing that military courts have no jurisdiction over civilians. End of Article FOLLOW US ON SOCIAL MEDIA Visual Stories Previous 9 foods to keep your kidneys healthy Lifestyle 10 best reasons to visit Kanha National Park right now travel ​8 ways to reduce uric acid in your body​ Lifestyle 10 breakfast dishes that can be made with banana Food 10 indoor plants that will be in trend in 2025 (stock them now!) Lifestyle 10 Indian fruits that are red in colour Lifestyle 10 beautiful animals that are red in colour Lifestyle There’s only one country which begins with the letter ‘Y’ travel 8 wild animals to spot in Jim Corbet National Park travel 8 delicious non-vegetarian tandoori dishes perfect for New Year’s Eve party Food Next 1 2 3 Photostories Munmun Dutta recalls how she got Taarak Mehta Ka Ooltah Chashmah; says 'I was 17 and I had done just one show' Early warning signs of magnesium deficiency women must be careful about ​5 lesser-known benefits of keeping your life private, as per psychology​ From Shah Rukh Khan refusing to call her ‘ugly’ to requesting Kapil Sharma to work on her role; Upasana Singh on how things went downhill with the show 7 iconic UNESCO heritage sites to visit in India in 2025 ​10 feel-good habits to keep you destressed in 2025​ ​​Warren Buffett recommends these 5 books to help one grow richer in 2025​ Bigg Boss 18: Confirmed list of the contestants of Salman Khan hosted controversial show From a lavish house worth approximately Rs 15 crores to high-end cars collection, net worth, and more: The luxurious life of Shark Tank India’s Anupam Mittal Zodiac signs that are set to excel in academics in 2025 Numerology Predictions Today, January 07, 2025: Read your personalized forecast for numbers 1 to 9 ​Morning rituals that take 5 minutes but set up an entire day for success​ 1 2 3 Hot Picks HMPV Virus Live Delhi Election 2025 Nepal Earthquake Canada CM Resigns Asaram Bapu Bail Budget 2025 Stock Market Today TOP TRENDING Allu Arjun Tirupati Ambulance Accident Delhi Election Date Delhi Elections 2025 Date Indian Railway Recruitment Air Force Officer Arrest WWE Raw Netflix 2025 H5N1 Bird Flu Emmanuel Acho Virat Kohli IPL Career Tired of too many ads? go ad free now Trending Stories In World Entire Website Delhi Election 2025 Live Updates: Canards being spread about wrongful deletions in electoral rolls, says CEC Rajiv Kumar BJP Candidates List for Delhi Assembly Election 2025, Including Constituencies and Districts​​​ Donald Trump reacts to Justin Trudeau's resignation: 'If Canada merges with US... ' Patrick Mahomes was in Denver, but his wife, Brittany Mahomes, and the kids were having an unforgettable snow day Justin Trudeau resigns as Canada PM: What his departure means for India Massive earthquake of 7.1 magnitude strikes Tibet, Nepal border; at least 9 killed 'America would be toast': Elon Musk warns of bankruptcy and rising interest rates due to $36 trillion debt Travis Kelce's girlfriend, Taylor Swift, gets involved in a serious controversy that has nothing to do with her US to remove regulations preventing civil nuclear cooperation with India, announces NSA Jake Sullivan Stephen Curry's mother, Sonya Curry, opens up about her experience with adultery, drawing biblical parallels in an emotional podcast: \"Like Eve, I knew better\" 'Baki sab gone ...': BJP takes jab at Trudeau's exit, calls PM Modi 'ultimate bigg boss' ‘Gulf of America’? Trump proposes bold renaming, targets Mexico & Canada Can Delhi impose congestion fee like New York to fight pollution? IAF chief cites China's fighter jets to stress on self-reliance Delhi elections: Stage and pitch set in 3-way capital contest V Narayanan appointed new Isro chairman Factors that triggered Trudeau's decision to resign as Canadian PM Elon Musk a 'monster': Giorgia Meloni slams labelling, says because he chose ... Stalin: Will fight legally against 'anti-federal' UGC draft rules Beed sarpanch's brother meets Fadnavis, says HC plea recalled Tired of too many ads? go ad free now Explore Every Corner Across The Globe Carmelo Anthony Oneplus 13 Board Paper Writing Tips Delhi Election Schedule Taylor Swift The Undertaker Andy Reid Donald Trump NFL Star Travis Kelce Pushpa 2 Box Office Collection Michael Jordan Taylor Swift Jason Kelce Wife Stephen Curry Mother Emmanuel Acho Derek Fisher Skip Bayles HMPV Virus Cases WWE Raw Results and Highlights Patrick Mahomes AAP Candidates List Hulk Hogan Kamala Harris Jasprit Bumrah Hailee Steinfeld Delhi Election Congress Candidates List ICC Champions Trophy 2025 Schedule Bank Holidays 2025 Elon Musk Nyt Connections About us Create Your Own Ad Terms of Use and Grievance Redressal Policy Privacy policy Advertise with us RSS Newsletter Feedback ePaper Sitemap Archives FOLLOW US ON Other Times Group News Sites The Economic Times Hindi Economic Times Navbharat Times Maharashtra Times Vijaya Karnataka Telugu Samayam Tamil Samayam Malayalam Samayam I am Gujarat TimesPoints Indiatimes Brand Capital Education Times Times Food Mumbai Mirror Bangalore Mirror IndiaTimes Bangla Hindi Podcast Popular Categories Headlines Sports News Business News India News World News Bollywood News Health+ Tips Indian TV Shows Celebrity Photos Technology News Hot on the Web MasterChef Promo Tomato Juice Bigg Boss 18 Pushpa 2 Box Office Collection Black Coffee Avinash Mishra Shakti Kapoor Tom Holland Sonu Sood Optical illusion Top Trends Ran Carthon Delhi Election 2025 Trade Rumor Hailee Steinfeld Mohammed Shami Aaron Rodgers Patrick Mahomes Jimmy Butler Sunil Gavaskar BJP Candidates for Delhi Election Roman Reigns Stephen Curry Budget 2025 Dak Prescott HMPV Virus Case Taylor Swift Who is Hussain Sajwani Live Cricket Score Trending Topics Baba Vanga Superfoods For Legs Winter Food Biggest Fruits Director combination in 2025 Brain Exercises Wildlife Safari In 2025 Baby John Box Office Collection Anupam Mittal Janhvi Kapoor Deepika Padukone Chinese New Year 2025 Jim Corbet National Park Maha Kumbh 2025 Shark Tank India 4 NYT Connections Oneplus 13r Elon Musk Living and entertainment ETimes Travel Destinations Cricbuzz.com TV Lifestyle Newspaper Subscription Food News Times Prime Whats Hot Services CouponDunia TechGig TimesJobs Bollywood News Times Mobile Gadgets Work with Us Colombia Latest News Indonesia joins Brics in a boost for Global South on world stage 7.1 quake, 75km from Everest, kills 126 in Tibet Centre estimates GDP growth at 6.4% in FY25 Truckers see Maha Kumbh business surge Royal Rumble 2025: John Cena Path to a Record-Breaking 17th World Title Sparks Fan Frenzy EV sales zoom 20% to nearly 1L units in 2024 on price cuts 'Will consult before data transfer curb': Ashwini Vaishnaw WWE RAW on Netflix: 5 Biggest Questions Answered Microsoft to invest $3 billion in India, boost AI, cloud infra 'Spicy', 'unpleasant' cake kills three in Brazil: Woman charged with triple homicide after poisoning Tata's Punch beats Swift to be top seller WWE Hall Of Famer Slams Triple H Segment: 'It Should Have Stayed Off-Air' Centre has cleared site for Pranab memorial: Sharmistha Mukherjee No info flowing to citizens, all trying to kill RTI Act: SC Delhi elections: Stage and pitch set in 3-way capital contest Florida doctor charged for encouraging minors to 'cut, choke and hang themselves,' leading to 13-year-old's death Zero tolerance for 'disrespectful' remarks against women, says CEC EC nod to February 1 Budget, but with riders on Delhi schemes Copyright © 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service Do Not Sell or Share My Personal Information"
  },
  {
    "url": "https://www.scmp.com/news/china/military/article/3291026/chinas-peoples-liberation-army-working-civilian-rail-authorities-boost-logistics",
    "url_mobile": "https://amp.scmp.com/news/china/military/article/3291026/chinas-peoples-liberation-army-working-civilian-rail-authorities-boost-logistics",
    "title": "China People Liberation Army working with civilian rail authorities to boost logistics",
    "seendate": "20241216T230000Z",
    "socialimage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2024/12/16/a9986e17-758c-491e-af6e-c7f070c2f1de_c0178a0f.jpg?itok=o79w4eAG&v=1734340990",
    "domain": "scmp.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Advertisement China military reform China Military China’s People’s Liberation Army working with civilian rail authorities to boost logistics The joint military-civilian initiative follows a call for better collaboration between the two at a major party meeting in June Reading Time: 2 minutes Why you can trust SCMP 10 Leopold Chen Published: 6:00am, 17 Dec 2024 Updated: 8:36am, 17 Dec 2024 China’s military and railway authorities are working together to streamline military transport and ensure the smooth delivery of military consignments. Advertisement It marks the first major military-civilian joint initiative since a key Communist Party policy meeting in July called for progress in this area. A resolution passed at the meeting, officially known as the third plenum , pledged to “improve military-local contact mechanisms” and “refine military-local standardised work collaboration mechanisms”. Beijing is currently working to modernise the battle readiness and logistics capabilities of the People’s Liberation Army. This month the military disclosed that a joint directive issued by the Central Military Commission, the supreme command body, and China Railway had said: “Both parties should … strive to forge a new era of seamless cooperation between the military and civilian sectors in the realm of transport and logistics.” Advertisement It aims to establish a collaboration mechanism to transport military supplies and looks to incorporate military delivery into performance assessments for the civilian rail authorities. China National Defence News, an outlet owned by the PLA’s official newspaper, recently said that there are already examples of positive military-civilian cooperation on logistics, including an upgrade of a railway line used to transport military equipment to a port. Advertisement Select Voice Choose your listening speed Get through articles 2x faster 1.25 x 250 WPM Slow Average Fast 00:00 00:00 1.25 x"
  },
  {
    "url": "https://www.finanznachrichten.de/nachrichten-2024-12/64008436-comcast-corporation-comcast-nbcuniversal-recognized-as-top-employer-for-veterans-and-military-spouses-200.htm",
    "url_mobile": "",
    "title": "Comcast Corporation : Comcast NBCUniversal Recognized As Top Employer for Veterans and Military Spouses",
    "seendate": "20241205T213000Z",
    "socialimage": "https://www.accesswire.com/imagelibrary/422aa163-a647-4585-b575-ea60b1ffcf19/951038/8a5fab72-4642-4bfb-a8a5-81511a9277fb.jpg",
    "domain": "finanznachrichten.de",
    "language": "English",
    "sourcecountry": "Germany",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Anzeige ❌ Mehr » Ad hoc-Mitteilungen : Mittwoch, 12.11.2025 - Börsentäglich über 12.000 News Nuklear-Deal startet: 80-Mrd.-Dollar-Atomoffensive der USA Anzeige Indizes Kurs % News 24 h / 7 T Aufrufe 7 Tage Aktien Kurs % News 24 h / 7 T Aufrufe 7 Tage Xetra-Orderbuch Fonds Kurs % Devisen Kurs % Rohstoffe Kurs % Themen Kurs % Erweiterte Suche Aktien » Nachrichten » COMCAST AKTIE » Comcast Corporation: Comcast NBCUniversal Recognized As Top Employer for Veterans and Military Spouses Push Mitteilungen COMCAST CORPORATION WKN: 157484 | ISIN: US20030N1019 | Ticker-Symbol: CTP2 Tradegate 11.11.25 | 21:54 23,700 Euro -0,02 % -0,005 Branche Telekom Aktienmarkt NASDAQ-100 S&P 500 S&P 100 1-Jahres-Chart 5-Tage-Chart Realtime Geld Brief Zeit 23,700 23,765 11.11. 23,675 23,750 11.11. Nachrichten Analysen Kurse Chart Xetra-Orderbuch ACCESS Newswire 05.12.2024 22:02 Uhr 423 Leser Artikel bewerten: ( 2 ) Comcast Corporation: Comcast NBCUniversal Recognized As Top Employer for Veterans and Military Spouses NORTHAMPTON, MA / ACCESSWIRE / December 5, 2024 / Comcast Corporation As Comcast NBCUniversal celebrates Veterans Day, they are proud to announce their recognition, for the third consecutive year, as the nation's leading telecommunications company and a top-three overall employer in the Military Times' \"Best for Vets\" rankings. Additionally, they are honored to be named a Top 10 Military Friendly® Spouse Employer for the first time, highlighting their ongoing commitment to supporting military families. \"At Comcast, we recognize that hiring and empowering veterans and military spouses strengthens our company,\" said Mona Dexter, Vice President of Military and Veteran Affairs. Our military-connected employees bring invaluable skills, adaptability, and dedication to their work, and we are proud to be recognized for creating an environment where they can thrive personally and professionally. Mona Dexter Vice President of Military and Veteran Affairs In less than a decade, Comcast NBCUniversal has hired over 21,000 veterans, military spouses, and National Guard and reserve service members, offering them meaningful careers and opportunities for advancement. Their commitment to inclusivity and support is also reflected in their military-ready employee benefits, such as Military Spouse Transfer Assistance and their best-in-class Military Concierge services, which have set a high standard across the industry. Comcast's Veterans Network (VetNet) employee resource group is another great example of how their connection to the military community has influenced their company culture. With over 7,000 members, this group serves as a vital support system for their military-connected teammates, providing opportunities for mentorship, networking, and professional development. VetNet members also engage in several community-driven initiatives each year, including Wreaths Across America and Operation Old Glory. The Military Times Best for Vets: Employers ranking is based on a rigorous, voluntary survey that assesses companies on their policies, practices, and benefits for veterans and their families. Similarly, the Military Friendly® Spouse Employers rating celebrates organizations that excel in supporting military spouses through policies that foster a supportive culture, provide career advancement opportunities, and ensure compliance with military-related regulations. \"Organizations earning the Military Friendly ® Employers designation have wholeheartedly invested in comprehensive and impactful initiatives that bring about positive, life-changing results for our valued service members, dedicated military spouses, and esteemed veterans within their ranks,\" said Kayla Lopez, Sr. Director of Partnerships at Military Friendly ® . \"We salute these exemplary employers who raise the bar and understand that hiring military personnel is not merely an act of goodwill but a testament to a standard that truly embodies sound business wisdom. Their commitment to integrating military personnel into their workforce not only reflects their compassion but also underscores their business acumen.\" In addition to these honors, Comcast NBCUniversal has earned the 2025 Military Friendly ® Supplier Diversity Program Award, Top 10 Military Friendly ® Brand Award, and Top 10 Military Friendly ® Company Award. To learn more about their commitment to the military community, visit military.comcast.com. Jobseekers can explore opportunities at Comcast Careers and NBCUniversal Careers. View additional multimedia and more ESG storytelling from Comcast Corporation on 3blmedia.com. Contact Info: Spokesperson: Comcast Corporation Website: https://www.3blmedia.com/profiles/comcast-corporation Email: info@3blmedia.com SOURCE: Comcast Corporation View the original press release on accesswire.com © 2024 ACCESS Newswire Nachrichten zu COMCAST CORPORATION Zeit Aktuelle Nachrichten Di Basketball-Influencerin kommentiert NBA für Sky Di Sky überrascht: Für Live-Sport brauchen Fans kein Abo mehr Di Sky erhöht sofort die Preise für Pay-per-View via YouTube Di Pay-per-View: Sky bricht mit Abo-Zwang! Sport jetzt auch einzeln auf YouTube buchbar Mo \"Wer stiehlt mir die Show?\": Sky-Expertin im Panel für 2026 Sie erhalten auf FinanzNachrichten.de kostenlose Realtime-Aktienkurse von und . FNRD-2.627.0 Wie bewerten Sie die aktuell angezeigte Seite? sehr gut 1 2 3 4 5 6 schlecht Problem melden Werbehinweise: Die Billigung des Basisprospekts durch die BaFin ist nicht als ihre Befürwortung der angebotenen Wertpapiere zu verstehen. Wir empfehlen Interessenten und potenziellen Anlegern den Basisprospekt und die Endgültigen Bedingungen zu lesen, bevor sie eine Anlageentscheidung treffen, um sich möglichst umfassend zu informieren, insbesondere über die potenziellen Risiken und Chancen des Wertpapiers. Sie sind im Begriff, ein Produkt zu erwerben, das nicht einfach ist und schwer zu verstehen sein kann. DAX Xetra-Orderbuch Ad hoc-Mitteilungen Nachrichten Börsen Aktien-Empfehlungen Branchen Medien Nachrichten-Archiv Presse Datenschutzeinstellungen Mediadaten Impressum | AGB | Disclaimer | Datenschutz RSS-News von FinanzNachrichten.de"
  },
  {
    "url": "https://www.al.com/news/2024/11/veterans-day-2024-places-for-veterans-to-eat-free-monday-cracker-barrel-ihop-olive-garden-more.html",
    "url_mobile": "https://www.al.com/news/2024/11/veterans-day-2024-places-for-veterans-to-eat-free-monday-cracker-barrel-ihop-olive-garden-more.html?outputType=amp",
    "title": "Veterans Day 2024 : Places for veterans to eat free Monday ; Cracker Barrel , IHOP , Olive Garden , more",
    "seendate": "20241111T134500Z",
    "socialimage": "https://www.al.com/resizer/v2/6VCNBOQMPVCERJWNRZ4DXKMESM.jpg?auth=fc1f1f0a06adb66f43a6d98d4652ebd42a56f88f75744dcb1f9e09bf551bde46&quality=90",
    "domain": "al.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Florida, Stuart, Cracker Barrel Old Country Store. (Photo by: Jeffrey Greenberg/Universal Images Group via Getty Images) Universal Images Group via Getty By Leada Gore | lgore@al.com Veterans Day is a time to honor all of those who are serving or have served in the U.S. military. To express thanks, many restaurants and businesses offer special discounts to service members on this day. Most of the discounts require proof of service and not all locations may participate. Here’s a look at the restaurants and retails offering discounts and deals on Nov. 11: Another Broken Egg Café – Veterans and active duty or retired military service members get free Patriot French Toast with strawberries, blueberries and whipped cream and coffee. Dine-in only while supplies last. Applebees – All active duty military, veterans, Reserves and National Guard who dine-in on Nov. 11 can get a free full-size entrée from an exclusive menu. Buffalo Wild Wings – Past and present armed serves members get 10 free boneless wings and fries on Monday. Chicken Salad Chick – Service members in uniform or with valid military ID can get a free Chick Meal and a drink on Monday. Chili’s – Veterans and active military personnel get a free entrée from select menu from Chili’s. Cracker Barrel – Veterans receive a Sunrise Pancake Special all day. Cracker Barrel is also offering 25% off all military products in its store. Dave and Busters – Veterans and active duty military get a free entrée up to $20 and a $10 Power Card or recharge. Denny’s – Active and retired military personnel can get a free Original Grand Slam breakfast from 5 a.m.-noon. Dunkin’ – Active duty and retired military get a free donut. Firehouse Subs - Veterans and active-duty military get a free combo meal with a medium sub, chips or a cookie, and a drink. Hooter’s – All retired and active-duty military with proof of service or military IF can order a drink Monday and get a free meal from Hooters Veterans Day Menu. Huddle House – Retired and active military members can get a free MVP Breakfast Platter at participating locations. IHOP – Veterans and active military can enjoy a free Red, White & Blueberry Pancake Combo from 7 a.m.-7 p.m. Krystal - Customers who show proof of service can get a free breakfast sandwich from select menu. Little Caesar’s - Veterans and active-duty military members can get a free Hot-N-Ready Lunch Combo on Nov. 11 between 11 a.m. — 2 p.m. with proof of service. Logan’s Roadhouse – Veterans can get a free meal from a select menu from 11 a.m.-3 p.m. Mod Pizza - Veterans, active military members and their spouses get a free mega cookie with the purchase of a MOD-sized pizza or salad. Olive Garden – Military members who dine in the restaurant get a free entrée from a special menu. Outback Steakhouse – Active and retired military members and their spouses a free Bloomin’ Onion and beverage with purchase of adult entrée. Red Robin – Active military and veterans get a free Red’s Big Tavern Burger with bottomless side. Smoothie King – Veterans and active military personnel get a free 20-ounce red, white or blue smoothie between noon -3 p.m. Starbucks – Veterans, military service members and military spouses can get a free tall (12 oz.) hot or iced brewed coffee at participating locations. Cafés and drive-thrus only. Texas Roadhouse – Active-duty military, veterans and retired military members can choose between dining-in or receiving a meal voucher from 11 a.m.- 2p.m. Vouchers are used until May 30, 2025. Twin Peaks - All active and retired military personnel get a free lunch from select menu on Monday from 11 a.m. to 3 p.m. Leada Gore Leada Gore has worked with AL.com for 11 years. She’s worked in Alabama journalism for more than 30 years. She now covers breaking and trending news, with a particular emphasis on government, finances and the... more lgore@al.com If you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy."
  },
  {
    "url": "https://nypost.com/shopping/military-discounts/",
    "url_mobile": "",
    "title": "30 Veteran Day 2024 military discounts and sales",
    "seendate": "20241109T121500Z",
    "socialimage": "https://nypost.com/wp-content/uploads/sites/2/2024/11/redwhitebluefeat.jpg?quality=75&strip=all",
    "domain": "nypost.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "New York Post Composite Many brands proudly offer military discounts as a way to honor the dedication and sacrifices of our service members. From everyday essentials to special purchases, these discounts reflect a deep commitment to supporting veterans, active-duty personnel, and their families. Beyond early Black Friday deals , these are special sales to honor the men and women fighting for our freedom. Best Veteran's Day Discounts 25% off at Wrangler 40% off at Reebok Up to 40% off at HP 20% off at Clarks Limited-time offers at Expedia The biggest shopping holiday of the year, Black Friday, is right around the corner, and early deals from Amazon , Best Buy and more have already started dropping. But if you’re a veteran, there’s no reason to wait three more weeks to start saving. When is Veterans’ Day 2025? This year, the holiday is on Tuesday, Nov. 11, so scroll through the offers below ASAP. We’ve put together a list of the best military discounts available in 2025, including savings options on AARP memberships, home improvements, outdoor apparel and more. Check out our list of military discounts below, listed alphabetically. Best Veteran’s Day Sales and Military Discounts AARP At AARP, Veterans Day is every day. All shoppers can enjoy a limited-time deal on an AARP membership for up to 45% off, with 1-year memberships available for as little as $15. adidas Year-round, adidas offers a 30% in-store and online discount to medical professionals, first responders, nurses, military members, and teachers with verification. American Home Shield Moving into a new place this holiday season? For a limited time, veterans can save 20% off the first year of a home warranty at American Home Shield. Asics In appreciation of service members, Asics offers 25% off qualifying full-priced footwear and 30% off qualifying full-priced clothing and accessories, available year-round. Bass Pro Shops Bass Pro Shops’ Legendary Salute discount offers 10% off year-round. Carhartt Need some new work boots? How about a winter sweater? Verify your military ID with Carhartt, and earn 15% off your current order. Champion Cuddle up to savings at Champion. The brand is happy to offer 10% off year-round with the verification of a military ID. Clarks Looking to step into the winter in style? Head to Clarks to claim your 20% military discount, which is available to active duty, retirees, veterans, and family members. Cole Haan More footwear options! Cole Haan is proud to offer a military discount program year-round. Active duty, reservists, national guard, retirees and veterans enjoy 15% off. Dickies Verify your military ID, and earn 20% off at Dickies, also available to students, teachers, and first responders. Available year-round. Expedia For a limited time only, this Veterans Day, Expedia is offering Military Vacation bundle deals, available to peruse at the link above. Hanes All members of the military community, including veterans, can head to Hanes to claim 10% off a one-time purchase at Hanes. Helly Hanson Ski brand Helly Hanson’s application process is a little more stringent than others on this list, but once admitted, military service members and veterans gain access to 35% off purchases through the Helly Hanson Military Discount Program. HexClad Having people over to celebrate the holiday? HexClad is proud to offer a year-round promotion of 10% off your entire purchase with the verification of a military ID. The offer extends to police, firefighters, and EMTs as well. Renewal by Andersen This Veteran’s Day season, Renewal by Andersen is offering as much as $400 off per window installation and $850 off per door installation for Veteran’s Day, in addition to a $300 military discount. Samsung The Home Depot Home Depot salutes military service with their Military Discount and Appreciation Program, offering veterans and their spouses 10% off eligible purchases, available year-round. HP HP’s Frontline Heroes Program offers up to 40% off for military members, healthcare first responders, police, and firefighters. Plus, free shipping and easy returns. Karen Kane Looking to save on luxurious comfort? Head to Karen Kane to claim 20% off every purchase with verification of military ID, available year-round. Lenovo Lenovo’s discount program extends to active-duty military, veterans, first responders, healthcare workers, and seniors and offers 5% off on all products, available year-round. Levi’s In honor of those who’ve served or who are in active duty, head to Levi’s to claim 10% off all apparel, available year-round. Lowe’s Got a DIY project you’d like to finish up this fall? Go to Lowe’s to claim 10% off eligible purchases, plus free Silver Key status with the verification of your military status. It also applies to spouses and is available year-round. Nike Nike offers a 10% discount to all active, reservist, veteran, and retired US military personnel, as well as to the spouses and dependents of active personnel. The North Face In celebration of servicemen and servicewomen, The North Face is proud to offer 20% off to all active, reservist, veteran, and retired U.S. military personnel and to spouses and dependents of active personnel. whenever they shop at the retailer. Puma Doctors, nurses, first responders, and military personnel can head to Puma year-round to claim 20% off their order, available on online purchases only. Reebok One of the biggest military discounts we’ve seen comes from Reebok. The brand offers a 40% military discount, available 365 days a year. Also available to first responders. Active duty military, veterans, and their families can claim up to 30% off phones, tablets, smart watches and more year-round at Samsung. Timberland Timberland is proud to offer 10% off select styles online with valid credentials. Available year-round for active military, veterans, reservists, spouses, and dependents. Verizon Verify your military status to save big on Verizon phone and internet plans and even bigger on bundles. Take 15% off most monthly wireless plans and accessories, along with up to $25 off per month for accounts with 2-3 lines, and $20 off per month for 4-plus years. Wrangler Wrangle up military savings of 25% off after verification of military service at Wrangler, available year-round for active military, Veterans, spouses, and immediate family members. Why Trust Post Wanted by the New York Post For over 200 years, the New York Post has been America’s go-to source for bold news, engaging stories, in-depth reporting, and now, insightful shopping guidance . We’re not just thorough reporters – we sift through mountains of information, test and compare products , and consult experts on any topics we aren’t already schooled specialists in to deliver useful, realistic product recommendations based on our extensive and hands-on analysis. Here at The Post, we’re known for being brutally honest – we clearly label partnership content, and whether we receive anything from affiliate links, so you always know where we stand. We routinely update content to reflect current research and expert advice, provide context (and wit) and ensure our links work. Please note that deals can expire, and all prices are subject to change. Looking for a headline-worthy haul? Keep shopping Post Wanted ."
  },
  {
    "url": "https://www.yahoo.com/news/fewer-military-ballots-mailed-overseas-210221986.html",
    "url_mobile": "",
    "title": "Fewer Military Ballots Mailed from Overseas Ahead of 2024 Election Compared to 2020",
    "seendate": "20241108T220000Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/Je7shVN2SoIt72uwb6Qjcw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/military_com_347/8ff7708030c8a0cc9457573fa9ddffaa",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways About 20,000 fewer military ballots were cast by mail from overseas in the weeks leading up to this year's election than in 2020, according to data obtained by Military.com. By the week before Tuesday's election, 36,898 overseas military ballots had been mailed in, as tracked by a mailing label unique to military ballots, compared to the 57,049 that were cast in the same time frame in 2020. While representing only partial data on the total number of military voters this year, the number for ballots mailed from overseas in the weeks prior to the election provides a snapshot of participation by service members and their families in a year in which military ballots became a political football ahead of Election Day. Advertisement Advertisement Advertisement Advertisement Read Next: Air Force Removes Commander Who Oversaw Nuclear Missile Maintenance at Montana Base Complete numbers on 2024's military voters, including how they were distributed geographically, won't be available until states submit data to federal authorities after the states are done counting every vote. But postal agencies are able to track military ballots sent in from overseas using what's called the Label 11-DOD, which was created to provide military voters an expedited way to mail in their ballots. Depending on the state, military voters can also submit their ballots by email, fax or other electronic means but, historically, mailing is the most common way service members send their ballots back. For example, in 2020, about 76.4% of service members who voted absentee submitted their ballots by mail, according to the Election Assistance Commission's post-2020 election report. Advertisement Advertisement Advertisement Advertisement In total in 2020, about 330,000 uniformed service members voted by absentee ballot, according to the commission. In addition to being lower than in 2020, the number of mailed overseas military ballots cast ahead of this year's election also dropped off from 2016. That year, there were 49,413 overseas military ballots mailed with the Label 11-DOD tracking label in the weeks leading up to the election. The data on military ballots mailed from overseas for this year, 2020 and 2016 was obtained by Military.com from a source who requested anonymity to disclose information on a politically sensitive topic. This year's number is a big increase from the 2022 congressional elections , but it is common for voter turnout in presidential election years to eclipse midterm elections. Advertisement Advertisement Advertisement Advertisement The data on this year's election comes as feared post-election challenges of ballots cast by service members, their families and other U.S. citizens overseas did not materialize after former President Donald Trump secured a relatively quick victory to return to the White House. Prior to the election, Republicans in Pennsylvania, North Carolina and Michigan -- all key swing states -- sued to stop military and overseas ballots from being counted as part of a broader effort to lay the groundwork to challenge the election results if Trump lost. All three lawsuits were dismissed by judges . But military family advocates had warned that just the act of filing the lawsuits could have a chilling effect on military voter turnout this year since it could discourage service members and their families from voting if they thought their votes wouldn't count. \"We know that when there is a lack of confidence in voting, there is less likelihood to vote,\" Khiet Ho, a Marine Corps spouse who is the lead researcher at Secure Families Initiative, a military families organization that in part works to expand military voting, told Military.com in October. \"And so these lawsuits in effect are going to decrease even more military service members and military family members from voting.\" Advertisement Advertisement Advertisement Advertisement While Trump's win in the presidential race was called by The Associated Press the morning after the election, several congressional races were still too close to call on Friday, including more than a dozen involving veterans . Absentee ballots, including those cast by military voters, are often among the last counted, meaning those votes could be decisive in the remaining uncalled races. Related: 15 Congressional Races Involving Veterans Remain Uncalled About Our Ads"
  },
  {
    "url": "https://tcrcountry.iheart.com/featured/dave-jenn/content/2024-11-05-veterans-day-deals/",
    "url_mobile": "",
    "title": "Veteran Day Deals | 103 . 3 TCR Country",
    "seendate": "20241108T191500Z",
    "socialimage": "https://i.iheart.com/v3/re/assets.getty/62bbbebcb4a70c1a7bf6c1bf?ops=gravity(%22north%22),fit(1200,675),quality(65)",
    "domain": "tcrcountry.iheart.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Remember to bring your military ID! Applebee's: veterans and active-duty military personnel receive a FREE meal from a select menu on November 11th (dine-in only) Bob Evans: veterans and active-duty military personnel receive a FREE meal from a select menu on November 11th (dine-in only) Buffalo Wild Wings: veterans and active-duty military personnel receive a FREE 10 piece boneless wings and fries November 11th (dine-in only) Cheddar's Scratch Kitchen: veterans and active-duty military personnel receive a FREE appetizer or dessert on November 11th (dine-in only) Chili's: veterans and active-duty military personnel receive a FREE meal from a select menu on November 11th (dine-in only) Dave & Buster's: veterans receive a FREE entrée (up to $20) AND a $10 Power Card on November 11th (dine-in only) Denny's: veterans and active-duty military personnel receive a FREE Original Grand Slam on November 11th from 5 am to 12 pm (dine-in only) Dunkin': veterans and active-duty military personnel receive a FREE donut November 11th (dine-in only) Fazoli's: veterans and active-duty military personnel receive a FREE spaghetti with marinara or meat sauce on November 11th (dine-in and online use code Vet24) Golden Corral: hosting their Military Appreciation Night November 11th from 5pm to close; veterans and active-duty military personnel receive a FREE \"thank you\" meal (dine-in only) IHOP: veterans and active-duty military personnel receive a FREE red, white, and blueberry pancake combo on November 11th from 7a-7p (dine-in only) Little Caesar's: veterans and active-duty military personnel receive a FREE lunch combo on November 11th from 11a-2p (dine-in only) Logan's Roadhouse: veterans and active-duty military personnel receive a FREE meal from a select menu on November 11th from 11a-3p (dine-in only) Longhorn Steakhouse: veterans and active-duty military personnel receive 10% off their meal and a FREE appetizer or dessert on November 10th & 11th (dine-in only) Olive Garden: veterans and active-duty military personnel receive a FREE meal from a select menu on November 11th (dine-in only) Outback Steakhouse: veterans and active-duty military personnel receive a FREE Bloomin' Onion and beverage with the purchase of an adult entrée on November 11th (dine-in only) Qdoba: veterans and active-duty military personnel receive 50% off any full-size entrée on November 11th (dine-in only) Red Lobster: veterans and active-duty military personnel along with reservists receive a FREE Shrimp & Chip meal on November 11th (dine-in only) Sonic: veterans and active-duty military personnel receive 50% off shakes of any size and flavor on November 11th (dine-in only) Starbucks: veterans and active-duty military personnel receive a FREE tall brewed coffee (hot or iced) on November 11th (dine-in only). Jenn wants to thank her brother Charlie for fighting for our country! Happy Veteran's Day!"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/military-friendly-announces-employer-memberships-302299984.html",
    "url_mobile": "",
    "title": "Military Friendly Announces Employer Memberships",
    "seendate": "20241108T160000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "PITTSBURGH , Nov. 8, 2024 /PRNewswire/ -- Viqtory has announced the launch of its Military Friendly® Employer Memberships at www.militaryfriendly.com . The creation of Memberships come at the behest of employers who have long sought access to a more strategic approach to tapping talent from the military community. Continue Reading \"Since 2003, Military Friendly® has been the gold standard in collecting data on and rating Military Friendly Employers. With Memberships, we're now able to offer employers unique tools that help them promote their career opportunities to members of the military community,\" said Viqtory CEO Chris Hale . Trust, Training and Talent are the three primary benefits of Employer Membership. Trust is anchored in a vetting process that ensures Military Friendly® Employer Members pledge to a program to recruit, retain and advance members of the military community as employees in their companies. \"The training blogs, webinars, tools and data insights provide employers with leading best practices on how to recruit, retain and advance veterans and military spouses. This is essential to really connect with this valuable labor pool of 12 million people ,\" said Kayla Lopez , VP of Memberships. Talent gives Members access to a military community-centric job board on www.militaryfriendly.com to post jobs, search resumes and promote their employer profile and vetted status in a more exclusive way. \"The labor shortage in this country is not a short-term problem. It's generational. Leading employers are committing as many resources to recruiting talent as they are to recruiting customers. Military Friendly Employer Members will be able to separate themselves from the millions of other employers who are competing for that talent,\" said Hale. The Employer launch, which starts today on the eve of Veterans Day weekend, enables Employer Members to populate their employer profiles and job postings in advance of the public launch on December 12. The public launch will be held on the weekend of the annual Army-Navy football game to honor this historic moment. Employers who become Members before the public launch on December 12 will be honored with their founder status in G.I. Jobs magazine. Military Friendly® Employer Memberships range from $19 to $997 monthly and are right-priced based on the size of the company. Veteran-owned businesses are given a 25% discount and will also be able to tout their status through a filter that allows military job seekers to find them. A portion of the proceeds benefits military and veteran non-profit organizations. Military Friendly® Memberships come seven months following a major expansion in its Military Friendly Employer ratings About Military Friendly® Military Friendly® provides positive reinforcement for American organizations to invest in programs that improve the lives of veterans. Military Friendly® is a registered trademark of and is owned and operated by Viqtory, a veteran-owned business. Military Friendly® is not affiliated with or endorsed by the U.S. Department of Defense or the federal government. Military Friendly® lists and methodology can be found at www.militaryfriendly.com . SOURCE Military Friendly 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.fox4news.com/news/veterans-day-2024-restaurant-deals",
    "url_mobile": "https://www.fox4news.com/news/veterans-day-2024-restaurant-deals.amp",
    "title": "Veterans Day deals and freebies",
    "seendate": "20241108T060000Z",
    "socialimage": "https://images.foxtv.com/static.livenowfox.com/www.livenowfox.com/content/uploads/2024/11/1280/720/gettyimages-132284564.jpg?ve=1&tl=1",
    "domain": "fox4news.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "U.S.VETS helps homeless veterans like Babs Ludikhuize Join U.S.VETS client and U.S. Air Force veteran Babs Ludikhuize this and every Veterans Day when you Make Camo Your Cause to #HONORUSVETS. Help veterans like Babs find a place to call home at U.S.VETS. The Brief Veterans Day 2024 brings free meals and discounts for veterans and active-duty military. Offers are available at popular spots like Applebee’s, Buffalo Wild Wings, and Starbucks. Most deals require proof of military service, so remember to bring your ID. LOS ANGELES - This Veterans Day, restaurants nationwide are offering free meals, discounts, and special promotions to honor veterans and active-duty military. On November 11, service members can enjoy complimentary meals and beverages at participating locations. Here’s a guide to some of the best deals, helping veterans and their families celebrate the day. Veterans Day Free Meals Many restaurants are offering free meals or beverages to veterans and active-duty military members on Veterans Day. Here’s a selection of notable deals: Applebee's – Veterans and active-duty military receive a free meal from a select menu at participating locations. Dine-in only. Buffalo Wild Wings – Veterans and active-duty service members can enjoy 10 free boneless wings and fries. This offer is available for dine-in or walk-in orders at Buffalo Wild Wings GO locations. Denny's – From 5 a.m. to 12 p.m. on November 11, veterans and active-duty military members can enjoy a free Original Grand Slam breakfast. Military ID or DD214 required. Dunkin' – Active and retired military members are offered a free donut on November 11. This offer is available in-store only, while supplies last. IHOP – Veterans and active-duty military can receive a free Red, White, and Blueberry Pancake Combo from 7 a.m. to 7 p.m. at participating locations. Dine-in only. Olive Garden – Veterans and active-duty military members are invited to enjoy a complimentary entrée from a special menu when dining in on November 11. Starbucks – Starbucks is honoring veterans, military members, and their spouses with a free tall brewed coffee (hot or iced) at participating locations. Texas Roadhouse – Between 11 a.m. and 2 p.m. on November 11, Texas Roadhouse is offering free meal vouchers to veterans and active-duty military for dine-in or takeout, redeemable until May 30, 2025. Veterans Day Restaurant Discounts In addition to free meals, several restaurants are providing discounts to veterans and active-duty military members: Brick House Tavern + Tap – Veterans can enjoy 20% off their meal for dine-in on November 11 from 11 a.m. to 3 p.m., valid for parties of up to four with a military ID. LongHorn Steakhouse – Veterans and active-duty military receive 10% off their meal, along with a free appetizer or dessert, on November 10 and 11 for dine-in and call-in orders only. SONIC Drive-In – Half-price shakes of any size and flavor are available on November 11 at participating locations. TooJay’s Deli – Veterans and active-duty military enjoy 25% off their entire bill on Veterans Day with proof of service. Available for dine-in and takeout. Veggie Grill – On November 11, veterans, active-duty military, and their families can receive 20% off their meal in-store only. Tips for Making the Most of Veterans Day Dining Deals To maximize these offers, veterans and active-duty military members should remember the following: Bring Military ID : Proof of service is typically required to redeem offers, so make sure to bring a military ID, VA card, or other documentation. Check Participation : Some offers are available only at participating locations, so call ahead or check online to ensure the location near you is honoring the deal. Verify Offer Times : Most promotions are available on November 11, but times vary, and some restaurants have specific hours for their offers. The Source This information is based on details from Military.com’s 2024 Veterans Day restaurant discount list and includes updates on new offers for veterans and active-duty military members. Military Veterans Issues Holidays Consumer News"
  },
  {
    "url": "https://www.newsnow.co.uk/h/World+News/War+and+Terrorism/Military+(World)",
    "url_mobile": "",
    "title": "World Military News | Latest News",
    "seendate": "20241108T021500Z",
    "socialimage": "",
    "domain": "newsnow.co.uk",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Russia says Ukrainian-British plot to hijack hypersonic missile foiled Al Jazeera 15h Al Jazeera 15h"
  },
  {
    "url": "https://www.breitbart.com/politics/2024/11/05/south-korea-sells-itself-best-partner-saudi-arabia-defense/",
    "url_mobile": "https://www.breitbart.com/asia/2024/11/05/south-korea-sells-itself-best-partner-saudi-arabia-defense/amp/",
    "title": "South Korea Sells Itself as the  Best Partner  for Saudi Arabia on Defense",
    "seendate": "20241106T033000Z",
    "socialimage": "https://media.breitbart.com/media/2024/11/GettyImages-1409808429-640x335.jpg",
    "domain": "breitbart.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "South Korean President Yoon Suk-yeol told a senior Saudi official in Seoul on Tuesday that his country is potentially a “best partner” to cooperate on a variety of issues of mutual interest, most prominently defense development and technology. Yoon has prioritized the bilateral relationship with Saudi Arabia since taking office in 2022, focusing particularly on selling Riyadh South Korean weapons and defense gear. Yoon became the first South Korean president to visit Saudi Arabia in 2023, cutting deals to both sell Korean technology and jointly develop new defense materials. Yoon met with the head of the Saudi National Guard, Abdullah bin Bandar Al Saud, in the South Korean presidential office in Seoul on Tuesday, the South Korean news agency Yonhap reported . The Korean government put on a show for Abdullah before the meeting, organizing a display of novel weapons systems, an honor guard event, and what Yonhap referred to as an “integrated firepower drill.” “The defense collaboration between the two countries would not only strengthen Saudi Arabia’s defense capabilities but deepen bilateral ties,” Yoon was quoted as saying during his meeting with the Saudi official, describing South Korea as Saudi Arabia’s “best partner.” The South Korean Defense Ministry separately published photos of meetings between Abdullah and Defense Minister Kim Yong-hyun, who celebrated the two countries as “future strategic companions” and noted that Saudi Arabia is South Korea’s largest Mideast trade partner. Kim emphasized Yoon’s message of South Korea as a “best partner” to Saudi Arabia, particularly on military matters. “Minister Kim Yong-hyun mentions that the Saudi Ministry of Defense and the Korean Defense Ministry are currently working together to introduce ground equipment,” the Defense Ministry noted, “and the Republic of Korea is the best partner for joint cooperation, such as joint research and development.” The branding of South Korea as a “top” partner for Saudi Arabia is a unique feature of Yoon’s presidency designed to capitalize on the rift between Riyadh and the United States under outgoing President Joe Biden. Biden – who promised to turn Saudi Arabia, a longtime U.S. partner, into a “pariah” while campaigning for the presidency – cut off sales of offensive weapons to the country in 2021, leaving a significant void in the country’s defense demands. “The defense industry is emerging as a blue ocean in our cooperation with Saudi Arabia,” Kim, then serving as Yoon’s national security adviser, said during Yoon’s trip to Saudi Arabia in 2023. “Large-scale defense industry cooperation discussions are in the final stage, in various areas such as antiaircraft defense systems and firearms.” During that visit, Yoon described South Korea as an “optimal partner” for the Saudis not just in defense, but in the “post-oil era” generally, including in developing Crown Prince Mohammed bin Salman’s “Vision 2030” strategy. “Vision 2030” is a holistic plan to diversify the Saudi economy away from oil that includes massive urban development, including the construction of the entirely new “green” city of Neom. South Korean companies have gotten in on the ground floor of Neom development, including major global corporations such as Hyundai. Mohammad bin Salman, the de facto leader of the country, agreed with Yoon’s assessment of his country as a viable collaborator. While Yoon emphasized cooperation outside of the fossil fuel industry, in December 2023, the publication Energy Intelligence reported a dramatic surge of South Korean purchases of Saudi crude oil in the months following Yoon’s visit to the country. By February, the two countries were openly announcing defense deals, including a memorandum of understanding on jointly developing weapons technology. “South Korea’s Defense Acquisition Program Administration (DAPA) and Saudi defense ministry signed a memorandum of understanding (MOU) to pave the way for cooperation in the defense industry and joint weapons development,” Yonhap reported at the time. “Under the MOU, the two sides will launch a bilateral committee to jointly conduct research and development of weapons systems for continued cooperation in the defense industry, DAPA said.” The Saudi government also purchased South Korea’s Cheongung M-SAM II surface-to-air missile system that month, worth $3.2 billion and an increasingly popular option for Middle East nations. The United Arab Emirates (UAE) purchased the Cheongung II system from South Korea in January 2022 for $3.5 billion. Follow Frances Martel on Facebook and Twitter."
  },
  {
    "url": "https://www.jpost.com/israel-news/article-827659",
    "url_mobile": "https://m.jpost.com/israel-news/article-827659",
    "title": "The cost of Israel defense burden - Israel News - The Jerusalem Post",
    "seendate": "20241105T140000Z",
    "socialimage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/586923",
    "domain": "jpost.com",
    "language": "English",
    "sourcecountry": "Israel",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Second only to Ukraine: The cost of Israel's defense burden Experts warn of economic impact as Israel’s defense budget reaches 6.5% of GDP. Israeli prime minister Benjamin Netanyahu and Israeli Minister of Defense Yoav Galant attend vote on the state budget at the assembly hall of the Knesset, the Israeli parliament in Jerusalem, March 13, 2024. ( photo credit : YONATAN SINDEL/FLASH90 )"
  },
  {
    "url": "https://www.samaa.tv/2087323416-students-experience-military-life-during-bahawalpur-garrison-visit",
    "url_mobile": "",
    "title": "Bahawalpur Students Visit Military Garrison : A Day of Military Training and Operational Demonstrations",
    "seendate": "20241103T121500Z",
    "socialimage": "https://www.samaa.tv/images/students-visit-3.jpg",
    "domain": "samaa.tv",
    "language": "English",
    "sourcecountry": "Pakistan",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Samaa Web Desk Nov 03, 2024 Photo: File Stay Connected, Stay Informed - Follow SamaaTV on Whatsapp for Real-time Updates! Click to play the content 0:00 / 0:00 Students and faculty members from various educational institutions of Bahawalpur participated in a comprehensive one-day visit to the Bahawalpur Garrison, experiencing firsthand insights into military operations and training. The delegation received detailed briefings about the Pakistan Army's role in national defense and their operational readiness. Military officials demonstrated various tactical operations, including an assault course demonstration and tank maintenance procedures. Visitors were given practical exposure to military equipment, including tours of armored vehicles and tanks. The demonstration included mobile ramp construction and various maintenance activities, providing students with a thorough understanding of military operations. The program, aimed at strengthening civil-military relations, allowed participants to observe daily military routines and operational procedures. Students expressed appreciation for the military's professional training standards and operational capabilities. Bahawalpur Garrison Pakistan Army student military visit"
  },
  {
    "url": "https://www.ynetnews.com/article/s1pu5phgkx",
    "url_mobile": "",
    "title": "Israel inks $500 million defense deal for expanded laser interception systems",
    "seendate": "20241028T101500Z",
    "socialimage": "https://ynet-pic1.yit.co.il/picserver5/crop_images/2022/04/14/BkXKeALrVc/BkXKeALrVc_0_160_3000_1689_0_large.jpg",
    "domain": "ynetnews.com",
    "language": "English",
    "sourcecountry": "Israel",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Updates Red Mail 22° Tel Aviv-Jaffa Search Main Israel News Mideast & World News Tech & Digital Real Estate Finance Lifestyle Health & Science Jewish World Travel More Channels Opinions Magazine Sports Food Weather Podcasts Sites & Sources Ynet Calcalist yad2 ynetespanol Вести mynet Contact Contact us Privacy Policy Terms of Use Accessibility Statement Israel inks $500 million defense deal for expanded laser interception systems 'This deal heralds a new era—the era of laser defense,' Defense Ministry says after signing massive deal; first operational deployment of ground-based laser system expected next year Yoav Zitun | Add a comment Print Find an error? Report us Related Topics Laser Defense Ministry Iron Beam The Defense Ministry announced Monday a major deal worth approximately NIS 2 billion (around $500 million) to boost its acquisition of advanced Iron Beam laser interception systems. Defense Ministry Director-General Maj. Gen. (Res.) Eyal Zamir, who signed the agreement Sunday, said, “This deal heralds a new era—the era of laser defense,” adding that the first operational capability of the ground-based laser system is expected to be deployed within the next year. US President Joe Biden visits the Defense Ministry's multi-tiered defense compound and inspects the Iron Beam laser defense system ( Video: GPO ) The multi-billion-shekel agreement, reached between the Directorate of Defense Research and Development (DDR&D) and primary contractors Rafael Advanced Defense Systems and Elbit Systems, marks a significant increase in production pace to ensure timely, high-volume delivery of laser units. The Iron Beam system, designed to intercept various aerial threats such as rockets, mortar shells, drones and cruise missiles, has demonstrated its capabilities in recent trials and is set to join Israel’s multi-tiered defense network as a cost-effective addition to the Iron Dome. “Since the outbreak of the war, the Defense Ministry has signed hundreds of procurement orders worth billions to bolster Israeli-manufactured defense capabilities and ensure Israel’s self-reliance,” said Zamir. 2 View gallery The Iron Beam laser defense system ( Photo: Defense Ministry ) The ministry’s statement noted that the integration of Iron Beam will significantly enhance Israel's defensive capacity against current and future threats at a fraction of conventional interception costs. 'Global superiority' \"The Iron Beam is yet another testament to the professionalism, creativity and innovative prowess of our defense industries, supported by partnerships between defense companies and startups,\" DDR&D head Brig. Gen. (res.) Dr. Danny Gold said. He noted that Israel's capability to develop and deploy advanced laser interception technology on the battlefield is a reflection of both technical mastery and effective project management. 2 View gallery The Iron Beam laser defense system ( Photo: Defense Ministry ) Rafael CEO Yoav Turgeman highlighted that after years of research, the Iron Beam laser system—the first of its kind worldwide—is set for deployment. \"Rafael is proud to lead the development of this high-powered, versatile laser interception system. Following a series of rigorous tests, the Iron Beam will soon reach operational maturity,\" Turgeman said. Elbit President and CEO Bezhalel Machlis (Butzi) Machlis called the development \"a significant leap forward in defense against diverse threats.\" Elbit, known as Israel's \"laser powerhouse,\" collaborated closely on Iron Beam’s development. \"Our teams at Elbit have played a critical role in advancing this groundbreaking defense capability, which we believe will set a new standard in strategic defense for Israel,\" Machlis said. Get the Ynetnews app on your smartphone: Google Play : https://bit.ly/4eJ37pE Apple App Store : https://bit.ly/3ZL7iNv << Follow Ynetnews on Facebook | Twitter | Instagram >> Comments New comment The commenter agrees to the privacy policy of Ynet News and agrees not to submit comments that violate the terms of use , including incitement, libel and expressions that exceed the accepted norms of freedom of speech. send comment \" \""
  },
  {
    "url": "https://www.philstar.com/headlines/2024/10/09/2391203/marcos-signs-law-revitalizing-self-reliant-defense-posture-program",
    "url_mobile": "https://www.philstar.com/headlines/2024/10/09/2391203/marcos-signs-law-revitalizing-self-reliant-defense-posture-program/amp/",
    "title": "Marcos signs law revitalizing Self - Reliant Defense Posture program",
    "seendate": "20241008T164500Z",
    "socialimage": "https://media.philstar.com/photos/2024/10/08/4_2024-10-08_22-12-50.jpg",
    "domain": "philstar.com",
    "language": "English",
    "sourcecountry": "Philippines",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Philstar.com HOME Headlines Opinion Nation World Business Sports Entertainment Lifestyle Other Sections The Philippine Star Pilipino Star Ngayon HOME Bansa Metro Probinsiya Opinyon Palaro Showbiz True Confessions Dr. Love Litra-talk Kutob Komiks The Freeman HOME Cebu News Opinion Metro Cebu Region Cebu Business Cebu Sports Cebu Lifestyle Cebu Entertainment Pang-Masa HOME Police Metro Punto Mo Pang Movies PM Sports Para Manalo Para Malibang Banat HOME Balita Opinyon Kalingawan Showbiz Palaro Imong Kapalaran Punsoy Interaksyon HOME Trends + Spotlights Politics + Issues Celebrities Hobbies + Interests Rumor Cop Coupons HOME Top Stores Offers By Category Latest Posts CORRUPTION SCANDAL MONSOON SEASON DUTERTE ICC TRIAL INFLUENCE OPERATIONS EXPLAINERS FACT CHECKS CLIMATE AND ENVIRONMENT VIDEOS NEWS COMMENTARIES SUPPORT PHILSTAR About Us | Contact Us | Advertise | Privacy Policy | Member Agreement | Copyright Notice Copyright © 2025. Philstar Global Corp. All Rights Reserved My Profile Sign Out Subscribe Subscribe HOME HEADLINES OPINION NATION WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE COUPONS OTHER SECTIONS X CORRUPTION SCANDAL MONSOON SEASON DUTERTE ICC TRIAL INFLUENCE OPERATIONS EXPLAINERS FACT CHECKS CLIMATE AND ENVIRONMENT VIDEOS NEWS COMMENTARIES Headlines Marcos signs law revitalizing Self-Reliant Defense Posture program Michael Punongbayan , Alexis Romero - The Philippine Star October 9, 2024 | 12:00am President Marcos signs the Self-Reliant Defense Posture Revitalization Act at Malacañang yesterday. With him are Senate President Francis Escudero; Speaker Martin Romualdez; Senators Miguel Zubiri, Jinggoy Estrada, Win Gatchalian and Imee Marcos; Defense Secretary Gilbert Teodoro; Iloilo 5th District Rep. Raul Tupas and Ilocos Norte 1st District Rep. Sandro Marcos. STAR / File MANILA, Philippines — President Marcos yesterday signed a law that seeks to strengthen the Philippines’ self-reliant defense posture and to develop the local defense industry, a measure that he said would support the country’s needs in the face of volatilities and evolving threats. The Self-Reliant Defense Posture (SRDP) Revitalization Act or Republic Act 12024 aims to promote and spur the growth of an independent national defense through a program that will develop the Philippines’ national defense capabilities. The program involves the development of a local defense industry through partnerships between the government and private manufacturers to achieve domestic production capability for weapons and other defense materiel for the military. It is designed to support policies, research, maintenance and installments while crafting strategies to boost production competitiveness and actively lobbying for more effective defense policies. “With the signing of the Self-Reliant Defense Posture Revitalization Act, we are anchoring our defense strategy firmly in the strength of our own resources and capabilities,” Marcos said during the signing ceremony at Malacañang. The President said the Philippines’ defense capabilities have relied upon what it could acquire from abroad for decades. He pointed out that every purchase, negotiation and partnership was a reminder that the country’s strength depended on the supply chains and interests of other parties. According to him, the self-reliant defense posture program, which was implemented under his father, the late president Ferdinand Marcos Sr., was a call to tap into the country’s own resources and capabilities. Marcos said the program successfully met the basic materiel requirements of the military in the early years as the country was able to manufacture ammunition, mobility equipment and tactical communication sets; produce vehicles from jeeps to boats and supply the armed forces’ clothing requirements. AFP, DND laud law Both the Department of National Defense (DND) and the Armed Forces of the Philippines (AFP) lauded and welcomed yesterday the signing into law of the SRDP Revitalization Act. DND spokesman Arsenio Andolong said that the revitalization of the country’s SRDP Program aims to develop and establish an independent and dynamic defense system that relies on the country’s own capabilities and resources to support the weapon and materiel requirements of the AFP and other law enforcement agencies. “The SRDP law represents a structured and innovative approach to defense development, focusing on enhancing the Philippines’ research and production capabilities. It aligns closely with the country’s strategic objectives, ensuring that defense systems are not only modernized but also tailored to meet dynamic security landscape,” added AFP public affairs office chief Col. Xerxes Trinidad. Sen. Juan Miguel Zubiri, principal author and co-sponsor of the SRDP Act, yesterday expressed his confidence that the new law would fortify the country’s defense capabilities while reducing its reliance on foreign suppliers. “This will be a great boon both for our defense forces and for our economy. It lays the foundation for a strong, self-reliant defense industry. We can now start manufacturing our own defense equipment instead of merely buying from other nations,” Zubiri said. He highlighted the necessity of building a self-reliant defense system, especially in light of potential geopolitical challenges that could disrupt the supply of military equipment. “What if there’s a war, if there’s a breakdown and suddenly we can’t buy from them anymore? How can we defend ourselves?” Zubiri pointed out. “We need to build our own, to arm our own.” “We have great Filipino minds, skilled professionals who can drive the growth of our local defense sector,” he concluded. — Cecille Suerte Felipe FERDINAND MARCOS JR. BrandSpace Articles 50 winners of P50,000? Thatâ€™s a Shakeyâ€™s Supercard kind of holiday! Ever considered a hybrid crossover? The Toyota Yaris Cross HEV is the ideal mobility partner #SoMuchKBeauty â€“ Upgrade your skincare routine with SM Beauty Maibarara wins PEMCâ€™s most compliant geothermal power plant award Holiday upgrade? Kaya â€˜Yan for as low as P20 per day with Home Credit Landmark for sustainable living in the Philippines: Mariposa Mews unveils LEED for Homes Gold Certification Plaque PMAP honors SM Supermalls for people leadership and purpose-driven culture Our Market launches OMG!: Campus tour with a chocolate-making class at De La Salle College of Saint Benilde SM J Mall illuminates the holidays with 'The Heart of Hikari' PSA: Enjoy huge deals, promos for your health and beauty needs at the last Watsons nationwide sale of the year! < > Latest Trending Trending Latest Trending abtest abtest Cebu floods spark reckoning over hillside projects, poor oversight By Dominique Nicole Flores | 1 day ago The DENR’s probe into Cebu’s Monterrazas de Cebu project has spotlighted flaws in land-use planning and flood... Headlines How can ICC arrest Bato? Lawyers break it down By Ian Laqui | 2 days ago Following the revelation that the International Criminal Court has issued a warrant of arrest against Sen. Ronald \"Bato\"... Headlines 5 areas under Signal No. 5 as Super Typhoon Uwan rages By Ian Laqui | 2 days ago As of 11 a.m., PAGASA said that Uwan's eye was located over the coastal waters of Pandan, Catanduanes, moving west-northwestward... Headlines Philippines evacuates hundreds of thousands as 'Uwan' nears 2 days ago Nearly a million people have been evacuated and floodwaters were rising in the Philippines on Sunday before Super Typhoon... Headlines 8 areas now under Signal No. 5 as 'Uwan' moves over Camarines Norte By Ian Laqui | 2 days ago Eight areas have been placed under Signal No. 5 in the eastern portion of the country as Super Typhoon Uwan (international... Headlines Latest More in Headlines Uwan leaves 25 dead, two missing WFP activates anticipatory cash aid Readers donate to Damayan for â€˜Bangon Sugboâ€™ drive Power restored to 60% of areas hit by typhoon abtest Third-party monitoring of government bidding sought By Louella Desiderio | 11 hours ago The Makati Business Club is pushing for third-party monitoring in the bidding for government projects to promote transparency... Headlines Palace: AFP looking into destabilization attempts By Bella Cariaso | 11 hours ago The Armed Forces of the Philippines is investigating alleged attempts to destabilize the Marcos administration, following... Headlines ICC urged to replace expert tapped to examine Duterte By Janvic Mateo | 11 hours ago Both the defense and the prosecution are urging pre-trial judges of the International Criminal Court to replace the second... Headlines DOJ: Philippines must comply with ICC warrant for Bato By Daphne Galvez | 11 hours ago The Philippine government must comply once the International Criminal Court issues an arrest warrant against Sen. Ronald... Headlines Probe sought of Marcoleta’s SOCE By Mayen Jaymalin | 11 hours ago Election watchdog Kontra Daya wants the Senate and the Commission on Elections to investigate Sen. Rodante Marcoleta... Headlines Recommended 17 congressmen invited to Blue Ribbon hearing 11 hours ago Regaining his chairmanship of the Blue Ribbon committee, Senate President Pro Tempore Panfilo Lacson is inviting members of... Headlines FLOOD CONTROL PANFILO LACSON EDITORIAL — Flood projects still needed 11 hours ago The devastation from the apocalyptic deluge unleashed by Typhoon Tino, while highlighting the failure of flood control projects,... Headlines CEBU NEGROS ISLAND TYPHOON Corruption’s fallout November 12, 2025 - 12:00am It’s mid-November, and expectations are rising about cases being filed in court related to corruption in flood control and other infrastructure projects. Headlines CORRUPTION FLOOD CONTROL The bigger crime and the proponents November 12, 2025 - 12:00am No matter how long the march, marriage or death, it all begins and ends in church. Headlines DPWH Ex-DPWH chief Bonoan leaves Philippines amid flood project probe 14 hours ago Bureau of Immigration Spokesperson Dana Sandoval confirmed to Philstar.com about Bonoan’s departure, saying he is covered... Headlines CORRUPTION DEPARTMENT OF PUBLIC WORKS AND HIGHWAYS DPWH next Recommended 17 congressmen invited to Blue Ribbon hearing Regaining his chairmanship of the Blue Ribbon committee, Senate President Pro Tempore Panfilo Lacson is inviting members of the House of Representatives implicated in the flood control corruption scandal to attend the next hearing on the issue. 11 hours ago FLOOD CONTROL PANFILO LACSON EDITORIAL — Flood projects still needed The devastation from the apocalyptic deluge unleashed by Typhoon Tino, while highlighting the failure of flood control projects, also emphasized the need to quickly put proper interventions in place, not just in Cebu and Negros Island but all over the country. 11 hours ago CEBU NEGROS ISLAND TYPHOON Corruption’s fallout It’s mid-November, and expectations are rising about cases being filed in court related to corruption in flood control and other infrastructure projects. 11 hours ago CORRUPTION FLOOD CONTROL The bigger crime and the proponents No matter how long the march, marriage or death, it all begins and ends in church. 11 hours ago DPWH Ex-DPWH chief Bonoan leaves Philippines amid flood project probe Bureau of Immigration Spokesperson Dana Sandoval confirmed to Philstar.com about Bonoan’s departure, saying he is covered by an Immigration Lookout Bulletin Order (ILBO) earlier issued by the Department of Justice (DOJ). 14 hours ago CORRUPTION DEPARTMENT OF PUBLIC WORKS AND HIGHWAYS DPWH"
  }
]