[
  {
    "url": "https://www.investors.com/etfs-and-funds/sectors/sp500-investors-find-ways-to-profit-from-trumps-global-arms-race/",
    "url_mobile": "",
    "title": "S & P 500 : Investors Find Ways To Profit From Trump Global Arms Race",
    "seendate": "20250327T134500Z",
    "socialimage": "https://www.investors.com/wp-content/uploads/2022/01/FAB-military-012122-adobe.jpg",
    "domain": "investors.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "President Donald Trump's moves to rip up the world's military alliances are creating ways for investors to profit in S&P 500 stocks using ETFs. Six of the eight largest defense and aerospace ETFs, including iShares U.S. Aerospace & Defense ( ITA ), Invesco Aerospace & Defense ( PPA ) and SPDR S&P Aerospace & Defense ( XAR ), are outperforming the S&P 500 this year, says an Investor's Business Daily analysis of data from ETFdb and MarketSurge . And the entire group of eight ETFs is up an average of nearly 7%, while the S&P 500 is down 3% this year so far, says S&P Global Market Intelligence. \"The rise in global military expenditures has driven strong performance in defense stocks,\" said Taylor Krystkowiak, vice president and investment strategist at Themes ETFs. A New World Order? Trump has made it clear he's no longer interested in protecting many of the U.S.' allies. And he is expecting countries, especially in Europe, to spend more on their own defense. And that's prompting major shifts. NATO members excluding the U.S. are forecast to spend $380 billion on defense this year. And 23 countries are positioned to spend 2% of their GDP on defense, an all-time high, Krystkowiak says. The result is an expected boom in defense spending — already showing up in the shares of the defense ETFs. U.S. defense stocks are in the major indexes, but are not a major component. \"Investors have modest exposure to aerospace and defense companies in a broad U.S. equity market ETF tied to the S&P 500 or the Russell 1000 indexes,\" said Todd Rosenbluth of TMX VettaFi. \"The industry is part of the industrial sector but is relatively small compared to the information technology sector.\" ETFs can fortify portfolios' exposure to defense, though. But not all defense and aerospace ETFs are alike. Picking The Top Defense ETFs The biggest winner so far is the $1.2 billion-in-assets Global X Defense Tech ETF ( SHLD ). Shares are up nearly 27% this year, mainly due to the exposure to the wave of European spending. The ETF owns European defense giants like Germany's Rheinmetall ( RHM ) in addition to U.S. firms. Global X Defense Tech holds an 8.7% position in Rheinmetall. The German company provides a wide range of defense supplies ranging from munition to armored vehicles. Shares have more than doubled in value this year. Analysts think the company will make $31.84 a share this year, up nearly 70% from 2024. Another large European holding in the fund is France's Thales, which trades on the Euronext Paris exchange. It, too, makes a variety of defense products ranging from flight decks to drones. It's a 6.2% position in the ETF. Shares are up more than 80% this year. But Global X Defense Tech also holds shares of U.S. defense stocks like Palantir Technologies ( PLTR ). The maker of defense software is up more than 20% this year. And it's a 9.7% position in the fund — making it the largest holding. Other Options To Choose From IShares U.S. Aerospace & Defense, Invesco Aerospace & Defense and SPDR S&P Aerospace & Defense are the largest defense ETFs by assets. But they take different approaches. IShares U.S. Aerospace & Defense and Invesco Aerospace & Defense \"are more concentrated in large cap stocks like Boeing ( BA ) and Lockheed Martin ( LMT ),\" Rosenbluth said. Boeing is the third-largest position in iShares U.S. Aerospace & Defense at roughly 10%, says Morningstar. SPDR S&P Aerospace & Defense takes a slightly different tactic. It holds smaller defense stocks like Archer Aviation ( ACHR ) and Rocket Lab USA ( RKLB ), too. \"There are more targeted industry ETFs that can be used to augment diversified funds. However there are differences between them,\" Rosenbluth said. Largest Defense ETFs Most top the S&P 500 this year so far ETF Symbol Assets ($ billions) YTD ch. iShares U.S. Aerospace & Defense ITA $6.5 8.0% Invesco Aerospace & Defense PPA 4.7 4.0% SPDR S&P Aerospace & Defense XAR 2.7 0.5% Global X Defense Tech SHLD 1.2 26.8% ARK Space Exploration & Innovation ARKX 0.3 -3.5% Direxion Daily Aerospace & Defense Bull 3X DFEN 0.2 20.4% SPDR S&P Kensho Future Security FITE 0.09 -2.5% U.S. Global Technology and Aerospace & Defense WAR 0.003 0.8% Sources: ETFdb, S&P Global Market Intelligence, IBD Follow Matt Krantz on X (Twitter) @ mattkrantz YOU MAY ALSO LIKE: Five Reasons To Watch This Palantir Peer. A Pending Breakout Is Just One. Yes, Tesla Is Back. But Funds Absolutely Adore These 6 Stocks. How To Invest In Nvidia And Beyond In 2025: Draw Lines, Not Conclusions Find The Next Palantir Or Hot IPO In 2025. Here's How. Here's How This Key Sell Signal Saved Stamps.com Investors From Big Losses"
  },
  {
    "url": "https://www.marketscreener.com/quote/stock/GE-AEROSPACE-4823/news/GE-Aerospace-Korean-Air-Selects-GE-Aerospace-Engines-to-Power-New-787-10s-and-777-9s-49441425/",
    "url_mobile": "",
    "title": "GE Aerospace : Korean Air Selects GE Aerospace Engines to Power New 787 10s and 777 9s",
    "seendate": "20250326T163000Z",
    "socialimage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
    "domain": "marketscreener.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "GE Aerospace : Korean Air Selects GE Aerospace Engines to Power New 787 10s and 777 9s Published on 03/26/2025 at 12:12 pm EDT - Modified on 03/26/2025 at 12:13 pm EDT Publicnow Share GE Aerospace -0.39% CINCINNATI - March 26, 2025 - GE Aerospace (NYSE:GE) announced today that following Korean Air's agreement to purchase 20 Boeing 777-9s and up to 30 787-10s, the airline has placed an order for GEnx and GE9X engines to power its new aircraft. \"We're grateful for the Korean Air team putting its trust in us again,\" said Russell Stokes, President and CEO, Commercial Engines and Services, GE Aerospace. \"Today's order represents the next chapter in our long-standing partnership with Korean Air and reaffirms our commitment to support their successful fleet upgrade and expansion.\" The order also includes a service agreement to cover the maintenance, repair, and overhaul of the GE9X engines. With this order, Korean Air becomes the first GE9X customer in South Korea. \"GE Aerospace provides the advanced technology that powers our commitment to excellence,\" said Walter Cho, Chairman and CEO of Korean Air and Hanjin Group. \"Our partnership is essential to Korean Air's vision of becoming the world's most loved airline.\" Since its introduction in 2011, the GEnx engine family has accumulated over 62 million flight hours. It stands as GE Aerospace's fastest-selling, high-thrust engine to date, with more than 3,600 engines currently in service and backlog, including spare units. Today, the GEnx engine powers two-thirds of all 787 aircraft currently in operation. The GE9X engine is the world's most powerful commercial aircraft engine and the most fuel-efficient engine in its class. Available only on the Boeing 777X family of 777-9 and 777-8 aircraft, the GE9X offers 10% better specific fuel consumption than its predecessor, the GE90-115B, with emissions that are a generation ahead of any competing engine. Like all GE Aerospace commercial engines, both GEnx and GE9X engines are certified to run on Sustainable Aviation Fuel (SAF) blends today. Today, Korean Air operates an extensive fleet of GE Aerospace and CFM powered aircraft that includes GE90-110B/115B, LEAP-1B and CFM56-7B engines. In addition to the engine technology, Korean Air is using GE Aerospace's industry-leading Flight Data Monitoring system, Safety Insight, to enhance its safety protocols and operational effectiveness through advanced analytics, automation, and high-speed processing of big data. **CFM is a 50/50 joint venture between GE Aerospace and Safran Aircraft Engines # # # About Korean Air With its global hub at Incheon International Airport (ICN), Korean Air serves 110 cities in 39 countries on five continents with a modern fleet of 159 aircraft and over 20,000 professional employees. The airline has been granted numerous awards including a 5-star airline rating from Skytrax, Air Transport World's Airline of the Year and Cargo Operator of the Year awards. About GE Aerospace GE Aerospace is a global aerospace propulsion, services, and systems leader with an installed base of approximately 45,000 commercial and 25,000 military aircraft engines. With a global team of approximately 53,000 employees building on more than a century of innovation and learning, GE Aerospace is committed to inventing the future of flight, lifting people up, and bringing them home safely. Learn more about how GE Aerospace and its partners are defining flight for today, tomorrow and the future at www.geaerospace.com . For Media Inquiries, Please Contact: Lan Trinh +84.942.880066 trinh.lan@geaerospace.com Paul Bergman 513.656.8280 paul.bergman@geaerospace.com Attachments Original document Permalink Disclaimer GE Aerospace - General Electric Company published this content on March 26, 2025 , and is solely responsible for the information contained therein. Distributed by Public, unedited and unaltered, on March 26, 2025 at 16:12:06.902 . © Publicnow - 2025 Share"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/xeos-inaugurates-cfm-leap-maintenance-in-poland-302408663.html",
    "url_mobile": "",
    "title": "XEOS inaugurates CFM LEAP maintenance in Poland",
    "seendate": "20250324T121500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "WROCŁAW, Poland , March 24, 2025 /PRNewswire/ -- GE Aerospace (NYSE: GE ) today announced the inauguration of XEOS, a state-of-the-art engine maintenance, repair and overhaul (MRO) facility in Środa Śląska near Wrocław. A joint venture between GE Aerospace and Lufthansa Technik, the facility is focused on the overhaul and repair of CFM International* LEAP engines, which power today's most popular narrowbody aircraft. These include CFM LEAP-1A engines for the Airbus A320neo family and CFM LEAP-1B engines for the Boeing 737 MAX aircraft. Continue Reading XEOS Facility \"The inauguration of this facility highlights GE Aerospace's dedication to meeting the MRO ramp for CFM LEAP engines and our commitment to Poland ,\" said Alan Kelly , general manager of LEAP services at GE Aerospace. \"Celebrating 30 years in Poland , GE Aerospace now has over 2,000 employees across six facilities, partnerships with eight local universities, and more than 1,000 local suppliers. We are also focused on developing a skilled aerospace workforce in Poland , including investing in young talent through our Next Engineers program in Warsaw .\" XEOS is currently performing LEAP-1B shop visits while also supporting LEAP-1A module work and engine testing. The facility plans to add LEAP-1B test cell capability in the coming months, while growing overhaul capacity and repair capability. \"Two months ago, we proudly announced that LOT Polish Airlines had selected Lufthansa Technik for the maintenance of its CFM LEAP-1B engines,\" said Christian Seitler , Senior Director, New Engine Types at Lufthansa Technik, which is also a CFM-licensed Premier MRO provider for LEAP-1A and LEAP-1B engines. \"It's fitting that, through our XEOS joint venture with GE Aerospace, we have inducted LOT's first engine right here in Poland . This state-of-the-art facility supplements our existing LEAP engine shop in Hamburg .\" Lufthansa Technik and LOT Polish Airlines announced their CFM LEAP-1B MRO agreement in January 2025 . The Polish national carrier currently operates a fleet of 18 Boeing 737 MAX 8 aircraft, with another 13 on order, for a total of 62 CFM LEAP-1B engines, plus spares. \"We are delighted to witness our CFM LEAP-1B engines being serviced by our compatriots at XEOS,\" said Maciej Maciejewicz , Head of Powerplant at LOT Polish Airlines. \"This newly adjusted, state-of-the-art facility, coupled with a highly skilled workforce, presents significant potential benefits not only for our airline but also for the burgeoning aerospace sector in Poland .\" XEOS is a 35,000 square meter facility that features an engine prep hall for engine inspection, a main hall for engine and module assembly and disassembly, a modern clean-and-inspect line, a growing set of repair stations, a hands-on engine training center, and an advanced test cell. The facility employs the latest best practices in lean design and operation, based on GE Aerospace's proprietary lean operating system, FLIGHT DECK. \"The XEOS workforce is 250 strong and growing as we build our capacity,\" said Robert Burton, managing director of XEOS. \"With training engines on site, we're able to staff, train, and build capability quickly – to develop a talented workforce here in the Wrocław region.\" GE Aerospace technology has been powering LOT Polish Airlines for more than 25 years with CFM56-3, CFM56- 7B and LEAP-1B engines for Boeing 737 Classic, Next-Generation 737 and 737 MAX aircraft, respectively, as well as CF34 engines for Embraer E-Jets. GE Aerospace also proudly supports the Polish Air Force with engines on several aircraft and helicopters. In January, GE Aerospace received an order for 210 T700 engines to power 96 Boeing AH-64E Apache Guardian helicopters for the Polish Armed Forces. *CFM International is a 50-50 joint company of GE Aerospace and Safran Aircraft Engines. About GE Aerospace GE Aerospace is a global aerospace propulsion, services, and systems leader with an installed base of approximately 45,000 commercial and 25,000 military aircraft engines. With a global team of approximately 53,000 employees building on more than a century of innovation and learning, GE Aerospace is committed to inventing the future of flight, lifting people up, and bringing them home safely. Learn more about how GE Aerospace and its partners are defining flight for today, tomorrow, and the future at www.geaerospace.com . About Lufthansa Technik The Lufthansa Technik Group is one of the leading providers of technical aircraft services in the world. Certified internationally as a maintenance, production and design organization, the company employs more than 24,000 people in dozens of locations around the globe. Lufthansa Technik offers the full range of services for commercial, VIP and special mission aircraft. The portfolio includes maintenance, repair, overhaul and modification of airframes, engines, components and landing gears, as well as the manufacture of innovative cabin products and digital fleet support. SOURCE GE Aerospace 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.siasat.com/telanganas-aerospace-defence-sectors-surpass-pharma-in-exports-ktr-3198006/",
    "url_mobile": "",
    "title": "Telangana aerospace , defence sectors surpass pharma in exports : KTR",
    "seendate": "20250322T043000Z",
    "socialimage": "https://cdn.siasat.com/wp-content/uploads/2025/02/Untitled-design-2025-02-16T214436.526.jpg",
    "domain": "siasat.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "BRS working president KT Rama Rao Hyderabad: BRS Working President KT Rama Rao (KTR) announced on X that Telangana’s Aerospace and Defence sector has overtaken the Pharma industry in merchandise exports, marking a major milestone in the state’s industrial growth. ✈️ It is heartening to note that Telangana's Aerospace and Defence sector has overtaken the Pharma sector in merchandise exports 🚀 Happy to see the fruits of the remarkable work done during the #TelanganaDecade (2014-2023) in this sector. The Telangana Aerospace Ecosystem took… pic.twitter.com/jriizx07oV — KTR (@KTRBRS) March 21, 2025 KTR credited this achievement to the progress made during the #TelanganaDecade (2014-2023) and highlighted the impact of the state’s Aerospace and Defence Policy, introduced in 2016. He said the policy played a crucial role in attracting investments, boosting research, and strengthening indigenous manufacturing. Telangana aerospace sector grew under BRS: KTR He said, that under the BRS government, Telangana’s aerospace sector has expanded significantly, earning the Best State Award for Promotion of the Aviation Ecosystem four times (2018, 2020, 2022, and 2024). In 2021, Hyderabad was ranked No. 1 among the Top 10 Aerospace Cities in Cost-Effectiveness. The state has also fostered a strong startup ecosystem, with companies like Skyroot Aerospace, Dhruva Space, Azad Engineering, and Skanda Aerospace making significant contributions. Workforce development has been a priority, with over 30,000 people trained in aerospace skills and more than 15,000 securing jobs. Telangana now has four aerospace parks, two hardware parks, and 50 engineering parks, further strengthening its role in the aerospace and defence industry. KTR credited former chief minister K Chandrashekar Rao (KCR) for “implementing progressive policies that positioned Telangana as a national leader in the sector.” Tags aerospace brs KTR Pharma Zahed Farooqui Follow on Twitter | Updated: 22nd March 2025 8:48 am IST Facebook X LinkedIn Pinterest Messenger Messenger WhatsApp Telegram Stay updated with our WhatsApp & Telegram by subscribing to our channels. For all the latest Hyderabad updates, download our app Android and iOS ."
  },
  {
    "url": "https://www.krem.com/article/tech/science/aerospace-conference-coeur-dalene-resort/293-4cd123c1-8650-4819-8a2c-7e64f469c898",
    "url_mobile": "",
    "title": "I - 90 Aerospace+ Expo in Coeur dAlene hosts diverse manufacturing sectors",
    "seendate": "20250319T201500Z",
    "socialimage": "https://media.krem.com/assets/KREM/images/f39f413b-9bd6-4cb3-a8ae-08ae6732d133/f39f413b-9bd6-4cb3-a8ae-08ae6732d133_1140x641.jpg",
    "domain": "krem.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Science Aerospace conference coming to Coeur d'Alene Resort The conference started as a networking event for aerospace suppliers in 2015. The focus has expanded from aerospace suppliers to all manufacturing over 10 years. Credit: digidreamgrafix - stock.adobe.co Lake Coeur d'Alene scenes and resort in idaho COEUR D'ALENE, Idaho — The Annual I-90 Aerospace+ Corridor Conference and Expo will be at The Coeur d’Alene Resort on May 27-28. The conference started as a networking event for aerospace suppliers in 2015. The focus has expanded from aerospace suppliers to all manufacturing over 10 years. The attendance has also grown from under 100 attendees to close to 300. The event is popular with regional manufacturers and suppliers in the aerospace, space, medical, scientific, photonics, nuclear, energy, thermoplastic and other manufacturing sectors, a press release said. In another aerospace development, a new program offers career path introductions to youth in the aerospace and space industries. Video-based Manufacturing Awareness Program is through Let’s Go Aerospace Magazine and its parent company, Top Drawer Media. \"The publication and the M.A.P. videos' short-term goals are to inspire more youth to consider careers in advanced manufacturing,\" a press release said. \"In the long term, Top Drawer Media will partner with advanced manufacturing companies, state government, and educational institutions to bring more hands-on tours to middle and high schools in the Pacific Northwest.\" The aerospace industry is rising in career potential in North Idaho. The American Aerospace Materials Manufacturing Center may become a reality through the U.S. Department of Commerce Tech Hub award and industry commitments of over $50 million. The funding will help establish a facility for advanced aerospace materials in the Inland Northwest. To read the full article, please visit our content partner, the Coeur d'Alene Press . Close Ad"
  },
  {
    "url": "https://www.orlandosentinel.com/2025/03/18/blue-ghost-lander-pictures/",
    "url_mobile": "",
    "title": "Blue Ghost lander captures stunning sunset shots on the moon before falling silent",
    "seendate": "20250319T000000Z",
    "socialimage": "https://www.orlandosentinel.com/wp-content/uploads/2025/03/Moon_Landing_92999.jpg",
    "domain": "orlandosentinel.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "This image provided by NASA/Firefly Aerospace, Tuesday, March 18, 2025, shows the sun setting on the moon, with Earth and Venus in the distance. (NASA/Firefly Aerospace via AP) By Associated Press PUBLISHED: March 18, 2025 at 6:24 PM EDT | UPDATED: March 18, 2025 at 6:33 PM EDT By MARCIA DUNN CAPE CANAVERAL, Fla. (AP) — A private lunar lander has captured the first high-definition sunset pictures from the moon. Firefly Aerospace and NASA released the stunning photos Tuesday, taken before the Blue Ghost lander fell silent over the weekend. One shot included Venus in the distance. Firefly’s Blue Ghost landed on the moon on March 2, the first private spacecraft to touch down upright and perform its entire mission. It kept taking pictures and collecting science data five hours into the lunar night before it died for lack of solar energy. This image provided by NASA/Firefly Aerospace shows the sun about to emerge from totality behind Earth. (NASA/Firefly Aerospace via AP) NASA’s Joel Kearns said Blue Ghost’s series of sunset shots are the first high-resolution images from Earth’s neighbor. Scientists will need to analyze them in depth, he noted, before making any determination about the horizon glow captured in at least one of the photos and whether it was created by levitating dust. That theory was put forth more than a half-century ago by Apollo 17’s Gene Cernan, the last astronaut to walk on the moon. “What we’ve got is a really beautiful, aesthetic image showing some really unusual features,” Kearns said at a news conference. This image provided by NASA/Firefly Aerospace, Tuesday, March 18, 2025, shows the sun setting on the moon, with Earth and Venus in the distance. (NASA/Firefly Aerospace via AP) Blue Ghost carried 10 experiments for NASA under the space agency’s commercial lunar delivery program. While all objectives were met, officials said, the on-board drill could only penetrate 3 feet (1 meter) into the moon versus the 10 feet (3 meters) that had been planned. Firefly said it will try to activate the lunar in early April following the two-week, bitter cold lunar night, although engineers are doubtful it will crank back up. This image provided by NASA/Firefly Aerospace shows Earth captured by Blue Ghost shortly after landing from the lunar surface. (NASA/Firefly Aerospace via AP) The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content. Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X RevContent Feed"
  },
  {
    "url": "https://www.sun-sentinel.com/2025/03/18/blue-ghost-lander-pictures/",
    "url_mobile": "",
    "title": "Blue Ghost lander captures stunning sunset shots on the moon before falling silent",
    "seendate": "20250318T231500Z",
    "socialimage": "https://www.sun-sentinel.com/wp-content/uploads/2025/03/Moon_Landing_92999.jpg",
    "domain": "sun-sentinel.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "This image provided by NASA/Firefly Aerospace, Tuesday, March 18, 2025, shows the sun setting on the moon, with Earth and Venus in the distance. (NASA/Firefly Aerospace via AP) By Associated Press PUBLISHED: March 18, 2025 at 6:24 PM EDT | UPDATED: March 18, 2025 at 6:33 PM EDT By MARCIA DUNN CAPE CANAVERAL, Fla. (AP) — A private lunar lander has captured the first high-definition sunset pictures from the moon. Firefly Aerospace and NASA released the stunning photos Tuesday, taken before the Blue Ghost lander fell silent over the weekend. One shot included Venus in the distance. Firefly’s Blue Ghost landed on the moon on March 2, the first private spacecraft to touch down upright and perform its entire mission. It kept taking pictures and collecting science data five hours into the lunar night before it died for lack of solar energy. This image provided by NASA/Firefly Aerospace shows the sun about to emerge from totality behind Earth. (NASA/Firefly Aerospace via AP) NASA’s Joel Kearns said Blue Ghost’s series of sunset shots are the first high-resolution images from Earth’s neighbor. Scientists will need to analyze them in depth, he noted, before making any determination about the horizon glow captured in at least one of the photos and whether it was created by levitating dust. That theory was put forth more than a half-century ago by Apollo 17’s Gene Cernan, the last astronaut to walk on the moon. “What we’ve got is a really beautiful, aesthetic image showing some really unusual features,” Kearns said at a news conference. This image provided by NASA/Firefly Aerospace, Tuesday, March 18, 2025, shows the sun setting on the moon, with Earth and Venus in the distance. (NASA/Firefly Aerospace via AP) Blue Ghost carried 10 experiments for NASA under the space agency’s commercial lunar delivery program. While all objectives were met, officials said, the on-board drill could only penetrate 3 feet (1 meter) into the moon versus the 10 feet (3 meters) that had been planned. Firefly said it will try to activate the lunar in early April following the two-week, bitter cold lunar night, although engineers are doubtful it will crank back up. This image provided by NASA/Firefly Aerospace shows Earth captured by Blue Ghost shortly after landing from the lunar surface. (NASA/Firefly Aerospace via AP) The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content. Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Bluesky (Opens in new window) Bluesky RevContent Feed"
  },
  {
    "url": "https://www.ocregister.com/2025/03/18/blue-ghost-lander-pictures/",
    "url_mobile": "https://www.ocregister.com/2025/03/18/blue-ghost-lander-pictures/amp/",
    "title": "Blue Ghost lander captures stunning sunset shots on the moon before falling silent",
    "seendate": "20250318T230000Z",
    "socialimage": "https://www.ocregister.com/wp-content/uploads/2025/03/Moon_Landing_92999.jpg",
    "domain": "ocregister.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "This image provided by NASA/Firefly Aerospace, Tuesday, March 18, 2025, shows the sun setting on the moon, with Earth and Venus in the distance. (NASA/Firefly Aerospace via AP) By Associated Press PUBLISHED: March 18, 2025 at 3:24 PM PDT | UPDATED: March 18, 2025 at 3:33 PM PDT By MARCIA DUNN CAPE CANAVERAL, Fla. (AP) — A private lunar lander has captured the first high-definition sunset pictures from the moon. Firefly Aerospace and NASA released the stunning photos Tuesday, taken before the Blue Ghost lander fell silent over the weekend. One shot included Venus in the distance. Firefly’s Blue Ghost landed on the moon on March 2, the first private spacecraft to touch down upright and perform its entire mission. It kept taking pictures and collecting science data five hours into the lunar night before it died for lack of solar energy. This image provided by NASA/Firefly Aerospace shows the sun about to emerge from totality behind Earth. (NASA/Firefly Aerospace via AP) NASA’s Joel Kearns said Blue Ghost’s series of sunset shots are the first high-resolution images from Earth’s neighbor. Scientists will need to analyze them in depth, he noted, before making any determination about the horizon glow captured in at least one of the photos and whether it was created by levitating dust. That theory was put forth more than a half-century ago by Apollo 17’s Gene Cernan, the last astronaut to walk on the moon. “What we’ve got is a really beautiful, aesthetic image showing some really unusual features,” Kearns said at a news conference. This image provided by NASA/Firefly Aerospace, Tuesday, March 18, 2025, shows the sun setting on the moon, with Earth and Venus in the distance. (NASA/Firefly Aerospace via AP) Blue Ghost carried 10 experiments for NASA under the space agency’s commercial lunar delivery program. While all objectives were met, officials said, the on-board drill could only penetrate 3 feet (1 meter) into the moon versus the 10 feet (3 meters) that had been planned. Firefly said it will try to activate the lunar in early April following the two-week, bitter cold lunar night, although engineers are doubtful it will crank back up. This image provided by NASA/Firefly Aerospace shows Earth captured by Blue Ghost shortly after landing from the lunar surface. (NASA/Firefly Aerospace via AP) The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content. Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Reddit (Opens in new window) Reddit Click to print (Opens in new window) Print Newsroom Guidelines News Tips Contact Us Report an Error RevContent Feed"
  },
  {
    "url": "https://markets.financialcontent.com/stocks/quote?Symbol=537:2578383489",
    "url_mobile": "",
    "title": "Bridger Aerospace Group Holdings , Inc . - Common Stock ( Nasdaq : BAER ) Stock Quote",
    "seendate": "20250317T213000Z",
    "socialimage": "",
    "domain": "markets.financialcontent.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Recent Quotes View Full List My Watchlist Create Watchlist Indicators Nasdaq Composite Standard & Poors 500 Gold Crude Oil Markets Stocks ETFs Tools Markets: Overview News Currencies International Treasuries Bridger Aerospace Group Holdings, Inc. - Common Stock (NQ: BAER ) 1.860 +0.130 (+7.51%) Streaming Delayed Price Updated: 4:00 PM EST, Nov 11, 2025 Add to My Watchlist Quote Overview Detailed Quote Charting Historical Prices News All News News Headlines Press Releases Research Quarterly Reports Insider Filings Other Filings Price and Volume Detailed Quote Volume 1,417,092 Open 1.700 Bid (Size) 1.800 (100) Ask (Size) 1.830 (200) Prev. Close 1.730 Today's Range 1.670 - 1.900 52wk Range 1.022 - 4.435 Shares Outstanding N/A Dividend Yield N/A Intraday 1 Week 1 Month 3 Month 1 Year 3 Year 5 Year Top News More News 12 Industrials Stocks Moving In Friday's After-Market Session November 07, 2025 Via Benzinga Bridger Aerospace Achieves Another Record Third Quarter November 06, 2025 Via Stocktwits Performance YTD -7.9% -7.9% 1 Month +7.2% +7.2% 3 Month -6.5% -6.5% 6 Month +13.4% +13.4% 1 Year -46.9% -46.9% More News Read More Earnings Scheduled For November 6, 2025 November 06, 2025 Via Benzinga Bridger Aerospace Announces Schedule for its Third Quarter 2025 Earnings Release and Conference Call October 30, 2025 Via Stocktwits Bridger Aerospace Secures $331 Million in New Financing Commitments to Fuel Growth and Fleet Expansion October 29, 2025 Via Stocktwits Topics Bonds Bridger Aerospace Completes $49 Million Sale-Leaseback, Leveraging Real Estate Portfolio to Prioritize Fleet Growth October 28, 2025 Via Stocktwits Bridger Aerospace Applauds Wildland Fire Service Plan and Fire Ready Nation Act September 17, 2025 Via Stocktwits Bridger Aerospace Announces Participation in the 31st Annual Gabelli Aerospace & Defense Symposium on September 4 September 02, 2025 Via Stocktwits Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 21, 2025 Via Stocktwits Bridger Aerospace Announces Strongest Second Quarter in Company History August 07, 2025 Via Stocktwits Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 September 03, 2025 From Gabelli Funds Via GlobeNewswire 12 Industrials Stocks Moving In Monday's After-Market Session August 18, 2025 Via Benzinga Earnings Scheduled For August 7, 2025 August 07, 2025 Via Benzinga Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 September 02, 2025 From Gabelli Funds Via GlobeNewswire Bridger (BAER) Q2 Revenue Jumps 137% August 07, 2025 Via The Motley Fool Bridger Aerospace Announces Schedule for its Second Quarter 2025 Earnings Release and Conference Call August 04, 2025 Via Stocktwits Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 20, 2025 From Gabelli Funds Via GlobeNewswire 12 Industrials Stocks Moving In Wednesday's After-Market Session July 23, 2025 Via Benzinga 12 Industrials Stocks Moving In Monday's After-Market Session June 23, 2025 Via Benzinga Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 18, 2025 From Gabelli Funds Via GlobeNewswire Bridger Aerospace Shares Insights on Executive Order to Reshape Wildland Firefighting June 13, 2025 Via Stocktwits Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 13, 2025 From Gabelli Funds Via GlobeNewswire Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 11, 2025 From Gabelli Funds Via GlobeNewswire Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 06, 2025 From Gabelli Funds Via GlobeNewswire Gabelli Funds to Host 31st Annual Aerospace & Defense Symposium at The Harvard Club, New York City Thursday, September 4, 2025 August 04, 2025 From Gabelli Funds Via GlobeNewswire Frequently Asked Questions Is Bridger Aerospace Group Holdings, Inc. - Common Stock publicly traded? Yes, Bridger Aerospace Group Holdings, Inc. - Common Stock is publicly traded. What exchange does Bridger Aerospace Group Holdings, Inc. - Common Stock trade on? Bridger Aerospace Group Holdings, Inc. - Common Stock trades on the Nasdaq Stock Market What is the ticker symbol for Bridger Aerospace Group Holdings, Inc. - Common Stock? The ticker symbol for Bridger Aerospace Group Holdings, Inc. - Common Stock is BAER on the Nasdaq Stock Market What is the current price of Bridger Aerospace Group Holdings, Inc. - Common Stock? The current price of Bridger Aerospace Group Holdings, Inc. - Common Stock is 1.860 When was Bridger Aerospace Group Holdings, Inc. - Common Stock last traded? The last trade of Bridger Aerospace Group Holdings, Inc. - Common Stock was at 11/11/25 04:00 PM ET Stock Quote API & Stock News API supplied by www.cloudquote.io Quotes delayed at least 20 minutes. By accessing this page, you agree to the Privacy Policy and Terms Of Service . © 2025 FinancialContent. All rights reserved."
  },
  {
    "url": "http://africa.chinadaily.com.cn/a/202502/19/WS67b59b88a310c240449d6229.html",
    "url_mobile": "",
    "title": "Top court reveals cases involving military facilitie protection",
    "seendate": "20250220T010000Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202502/19/67b59b88a310c240e240f09c.jpeg",
    "domain": "africa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE China News Society Innovation HK/Macao Cross-Strait Cover Story Photo Environment Health Military Video Home / China / Society Home China Society Top court reveals cases involving military facilities' protection By CAO YIN | chinadaily.com.cn | Updated: 2025-02-19 16:51 Share Share - WeChat CLOSE China's top court disclosed five influential cases involving the protection of military facilities to further enhance the public awareness of national defense and the rule of law. \"Military facilities are an important component of national defense construction, serving as the foundation of the military to fulfill its missions, and providing crucial support for national strategic capabilities and military operations,\" the Supreme People's Court said on Wednesday. \"The disclosure of the cases not only emphasizes the significance of protecting military facilities, but also demonstrates the steadfast determination and relentless efforts of Chinese courts in safeguarding national defense interests,\" it added. It revealed that crimes involving the destruction of military facilities, such as military optical cables, have occurred from time to time in recent years. \"Such actions endanger military security and affecting the military ability to carry out its missions, so they must be severely punished,\" it noted. One disclosed case showed that a defendant surnamed Xu was sentenced to 18 months in prison for the crime of sabotage of military communications. Xu, who worked for an information technology company, was responsible for the daily inspection and maintenance of optical cable lines. He used metal pliers to cut a military optical cable during one inspection with the intention of selling it, causing the interruption of critical business systems for over two hours and disrupting military communications for three units that were conducting exercises. Xu's actions resulted in economic losses of more than 40,000 yuan ($5,490), and the loss of the involved optical cable amounted to over 9,000 yuan. \"Military communication is the method by which the armed forces use communication tools or other means to transmit information for command purposes,\" the top court said, stressing that military optical cables are vital military communication facilities. \"In the information age, the damage to military optical cables can have significant adverse effects on military communications and activities, not only causing financial losses but also severely influencing the readiness and training of troops, thereby endangering national defense interests and national security,\" it added. It praised the conviction and sentence given to Xu, noting that the ruling has shown the judicial high-pressure on those who harm national defense interests and military combat effectiveness. While requiring courts nationwide to continue the fight against such crime, it has also called on more people from all walks of life to strengthen the protection of military facilities. Photo Nearly 70% of winter wheat sowed across China Cultivation in Yunnan paves the way for 'durian freedom' Winter scenery across China Historic games cycling race a testament to GBA integration Lhasa's GDP grows 7.1 percent in first three quarters of 2025 Scholars call for ecological protection of Tunbu culture Latest Xi meets Spanish king in Beijing Building China into a strong sports country Xi holds welcome ceremony for Spanish king Nearly 70% of winter wheat sowed across China 'Tech tourism' takes off across nation Yunnan boy seen in viral video traced, is unharmed State Council News China’s public holidays for 2026 Xi meets with IOC President Coventry, Honorary President for Life Bach Xi meets national honorees in sports Exclusive HK, Taiwan volunteers share their passion at games' opening Co-hosting games boosts GBA integration Audiences amazed by National Games opening Newsmaker Chinese student in New York reimagines Miao embroidery with digital art Transport aircraft pilot flies high in PLA Ten photos you don't wanna miss Ten photos from across China: Oct 31 - Nov 6 Special Coverage 4th Plenary Session of the 20th CPC Central Committee Celebrating 70 years of progress in Xinjiang Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US"
  },
  {
    "url": "http://usa.chinadaily.com.cn/a/202502/19/WS67b59b88a310c240449d6229.html",
    "url_mobile": "",
    "title": "Top court reveals cases involving military facilitie protection",
    "seendate": "20250219T233000Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202502/19/67b59b88a310c240e240f09c.jpeg",
    "domain": "usa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE China News Society Innovation HK/Macao Cross-Strait Cover Story Photo Environment Health Military Video Home / China / Society Home China Society Top court reveals cases involving military facilities' protection By CAO YIN | chinadaily.com.cn | Updated: 2025-02-19 16:51 Share Share - WeChat CLOSE China's top court disclosed five influential cases involving the protection of military facilities to further enhance the public awareness of national defense and the rule of law. \"Military facilities are an important component of national defense construction, serving as the foundation of the military to fulfill its missions, and providing crucial support for national strategic capabilities and military operations,\" the Supreme People's Court said on Wednesday. \"The disclosure of the cases not only emphasizes the significance of protecting military facilities, but also demonstrates the steadfast determination and relentless efforts of Chinese courts in safeguarding national defense interests,\" it added. It revealed that crimes involving the destruction of military facilities, such as military optical cables, have occurred from time to time in recent years. \"Such actions endanger military security and affecting the military ability to carry out its missions, so they must be severely punished,\" it noted. One disclosed case showed that a defendant surnamed Xu was sentenced to 18 months in prison for the crime of sabotage of military communications. Xu, who worked for an information technology company, was responsible for the daily inspection and maintenance of optical cable lines. He used metal pliers to cut a military optical cable during one inspection with the intention of selling it, causing the interruption of critical business systems for over two hours and disrupting military communications for three units that were conducting exercises. Xu's actions resulted in economic losses of more than 40,000 yuan ($5,490), and the loss of the involved optical cable amounted to over 9,000 yuan. \"Military communication is the method by which the armed forces use communication tools or other means to transmit information for command purposes,\" the top court said, stressing that military optical cables are vital military communication facilities. \"In the information age, the damage to military optical cables can have significant adverse effects on military communications and activities, not only causing financial losses but also severely influencing the readiness and training of troops, thereby endangering national defense interests and national security,\" it added. It praised the conviction and sentence given to Xu, noting that the ruling has shown the judicial high-pressure on those who harm national defense interests and military combat effectiveness. While requiring courts nationwide to continue the fight against such crime, it has also called on more people from all walks of life to strengthen the protection of military facilities. Photo Nearly 70% of winter wheat sowed across China Cultivation in Yunnan paves the way for 'durian freedom' Winter scenery across China Historic games cycling race a testament to GBA integration Lhasa's GDP grows 7.1 percent in first three quarters of 2025 Scholars call for ecological protection of Tunbu culture Latest Xi meets Spanish king in Beijing Building China into a strong sports country Xi holds welcome ceremony for Spanish king Nearly 70% of winter wheat sowed across China 'Tech tourism' takes off across nation Yunnan boy seen in viral video traced, is unharmed State Council News China’s public holidays for 2026 Xi meets with IOC President Coventry, Honorary President for Life Bach Xi meets national honorees in sports Exclusive HK, Taiwan volunteers share their passion at games' opening Co-hosting games boosts GBA integration Audiences amazed by National Games opening Newsmaker Chinese student in New York reimagines Miao embroidery with digital art Transport aircraft pilot flies high in PLA Ten photos you don't wanna miss Ten photos from across China: Oct 31 - Nov 6 Special Coverage 4th Plenary Session of the 20th CPC Central Committee Celebrating 70 years of progress in Xinjiang Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US"
  },
  {
    "url": "http://europe.chinadaily.com.cn/a/202502/19/WS67b59b88a310c240449d6229.html",
    "url_mobile": "",
    "title": "Top court reveals cases involving military facilitie protection",
    "seendate": "20250219T231500Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202502/19/67b59b88a310c240e240f09c.jpeg",
    "domain": "europe.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE China News Society Innovation HK/Macao Cross-Strait Cover Story Photo Environment Health Military Video Home / China / Society Home China Society Top court reveals cases involving military facilities' protection By CAO YIN | chinadaily.com.cn | Updated: 2025-02-19 16:51 Share Share - WeChat CLOSE China's top court disclosed five influential cases involving the protection of military facilities to further enhance the public awareness of national defense and the rule of law. \"Military facilities are an important component of national defense construction, serving as the foundation of the military to fulfill its missions, and providing crucial support for national strategic capabilities and military operations,\" the Supreme People's Court said on Wednesday. \"The disclosure of the cases not only emphasizes the significance of protecting military facilities, but also demonstrates the steadfast determination and relentless efforts of Chinese courts in safeguarding national defense interests,\" it added. It revealed that crimes involving the destruction of military facilities, such as military optical cables, have occurred from time to time in recent years. \"Such actions endanger military security and affecting the military ability to carry out its missions, so they must be severely punished,\" it noted. One disclosed case showed that a defendant surnamed Xu was sentenced to 18 months in prison for the crime of sabotage of military communications. Xu, who worked for an information technology company, was responsible for the daily inspection and maintenance of optical cable lines. He used metal pliers to cut a military optical cable during one inspection with the intention of selling it, causing the interruption of critical business systems for over two hours and disrupting military communications for three units that were conducting exercises. Xu's actions resulted in economic losses of more than 40,000 yuan ($5,490), and the loss of the involved optical cable amounted to over 9,000 yuan. \"Military communication is the method by which the armed forces use communication tools or other means to transmit information for command purposes,\" the top court said, stressing that military optical cables are vital military communication facilities. \"In the information age, the damage to military optical cables can have significant adverse effects on military communications and activities, not only causing financial losses but also severely influencing the readiness and training of troops, thereby endangering national defense interests and national security,\" it added. It praised the conviction and sentence given to Xu, noting that the ruling has shown the judicial high-pressure on those who harm national defense interests and military combat effectiveness. While requiring courts nationwide to continue the fight against such crime, it has also called on more people from all walks of life to strengthen the protection of military facilities. Photo Nearly 70% of winter wheat sowed across China Cultivation in Yunnan paves the way for 'durian freedom' Winter scenery across China Historic games cycling race a testament to GBA integration Lhasa's GDP grows 7.1 percent in first three quarters of 2025 Scholars call for ecological protection of Tunbu culture Latest Building China into a strong sports country Xi holds welcome ceremony for Spanish king Nearly 70% of winter wheat sowed across China 'Tech tourism' takes off across nation Yunnan boy seen in viral video traced, is unharmed Shanghai's transport hub taking shape State Council News China’s public holidays for 2026 Xi meets with IOC President Coventry, Honorary President for Life Bach Xi meets national honorees in sports Exclusive HK, Taiwan volunteers share their passion at games' opening Co-hosting games boosts GBA integration Audiences amazed by National Games opening Newsmaker Chinese student in New York reimagines Miao embroidery with digital art Transport aircraft pilot flies high in PLA Ten photos you don't wanna miss Ten photos from across China: Oct 31 - Nov 6 Special Coverage 4th Plenary Session of the 20th CPC Central Committee Celebrating 70 years of progress in Xinjiang Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US"
  },
  {
    "url": "https://www.yahoo.com/news/military-spouses-exempt-return-office-203131408.html",
    "url_mobile": "",
    "title": "Military Spouses Exempt from  Return to Office  Executive Order",
    "seendate": "20250214T231500Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/6ysjI18s2F84grYhS0mgcA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/military_com_347/63703b29f45caeca0c52c436c78b0cb1",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways Military spouses who work remotely for the federal government are now exempt from an executive order issued Jan. 20 by President Donald Trump that ended remote options for most agencies and departments. Office of Personnel Management Acting Director Charles Ezell issued a memo Wednesday announcing that spouses of active-duty personnel who work remotely are \"categorically exempt\" from a requirement that federal workers return to their offices five days a week. The new memo clarifies a footnote in a Jan. 27 Office of Management and Budget announcement that said agencies should \"exclude military spouses working remotely based on the Military Spouse Employment Act.\" Advertisement Advertisement Advertisement Advertisement Read Next: Over $151 Million Taken from Soldiers' Paychecks for Food Costs Spent Elsewhere by the Army The memo says military spouses \"shall\" be allowed to work remotely regardless of whether they were hired under the law or by another means. It also allows agencies to accommodate military spouses for remote work across the federal workforce as they relocate. Debbie McGee, the wife of an Army retiree and founder of a human resources company, said the ability to work remotely is essential for military spouses to maintain careers and contribute to household income in an economy that largely requires two salaries to raise a family. Advertisement Advertisement Advertisement Advertisement \"The days of 'hey, your spouse is in the military, you don't have to work' are long gone. You have to have dual income now,\" McGee said in an interview Friday with Military.com. \"You have a huge population that are problem solvers [and] can pivot at the drop of a pen. They don't need to be directed. … They are perfect for remote work. Why wouldn't you [let them]?\" She added that some military spouses feared they would lose their jobs if they were required to return to office or if they moved with their spouses to a new duty station. \"They have made a commitment to stand behind the soldier and support the United States by following them\" McGee said. \"That's a huge patriotic act. Sometimes, I think the population does not realize the sacrifice the entire family makes.\" According to the memo, the exemption applies to the spouses of active-duty personnel, including activated Guard or reserve members, but it does not include the spouses of reservists attending training or school. Advertisement Advertisement Advertisement Advertisement It also applies to Gold Star spouses whose service members died on active duty and who haven't remarried, and spouses of veterans who were awarded a 100% disability rating when they left the armed forces. Military spouse employment became a priority for the executive branch under first lady Michelle Obama, who cofounded an initiative, Joining Forces, to provide military families with employment, wellness and education. Portions of the Military Spouse Employment Act were included in the fiscal 2024 National Defense Authorization Act, giving military spouses the opportunity to work remotely for federal agencies. Reps. Rob Wittman, R-Va., and Eugene Vindman, D-Va., have led a bipartisan effort in the past week to push for the return-to-work exemption for military spouses. Advertisement Advertisement Advertisement Advertisement Wittman said military families make sacrifices with frequent relocations and deserve the exemption. \"Standing by our military families isn't just the right thing to do -- it's patriotic and simply common sense. I thank the administration for their decision to amend this executive order,\" Wittman said in a news release Thursday. \"Today, I am celebrating a win for military families after the administration heeded our bipartisan call to exempt military spouses from the return to in-person work order,\" Vindman added in the release. Related: This Watchdog Agency Shielded Troops and Veterans from Fraud. Musk and Trump Just Gutted It. About Our Ads"
  },
  {
    "url": "https://www.militarytimes.com/pay-benefits/mil-money/2025/02/13/federal-military-spouse-workers-exempt-from-return-to-office-rule/",
    "url_mobile": "",
    "title": "Federal military spouse workers exempt from return - to - office rule",
    "seendate": "20250213T223000Z",
    "socialimage": "https://www.armytimes.com/resizer/v2/KCSUBGQDXFFBVIAINBFBZOBMUY.jpg?&auth=6e95b008677fa754d82927094d88730bf7de1bd99613ead97e8eb757f06712dd",
    "domain": "militarytimes.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Federally employed military spouses who work remotely are now “categorically exempt” from the return-to-office directive issued by President Donald Trump, according to new guidance clarifying the policy. Federal agencies “shall” allow military spouses to continue working remotely, and agencies may continue appointing spouses to remote work positions, according to a memo issued Wednesday by Charles Ezell, acting director of the Office of Personnel Management, or OPM. The new guidance clarifies a Jan. 27 memo from OPM and the Office of Management and Budget that included a footnote stating agencies “should also exclude military spouses working remotely based on the Military Spouse Employment Act” from the return-to-office requirement. The Jan. 27 memo directed agencies to prepare plans to return all eligible employees to in-person work, with exceptions for those excused for compelling reasons certified by the agency head and employee supervisor. It further noted military spouses working remotely had a compelling reason not to return to in-person work and agencies “should” exempt them from the requirement. In the wake of the Jan. 27 memo, some military spouses with federal jobs experienced uncertainty and angst about the new policy requiring in-person work. Advocates were concerned the guidance didn’t explicitly require federal agencies to exempt military spouses from the return-to-office requirement, potentially leading to inconsistent policies across agencies. Being able to work remotely, whether in the continental U.S. or overseas , allows military spouses to continue their careers despite frequent moves to new duty stations with their service members. Working remotely opens up more opportunities for military spouses who can be appointed to remote work positions. Military spouses have long battled problems with unemployment , largely associated with these frequent moves. The military spouse unemployment rate has remained stubbornly above 20%, according to Defense Department surveys. The new guidance applies to spouses of active-duty members, spouses of deceased service members who died while on active duty and haven’t remarried and spouses of disabled service members who retired or otherwise left the service with a 100% disability rating. It also applies to spouses of U.S. Foreign Service members on overseas assignments. The guidance also clarifies that agencies must allow military spouses to continue working remotely regardless of whether they were appointed under the Military Spouse Employment Act and covers those appointed under other appropriate hiring authorities. That applies to future appointments of military spouses to remote work positions. About Karen Jowers Karen has covered military families, quality of life and consumer issues for Military Times for more than 30 years, and is co-author of a chapter on media coverage of military families in the book \"A Battle Plan for Supporting Military Families.\" She previously worked for newspapers in Guam, Norfolk, Jacksonville, Fla., and Athens, Ga. Share: In Other News ‘Marines’ doc focuses on purpose amid shifting Pacific landscape Netflix has released its four-episode documentary series on the U.S. Marine Corps. From hot dogs to haircuts, your Veterans Day deals await Veterans Day isn't just about the discounts, but these offers of appreciation can help stretch your dollar and bring some fun to Nov. 11. More shutdown assistance offered through military stores Extended period of interest-free commissary purchases and reduced-price meals for DOD school students affected by the government shutdown are available. Program for youth caregivers, umpire academy among Fisher awardees Five nonprofits were awarded a total of $400,000 for their innovative support of troops, military families and veterans. Troops have been paid again, but what comes next? The government pulled together funds to pay troops Oct. 15 and now Nov. 1, but officials said it’s doubtful they'll be paid again if the shutdown persists. Load More"
  },
  {
    "url": "https://www.thehindu.com/news/cities/bangalore/aero-india-2025-godrej-to-manufacture-flight-control-actuators-for-amca/article69215193.ece",
    "url_mobile": "https://www.thehindu.com/news/cities/bangalore/aero-india-2025-godrej-to-manufacture-flight-control-actuators-for-amca/article69215193.ece/amp/",
    "title": "Aero India 2025 : Godrej to manufacture flight control actuators for AMCA",
    "seendate": "20250213T191500Z",
    "socialimage": "https://www.thehindu.com/theme/images/og-image.png",
    "domain": "thehindu.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Aero India 2025: Godrej to manufacture flight control actuators for AMCA Published - February 14, 2025 12:10 am IST - Bengaluru The Hindu Bureau READ LATER SEE ALL Remove The aerospace business of Godrej and Boyce, a part of Godrej Enterprises Group, has signed a memorandum of understanding with the Aeronautical Development Agency (ADA) for manufacturing flight control actuators for India’s Advanced Medium Combat Aircraft (AMCA) programme. Under the MoU, the company will undertake comprehensive development of flight control actuators for AMCA, including precision manufacturing, procurement of aerospace-grade raw materials, assembly and testing, and development of test rigs for qualification tests. Maneck Behramkamdin, senior vice president and business head, aerospace business of Godrej and Boyce, said: “This partnership exemplifies our commitment to Atmanirbhar Bharat in the aerospace sector. We are proud to be at the forefront of India’s aerospace revolution, turning the vision of Atmanirbhar Bharat into a reality through cutting-edge engineering and precision manufacturing. We continue to enable and elevate India’s manufacturing capabilities and competitiveness at a global level.” Published - February 14, 2025 12:10 am IST Read Comments Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER SEE ALL Remove PRINT 0 / 0 Sign in to unlock member-only benefits! Access 10 free stories every month Save stories to read later Access to comment on every story Sign-up/manage your newsletter subscriptions with a single click Get notified by email for early access to discounts & offers on our products ✕ Looks like you are already logged in from more than 5 devices! To continue logging in, remove at least one device from the below list Log out Log Out from all devices Terms & conditions | Institutional Subscriber Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "url": "https://www.firstpost.com/india/aero-india-2025-unit-of-worlds-largest-aerospace-and-defence-company-bets-big-on-indian-smes-13862470.html",
    "url_mobile": "https://www.firstpost.com/india/aero-india-2025-unit-of-worlds-largest-aerospace-and-defence-company-bets-big-on-indian-smes-13862470.html/amp",
    "title": "Aero India 2025 : Unit of world largest aerospace and defence company bets big on Indian SMEs",
    "seendate": "20250212T144500Z",
    "socialimage": "https://images.firstpost.com/uploads/2025/02/HAL-CATS-Warrior-2-2025-02-9ded9dcc5fe095e4e90168d7297fcdda.jpg?im=FitAndFill=(1200,675)",
    "domain": "firstpost.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Trending: PM Modi in Manipur Charlie Kirk killer Sushila Karki IND vs PAK India-US ties New human organ Downton Abbey: The Grand Finale Movie Review Home India Aero India 2025: Unit of world's largest aerospace and defence company bets big on Indian SMEs Aero India 2025: Unit of world's largest aerospace and defence company bets big on Indian SMEs FP Staff • February 12, 2025, 17:21:33 IST Whatsapp Facebook Twitter Collins Aerospace, a division of RTX, the world’ largest aerospace and defence company, has invited small- and medium-sized enterprises (SMEs) in deep tech to collaborate on aerospace and defence technologies Advertisement Subscribe Join Us Add as a preferred source on Google Prefer Firstpost On Google Collins Aerospace, a business of RTX, is focusing on SME businesses in India. Image courtesy: Collins Aerospace Aero India 2025 is well-known to be a gathering of eagles in the aviation circles. It offers unparalleled acces to one of the largest markets in the world. It is then no surprise that RTX, the world’ largest aerospace and defence company– whose business include Collins Aerospace, Pratt & Whitney, and Raytheon– made an appearance in a bid to capitalise on opportunities presented by India. In fact, Collins Aerospace, a division of RTX, has announced that it is making a big bet on the small- and medium-sized enterprises in India. STORY CONTINUES BELOW THIS AD Focus on SMEs Launching the latest edition of its Powered by Collins Initiative at Aero India 2025, the company has invited small- and medium-sized enterprises (SMEs) in deep tech to collaborate on aerospace and defence technologies. This year’s focus areas include material informatics and quantum-enabled navigation, reflecting the industry’s increasing emphasis on advanced materials and next-generation positioning systems. The company has also launched the Powered by Collins ecosystem on Switchpitch, an online platform that connects startups with enterprises, investors, and technology accelerators. The platform is expected to create a structured pipeline for innovation and foster deeper collaboration with Indian SMEs throughout the year. More from India US offers India F-35, while Russia proposes SU-57. How do they compare? Aero India 2025: What are rival giants Boeing and Airbus expecting? Since its launch in 2023, the Powered by Collins Initiative has provided SMEs with targeted collaboration opportunities, offering funded, rapid-development demonstration projects aimed at integrating innovative technologies into active aerospace and defense programs. Symbolic importance of the initiative RTX and Collins Aerospace’s continution of the initiative, as well as its latest expansion only go to show how important India, as an emerging hub for aerospace manufacturing and innovation, has become. It has also spotlighted the growing role of Indian SMEs in shaping the future of aviation and defence technology. Aero India 2025, one of the region’s largest aerospace exhibitions, has served as a key platform for fostering industry partnerships, bringing together global defence leaders, government stakeholders, and technology providers to drive collaboration. Tags Aviation Defence End of Article Read More Find us on YouTube Subscribe End of Article Impact Shorts 'New dawn': PM Modi meets Manipur violence victims in first visit since 2023 unrest Prime Minister Modi visited Churachandpur, Manipur, meeting displaced people from ethnic clashes. Modi laid foundation stones for 14 development projects worth over ₹7,300 crore in Churachandpur. Opposition criticized Modi's visit as \"too little, too late\" and questioned its impact on healing wounds. More Impact Shorts Top Stories Russian drones over Poland: Trump’s tepid reaction a wake-up call for Nato? As Russia pushes east, Ukraine faces mounting pressure to defend its heartland Why Mossad was not on board with Israel’s strike on Hamas in Qatar Turkey: Erdogan's police arrest opposition mayor Hasan Mutlu, dozens officials in corruption probe Russian drones over Poland: Trump’s tepid reaction a wake-up call for Nato? As Russia pushes east, Ukraine faces mounting pressure to defend its heartland Why Mossad was not on board with Israel’s strike on Hamas in Qatar Turkey: Erdogan's police arrest opposition mayor Hasan Mutlu, dozens officials in corruption probe Top Shows QUICK LINKS Mumbai Rains Home Video Shorts Live TV"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/defence/soaring-high-tata-advanced-systems-expands-operations-in-karnataka/articleshow/118175327.cms",
    "url_mobile": "https://m.economictimes.com/news/defence/soaring-high-tata-advanced-systems-expands-operations-in-karnataka/amp_articleshow/118175327.cms",
    "title": "Soaring high : Tata Advanced Systems expands operations in Karnataka",
    "seendate": "20250212T110000Z",
    "socialimage": "https://img.etimg.com/thumb/msid-118175511,width-1200,height-630,imgsize-94108,overlay-etdefence/articleshow.jpg",
    "domain": "economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "C 130J Aircraft Bengaluru: Tata Advanced Systems Limited (TASL) is expanding its operations in Karnataka, as the state continues to solidify its position as a preferred destination for aerospace and defense innovation. TASL will establish a state-of-the-art Maintenance, Repair, and Overhaul (MRO) facility to support the Indian Air Force 's Lockheed Martin's C-130J fleet , strengthening India's self-reliance in defence and bolstering Karnataka's role in the global aerospace supply chain. Backed by Karnataka's strong infrastructure, skilled workforce, and industry-friendly policies, such investments will support technological growth, job creation, and global collaborations in the aerospace sector. With strong government support, Karnataka remains a preferred investment destination for global aerospace and defence companies. The state's progressive policies, cutting-edge research ecosystem, and skilled talent pool continue to attract strategic investments that enhance India's position in the global aerospace supply chain. As the aerospace sector continues to evolve, Karnataka remains committed to driving innovation, accelerating industrial growth, and fostering an environment that encourages high-value technology investments. Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Tata Advanced Systems Karnataka Aerospace MRO Facility Indian Air Force TASL (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Tata Advanced Systems Karnataka Aerospace MRO Facility Indian Air Force TASL (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition How DOMS turned pencil into a sword to end Camlin’s 100-year run Sebi wants to throw a lifeline for bond IPOs; but it may end up injecting steroids German giant Bayer to push harder on tiered pricing for its drugs How India’s quest to build a global energy co was shattered Stock Radar: IDFC First Bank stock breaks out from falling trendline resistance; check target & stop loss These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts 1 2 3 View all Stories"
  },
  {
    "url": "https://www.news18.com/world/xi-jinping-doesnt-want-any-information-about-chinas-military-to-be-shared-online-9224386.html",
    "url_mobile": "https://www.news18.com/amp/world/xi-jinping-doesnt-want-any-information-about-chinas-military-to-be-shared-online-9224386.html",
    "title": "Xi Jinping Doesnt Want Any Information About China Military To Be Shared Online",
    "seendate": "20250212T101500Z",
    "socialimage": "https://images.news18.com/ibnlive/uploads/2025/02/Mallika-1600-x-900-px-76-2025-02-f67712f1c703687ae6e46dd9785073e5-16x9.png",
    "domain": "news18.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Xi Jinping Doesn't Want Any Information About China's Military To Be Shared Online Published By : Mallika Soni CNN Last Updated: February 12, 2025, 11:49 IST The rules, announced over the weekend and taking effect on March 1, come as China is rapidly building up and modernizing its People’s Liberation Army (PLA) to match the military might of the United States. Impact Shorts Big news, made easy Rapid Read Summarized by AI. + More Rapid Read Like this summary? Share Your Feedback Choose News18 on Google reset China President Xi Jinping China has unveiled sweeping new regulations to tighten the release of information about its military online, a move that could obscure key sources for monitoring the world’s largest armed forces. The rules, announced over the weekend and taking effect on March 1, come as China is rapidly building up and modernizing its People’s Liberation Army (PLA) to match the military might of the United States. Recommended Stories It also marks the latest step in leader Xi Jinping’s far-reaching campaign to bolster national security and guard state secrets in the face of heightened geopolitical tensions – efforts that have made it all the more difficult for foreign observers to understand what is happening in China. The all-encompassing rules could have a big impact on Chinese military bloggers and commentators, who are often quick to share images or information about new weapons systems, personnel appointments and troop movements. Such publicly available information posted by Chinese military enthusiasts has also been an important source for PLA watchers to track the development and movement of the Chinese military. The regulations are aimed at addressing issues including “the spread of false military information\" and “the leakage of military secrets\" on the internet, according to a Q&A released by the government. They lay out strict rules for online content about military affairs, banning the “producing, copying, publishing and disseminating\" of military secrets, national defense technology and industry secrets or other undisclosed information. The banned list covers everything from the development and testing of weapons systems to military drills and deployment, as well as the organizational structures, tasks and combat capabilities of military units that have not been officially disclosed. Joseph Wen, a Taipei-based independent analyst who documents publicly available intelligence about the PLA, said the ruling Chinese Communist Party has always been defined by a high degree of opacity. “However, as a regime that values both secrecy and propaganda, Chinese authorities have long taken a ‘wink and nod’ approach toward the dissemination of information related to the PLA within domestic online communities,\" he said. The new rules signal that Beijing is beginning to abandon this approach and establish clear boundaries for “guarding secrets,\" Wen added. The regulations target individual users and “online military information service providers,\" which include dedicated military affairs websites, military columns and social media accounts focused on the military. In a sign of their sweeping scope, the regulations were issued jointly by 10 government and Communist Party departments, from the top internet regulator and top military commanding body to the ministries of public security, state security and culture and tourism. Open source information has provided key clues about China’s military progress in the past. Last December, online footage and images of what many believed to be China’s next-generation stealth fighter jet caused a huge stir in both China and the overseas PLA watching community, after the mysterious aircraft were seen flying in broad daylight over two Chinese cities. It’s unclear how the new rules will affect foreign media reporting on the Chinese military. Analysts said the new regulations could portend a tightening of control over military-themed content on the Chinese internet. “Military and defense-related content enjoys significant popularity among Chinese internet users, but the leadership is clearly keen to ensure that sensitive information — a concept broadly applied in China — and speculation do not undermine the official narrative around the country’s military development and capabilities,\" wrote David Bandurski, executive director of the China Media Project. James Char, a PLA expert and assistant professor at the S. Rajaratnam School of International Studies in Singapore, said information related to the PLA and other military matters have long been placed under strict supervision by Chinese authorities. Some of the content banned by the new rules had already been outlawed in previous legislations, such as anything that harms national sovereignty and security or denigrate the military and its “heroes and martyrs.\" Others are routinely censored on Chinese social media, such as comments criticizing China’s national defense policy and military strategy, or those spreading false information about the military. “I regard the announcement of these regulations as nothing more than the institutionalization of existing rules,\" Char said. But he noted that the new rules banning the sharing of information on military deployments and troop movements do serve to outlaw such practices by internet users without PLA approval, such as military bloggers or the man on the street in China. “This may have an effect on these individuals’ readiness to post such material online the next time they come across troop movements or a military exercise in their localities,\" Char said. “This will also work in Beijing’s interest in preventing its troop deployments within the mainland from being exposed in advance of another major military exercise or troop build-up in China’s coastal regions off the Taiwan Strait.\" top videos View all Swipe Left For Next Video View all Wen, the PLA watcher in Taipei, said the new regulations could also be partially a response to the growth of online open-source intelligence community, but PLA observers still have plenty of opportunities to gather data from official propaganda sources. “The official PLA media outlets remain some of the most prolific military media in the world,\" he said. Follow News18 on Google . Join the fun, play QIK games on News18 . Download the News18 App to stay updated! tags : Xi Jinping view comments Location : China First Published: February 12, 2025, 11:49 IST News world Xi Jinping Doesn't Want Any Information About China's Military To Be Shared Online Disclaimer: Comments reflect users’ views, not News18’s. Please keep discussions respectful and constructive. Abusive, defamatory, or illegal comments will be removed. News18 may disable any comment at its discretion. By posting, you agree to our Terms of Use and Privacy Policy . Loading comments... Read More"
  },
  {
    "url": "https://www.odt.co.nz/business/christchurch-company-goes-solar-stratosphere",
    "url_mobile": "",
    "title": "Christchurch company goes solar to the stratosphere",
    "seendate": "20250212T023000Z",
    "socialimage": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2025/02/kea_44.jpg?itok=snIwsurb",
    "domain": "odt.co.nz",
    "language": "English",
    "sourcecountry": "New Zealand",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "You are not permitted to download, save or email this image. Visit image gallery to purchase the image. Business 0 Comments A Christchurch aerospace company has successfully launched its solar-powered aircraft from Banks Peninsula into the stratosphere for the first time. Taking off from the Tāwhaki National Aerospace Centre near Birdlings Flat, the Kea Atmos Mk1b UAV (unmanned aerial vehicle) completed the milestone flight on Saturday. Mark Rocket. Photo: Kea Aerospace The flight, conducted within Kea Aerospace's special use airspace, reached an altitude of over 56,284ft (17155m). Kea Aerospace chief executive Mark Rocket said it marks another significant achievement for New Zealand’s aerospace sector. The mission started just after 8am and the flight lasted 8hr 20min. The plane flew 18.9 nautical miles (35km) from the take-off area, covering a total distance of 420km, before touching down again on the peninsula just before 5.30pm. Rocket said flying in the stratosphere puts the UAV above the weather, high winds and other aircraft and allows the solar powered UAV to fly continuously for several months. \"The use of solar power eliminates the need for refuelling, significantly reducing the Kea Atmos’ carbon footprint. \"The aircraft is designed to carry payloads for earth observation, telecommunications and technology testing. \"A key focus is on aerial imagery applications, including environmental monitoring, maritime domain awareness, precision agriculture and disaster response. The Kea Atmos solar-powered aircraft. Photo: Kea Aerospace \"This stratospheric flight puts Kea Aerospace alongside just a handful of other international companies that can achieve solar-powered flight to high altitudes. \"It’s not an easy enterprise to balance the aerodynamic, power and weight allowances for this type of aircraft, whilst flying in conditions of -50 deg C with only 10% of the air density we experience at sea level. \"Kudos and congratulations to our CTO, Dr Philipp Sueltrop and the Kea Aerospace team, it’s a phenomenal result to join the rarified stratospheric club.\" The Kea Atmos Mk1 has a 12.5m wingspan and weighs less than 40kg. It is designed for dawn-to-dusk missions. Rocket said Kea Aerospace will continue to conduct stratospheric flights with the UAV, carrying payloads for government and commercial customers. Kea Aerospace will also start the design phase for its larger Kea Atmos Mk2 aircraft this year. The Mk2 will be able to make multi-month endurance flights. Said Rocket: \"We feel very fortunate to do our aerospace R&D work in New Zealand, we have been extremely well supported by entities such as the Tāwhaki National Aerospace Centre, Civil Aviation Authority, Airways, Callaghan Innovation, the New Zealand Space Agency and the Ministry of Business, Innovation and Employment. Thank you for enabling us to make this happen.” Star News Related Stories SUBSCRIBER Liquidators sell division of photo firm SUBSCRIBER Distillery diversifies into ‘bread whisky’ Consumer NZ names and shames in latest 'Yeah Nah' awards Beef mince price soars 17.5% 'Talent-short' job market to cost employers more Impressive haul for CrestClean at awards SUBSCRIBER Different strengths to follow ‘big footsteps’ Callaghan Innovation redundancies top $10m Calder Stewart eyes future as firm marks 70th SUBSCRIBER Speculation swirls over job losses at milk plant Shift to facility part of $20m expansion Large pets grounded on some domestic flights More"
  },
  {
    "url": "https://edition.cnn.com/2025/02/11/china/china-regulations-online-military-content-intl-hnk/",
    "url_mobile": "https://amp.cnn.com/cnn/2025/02/11/china/china-regulations-online-military-content-intl-hnk",
    "title": "China tightens screws on what can be shared online about its military",
    "seendate": "20250211T123000Z",
    "socialimage": "https://media.cnn.com/api/v1/images/stellar/prod/ap22223332802754.jpg?c=16x9&q=w_800,c_fill",
    "domain": "edition.cnn.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Chinese military aircraft conduct a joint combat training exercises around Taiwan on August 7, 2022. Li Bingyu/AP Hong Kong CNN — China has unveiled sweeping new regulations to tighten the release of information about its military online, a move that could obscure key sources for monitoring the world’s largest armed forces. The rules , announced over the weekend and taking effect on March 1, come as China is rapidly building up and modernizing its People’s Liberation Army (PLA) to match the military might of the United States. It also marks the latest step in leader Xi Jinping’s far-reaching campaign to bolster national security and guard state secrets in the face of heightened geopolitical tensions – efforts that have made it all the more difficult for foreign observers to understand what is happening in China. The all-encompassing rules could have a big impact on Chinese military bloggers and commentators, who are often quick to share images or information about new weapons systems, personnel appointments and troop movements. Such publicly available information posted by Chinese military enthusiasts has also been an important source for PLA watchers to track the development and movement of the Chinese military. The regulations are aimed at addressing issues including “the spread of false military information” and “the leakage of military secrets” on the internet, according to a Q&A released by the government. They lay out strict rules for online content about military affairs, banning the “producing, copying, publishing and disseminating” of military secrets, national defense technology and industry secrets or other undisclosed information. The banned list covers everything from the development and testing of weapons systems to military drills and deployment, as well as the organizational structures, tasks and combat capabilities of military units that have not been officially disclosed. Joseph Wen, a Taipei-based independent analyst who documents publicly available intelligence about the PLA, said the ruling Chinese Communist Party has always been defined by a high degree of opacity. “However, as a regime that values both secrecy and propaganda, Chinese authorities have long taken a ‘wink and nod’ approach toward the dissemination of information related to the PLA within domestic online communities,” he said. The new rules signal that Beijing is beginning to abandon this approach and establish clear boundaries for “guarding secrets,” Wen added. The regulations target individual users and “online military information service providers,” which include dedicated military affairs websites, military columns and social media accounts focused on the military. A J-35A stealth fighter jet flies in the sky during the 15th China International Aviation and Aerospace Exhibition, or Airshow China 2024, on November 12, 2024 in Zhuhai, Guangdong Province of China. The Airshow China kicks off on November 12 in Zhuhai. Chen Jimin/China News Service/VCG/Getty Images Related article Stealth fighters and a massive mothership drone: The high-tech weapons China unveiled at its largest airshow In a sign of their sweeping scope, the regulations were issued jointly by 10 government and Communist Party departments, from the top internet regulator and top military commanding body to the ministries of public security, state security and culture and tourism. Open source information has provided key clues about China’s military progress in the past. Last December, online footage and images of what many believed to be China’s next-generation stealth fighter jet caused a huge stir in both China and the overseas PLA watching community, after the mysterious aircraft were seen flying in broad daylight over two Chinese cities. It’s unclear how the new rules will affect foreign media reporting on the Chinese military. Analysts said the new regulations could portend a tightening of control over military-themed content on the Chinese internet. “Military and defense-related content enjoys significant popularity among Chinese internet users, but the leadership is clearly keen to ensure that sensitive information — a concept broadly applied in China — and speculation do not undermine the official narrative around the country’s military development and capabilities,” wrote David Bandurski, executive director of the China Media Project. James Char, a PLA expert and assistant professor at the S. Rajaratnam School of International Studies in Singapore, said information related to the PLA and other military matters have long been placed under strict supervision by Chinese authorities. Chinese President Xi Jinping waves as he drives after inspecting the troops during a parade to celebrate the 70th Anniversary of the founding of the People's Republic of China at Tiananmen Square in 1949, on October 1, 2019 in Beijing, China. Kevin Frayer/Getty Images Related article Xi brought down powerful rivals in the military. Now he’s going after his own men Some of the content banned by the new rules had already been outlawed in previous legislations, such as anything that harms national sovereignty and security or denigrate the military and its “heroes and martyrs.” Others are routinely censored on Chinese social media, such as comments criticizing China’s national defense policy and military strategy, or those spreading false information about the military. “I regard the announcement of these regulations as nothing more than the institutionalization of existing rules,” Char said. But he noted that the new rules banning the sharing of information on military deployments and troop movements do serve to outlaw such practices by internet users without PLA approval, such as military bloggers or the man on the street in China. “This may have an effect on these individuals’ readiness to post such material online the next time they come across troop movements or a military exercise in their localities,” Char said. “This will also work in Beijing’s interest in preventing its troop deployments within the mainland from being exposed in advance of another major military exercise or troop build-up in China’s coastal regions off the Taiwan Strait.” Wen, the PLA watcher in Taipei, said the new regulations could also be partially a response to the growth of online open-source intelligence community, but PLA observers still have plenty of opportunities to gather data from official propaganda sources. “The official PLA media outlets remain some of the most prolific military media in the world,” he said. This story has been updated with additional information."
  },
  {
    "url": "https://www.cnn.com/2025/02/11/china/china-regulations-online-military-content-intl-hnk/",
    "url_mobile": "https://amp.cnn.com/cnn/2025/02/11/china/china-regulations-online-military-content-intl-hnk",
    "title": "China tightens screws on what can be shared online about its military",
    "seendate": "20250211T104500Z",
    "socialimage": "https://media.cnn.com/api/v1/images/stellar/prod/ap22223332802754.jpg?c=16x9&q=w_800,c_fill",
    "domain": "cnn.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Chinese military aircraft conduct a joint combat training exercises around Taiwan on August 7, 2022. Li Bingyu/AP Hong Kong CNN — China has unveiled sweeping new regulations to tighten the release of information about its military online, a move that could obscure key sources for monitoring the world’s largest armed forces. The rules , announced over the weekend and taking effect on March 1, come as China is rapidly building up and modernizing its People’s Liberation Army (PLA) to match the military might of the United States. It also marks the latest step in leader Xi Jinping’s far-reaching campaign to bolster national security and guard state secrets in the face of heightened geopolitical tensions – efforts that have made it all the more difficult for foreign observers to understand what is happening in China. The all-encompassing rules could have a big impact on Chinese military bloggers and commentators, who are often quick to share images or information about new weapons systems, personnel appointments and troop movements. Such publicly available information posted by Chinese military enthusiasts has also been an important source for PLA watchers to track the development and movement of the Chinese military. The regulations are aimed at addressing issues including “the spread of false military information” and “the leakage of military secrets” on the internet, according to a Q&A released by the government. They lay out strict rules for online content about military affairs, banning the “producing, copying, publishing and disseminating” of military secrets, national defense technology and industry secrets or other undisclosed information. The banned list covers everything from the development and testing of weapons systems to military drills and deployment, as well as the organizational structures, tasks and combat capabilities of military units that have not been officially disclosed. Joseph Wen, a Taipei-based independent analyst who documents publicly available intelligence about the PLA, said the ruling Chinese Communist Party has always been defined by a high degree of opacity. “However, as a regime that values both secrecy and propaganda, Chinese authorities have long taken a ‘wink and nod’ approach toward the dissemination of information related to the PLA within domestic online communities,” he said. The new rules signal that Beijing is beginning to abandon this approach and establish clear boundaries for “guarding secrets,” Wen added. The regulations target individual users and “online military information service providers,” which include dedicated military affairs websites, military columns and social media accounts focused on the military. A J-35A stealth fighter jet flies in the sky during the 15th China International Aviation and Aerospace Exhibition, or Airshow China 2024, on November 12, 2024 in Zhuhai, Guangdong Province of China. The Airshow China kicks off on November 12 in Zhuhai. Chen Jimin/China News Service/VCG/Getty Images Related article Stealth fighters and a massive mothership drone: The high-tech weapons China unveiled at its largest airshow In a sign of their sweeping scope, the regulations were issued jointly by 10 government and Communist Party departments, from the top internet regulator and top military commanding body to the ministries of public security, state security and culture and tourism. Open source information has provided key clues about China’s military progress in the past. Last December, online footage and images of what many believed to be China’s next-generation stealth fighter jet caused a huge stir in both China and the overseas PLA watching community, after the mysterious aircraft were seen flying in broad daylight over two Chinese cities. It’s unclear how the new rules will affect foreign media reporting on the Chinese military. Analysts said the new regulations could portend a tightening of control over military-themed content on the Chinese internet. “Military and defense-related content enjoys significant popularity among Chinese internet users, but the leadership is clearly keen to ensure that sensitive information — a concept broadly applied in China — and speculation do not undermine the official narrative around the country’s military development and capabilities,” wrote David Bandurski, executive director of the China Media Project. James Char, a PLA expert and assistant professor at the S. Rajaratnam School of International Studies in Singapore, said information related to the PLA and other military matters have long been placed under strict supervision by Chinese authorities. Chinese President Xi Jinping waves as he drives after inspecting the troops during a parade to celebrate the 70th Anniversary of the founding of the People's Republic of China at Tiananmen Square in 1949, on October 1, 2019 in Beijing, China. Kevin Frayer/Getty Images Related article Xi brought down powerful rivals in the military. Now he’s going after his own men Some of the content banned by the new rules had already been outlawed in previous legislations, such as anything that harms national sovereignty and security or denigrate the military and its “heroes and martyrs.” Others are routinely censored on Chinese social media, such as comments criticizing China’s national defense policy and military strategy, or those spreading false information about the military. “I regard the announcement of these regulations as nothing more than the institutionalization of existing rules,” Char said. But he noted that the new rules banning the sharing of information on military deployments and troop movements do serve to outlaw such practices by internet users without PLA approval, such as military bloggers or the man on the street in China. “This may have an effect on these individuals’ readiness to post such material online the next time they come across troop movements or a military exercise in their localities,” Char said. “This will also work in Beijing’s interest in preventing its troop deployments within the mainland from being exposed in advance of another major military exercise or troop build-up in China’s coastal regions off the Taiwan Strait.” Wen, the PLA watcher in Taipei, said the new regulations could also be partially a response to the growth of online open-source intelligence community, but PLA observers still have plenty of opportunities to gather data from official propaganda sources. “The official PLA media outlets remain some of the most prolific military media in the world,” he said. This story has been updated with additional information."
  },
  {
    "url": "https://www.yahoo.com/news/china-tightens-screws-shared-online-082153894.html",
    "url_mobile": "",
    "title": "China tightens screws on what can be shared online about its military",
    "seendate": "20250211T093000Z",
    "socialimage": "https://media.zenfs.com/en/cnn_articles_875/1486d7add3028080b8b53c2d74082d0b",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Chinese military aircraft conduct a joint combat training exercises around Taiwan on August 7, 2022. Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways China has unveiled sweeping new regulations to tighten the release of information about its military online, a move that could obscure key sources for monitoring the world’s largest armed forces. The rules , announced over the weekend and taking effect on March 1, come as China is rapidly building up and modernizing its People’s Liberation Army (PLA) to match the military might of the United States. It also marks the latest step in leader Xi Jinping’s far-reaching campaign to bolster national security and guard state secrets in the face of heightened geopolitical tensions – efforts that have made it all the more difficult for foreign observers to understand what is happening in China. Advertisement Advertisement Advertisement Advertisement The all-encompassing rules could have a big impact on Chinese military bloggers and commentators, who are often quick to share images or information about new weapons systems, personnel appointments and troop movements. Such publicly available information posted by Chinese military enthusiasts has also been an important source for PLA watchers to track the development and movement of the Chinese military. The regulations are aimed at addressing issues including “the spread of false military information” and “the leakage of military secrets” on the internet, according to a Q&A released by the government. They lay out strict rules for online content about military affairs, banning the “producing, copying, publishing and disseminating” of military secrets, national defense technology and industry secrets or other undisclosed information. Advertisement Advertisement Advertisement Advertisement The banned list covers everything from the development and testing of weapons systems to military drills and deployment, as well as the organizational structures, tasks and combat capabilities of military units that have not been officially disclosed. Joseph Wen, a Taipei-based independent analyst who documents publicly available intelligence about the PLA, said the ruling Chinese Communist Party has always been defined by a high degree of opacity. “However, as a regime that values both secrecy and propaganda, Chinese authorities have long taken a ‘wink and nod’ approach toward the dissemination of information related to the PLA within domestic online communities,” he said. The new rules signal that Beijing is beginning to abandon this approach and establish clear boundaries for “guarding secrets,” Wen added. Advertisement Advertisement Advertisement Advertisement The regulations target individual users and “online military information service providers,” which include dedicated military affairs websites, military columns and social media accounts focused on the military. In a sign of their sweeping scope, the regulations were issued jointly by 10 government and Communist Party departments, from the top internet regulator and top military commanding body to the ministries of public security, state security and culture and tourism. Open source information has provided key clues about China’s military progress in the past. Last December, online footage and images of what many believed to be China’s next-generation stealth fighter jet caused a huge stir in both China and the overseas PLA watching community, after the mysterious aircraft were seen flying in broad daylight over two Chinese cities. It’s unclear how the new rules will affect foreign media reporting on the Chinese military. Advertisement Advertisement Advertisement Advertisement Analysts said the new regulations could portend a tightening of control over military-themed content on the Chinese internet. “Military and defense-related content enjoys significant popularity among Chinese internet users, but the leadership is clearly keen to ensure that sensitive information — a concept broadly applied in China — and speculation do not undermine the official narrative around the country’s military development and capabilities,” wrote David Bandurski, executive director of the China Media Project. James Char, a PLA expert and assistant professor at the S. Rajaratnam School of International Studies in Singapore, said information related to the PLA and other military matters have long been placed under strict supervision by Chinese authorities. Some of the content banned by the new rules had already been outlawed in previous legislations, such as anything that harms national sovereignty and security or denigrate the military and its “heroes and martyrs.” Advertisement Advertisement Advertisement Advertisement Others are routinely censored on Chinese social media, such as comments criticizing China’s national defense policy and military strategy, or those spreading false information about the military. “I regard the announcement of these regulations as nothing more than the institutionalization of existing rules,” Char said. But he noted that the new rules banning the sharing of information on military deployments and troop movements do serve to outlaw such practices by internet users without PLA approval, such as military bloggers or the man on the street in China. “This may have an effect on these individuals’ readiness to post such material online the next time they come across troop movements or a military exercise in their localities,” Char said. Advertisement Advertisement Advertisement Advertisement “This will also work in Beijing’s interest in preventing its troop deployments within the mainland from being exposed in advance of another major military exercise or troop build-up in China’s coastal regions off the Taiwan Strait.” Wen, the PLA watcher in Taipei, said the new regulations could also be partially a response to the growth of online open-source intelligence community, but PLA observers still have plenty of opportunities to gather data from official propaganda sources. “The official PLA media outlets remain some of the most prolific military media in the world,” he said. This story has been updated with additional information. For more CNN news and newsletters create an account at CNN.com About Our Ads"
  },
  {
    "url": "https://www.marketscreener.com/quote/stock/HOWMET-AEROSPACE-INC-104922916/news/Howmet-Aerospace-to-Present-at-Barclays-2025-Industrial-Select-Conference-49012692/",
    "url_mobile": "",
    "title": "Howmet Aerospace to Present at Barclays 2025 Industrial Select Conference",
    "seendate": "20250210T223000Z",
    "socialimage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
    "domain": "marketscreener.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Howmet Aerospace to Present at Barclays 2025 Industrial Select Conference Published on 02/10/2025 at 05:10 pm EST - Modified on 02/10/2025 at 05:11 pm EST Business Wire Share Howmet Aerospace Inc. -0.40% Howmet Aerospace Inc. (NYSE:HWM) announced today that John C. Plant, Chairman and Chief Executive Officer, and Ken Giacobbe, Executive Vice President and Chief Financial Officer, will speak at the Barclays Annual Industrial Select Conference on Wednesday, February 19, 2025, at 7:30 AM ET. A real-time webcast of the event will be available on the “Investors/Events and Presentations” section of www.howmet.com , where a webcast replay will be available for 90 days following the presentation. About Howmet Aerospace Howmet Aerospace Inc., headquartered in Pittsburgh, Pennsylvania, is a leading global provider of advanced engineered solutions for the aerospace and transportation industries. The Company’s primary businesses focus on jet engine components, aerospace fastening systems, and airframe structural components necessary for mission-critical performance and efficiency in aerospace and defense applications, as well as forged wheels for commercial transportation. With approximately 1,170 granted patents, the Company’s differentiated technologies enable lighter, more fuel-efficient aircraft and commercial trucks to operate with a lower carbon footprint. For more information, visit www.howmet.com . Dissemination of Company Information Howmet Aerospace intends to make future announcements regarding Company developments and financial performance through its website at www.howmet.com . View source version on businesswire.com: https://www.businesswire.com/news/home/20250210852531/en/ © Business Wire - 2025 Share"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/india/we-are-using-imported-aircraft-karnataka-deputy-cm-shivakumar-says-calling-for-sops-to-promote-domestic-manufacturing/articleshow/118119613.cms",
    "url_mobile": "https://m.economictimes.com/news/india/we-are-using-imported-aircraft-karnataka-deputy-cm-shivakumar-says-calling-for-sops-to-promote-domestic-manufacturing/amp_articleshow/118119613.cms",
    "title": "  We are using imported aircraft , Karnataka deputy CM Shivakumar says , calling for sops to promote domestic manufacturing",
    "seendate": "20250210T131500Z",
    "socialimage": "https://img.etimg.com/thumb/msid-118119793,width-1200,height-630,imgsize-29958,overlay-economictimes/articleshow.jpg",
    "domain": "economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "IANS Shivakumar Deputy CM DK Shivakumar on Monday urged Defence Minister Rajnath Singh to consider offering incentives to investments in aircraft and helicopter manufacturing in Karnataka recognising the state’s rich talent pool and a robust aerospace ecosystem. The incentives to manufacturers would help the state retain its talented professionals and prevent a brain drain, the Dy CM said, speaking at the inaugural of Aero India 2025 . Karnataka, Shivakumar said, played a crucial role in India’s aerospace sector, making up 67% of the country’s aircraft and helicopter manufacturing for defence services and 65% of India’s aerospace-related exports. Bengaluru was home to over 60% of the country’s aerospace manufacturing and defence research steered by major organizations like HAL , ISRO, and Boeing India etc. Over 150,000 people work in Bengaluru’s aerospace sector, making the city a global leader in aviation and defence technology, he said. The defence and aerospace industry faced a big gap despite these impressive gains. While aircraft servicing and repair were well-established in India, the manufacturing of aircraft and helicopters was yet to take off. Live Events Most of the aircraft and helicopters used in India were imported ones, he said, while building a case for sops for domestic manufacturing. Karnataka, the Dy CM said, was the first state to announce an aerospace policy in 2013. “Our state has also set up a dedicated aerospace park in 1000 acres near Devanahalli for aerospace companies.” Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on shivakumar dk shivakumar aero india aero india 2025 karnataka news hal (Catch all the Business News , Breaking News , Budget 2025 Events and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on shivakumar dk shivakumar aero india aero india 2025 karnataka news hal (Catch all the Business News , Breaking News , Budget 2025 Events and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Indian sky wars: As Noida and Adani Airport loom, can GMR keep its altitude? The rupee’s fall might just be its rise. Here’s why! OpenAI-Oracle-Nvidia deals: Big AI moves or just balance-sheet games? Trading the change: Why India’s brokers are shifting from access to advice Stock Radar: Swiggy showing signs of bottoming out after falling nearly 30% from highs; time to buy? Sound businesses are the best antidote for volatility: 6 large- and mid-cap stocks with an upside potential of up to 30% 1 2 3 View all Stories"
  },
  {
    "url": "https://www.scmp.com/news/china/military/article/3298106/china-tightens-rules-publishing-information-about-military-online",
    "url_mobile": "https://amp.scmp.com/news/china/military/article/3298106/china-tightens-rules-publishing-information-about-military-online",
    "title": "China tightens rules on publishing information about the military",
    "seendate": "20250210T123000Z",
    "socialimage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/02/10/d49225db-ccb4-4af7-b71a-70796a65a7d3_ecce38b2.jpg?itok=UegxcKaz&v=1739187337",
    "domain": "scmp.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Advertisement China's military weapons China Military China tightens rules on publishing information about the military online ‘Online information providers’ face a range of new curbs including a ban on publishing information about weapons systems and facilities Reading Time: 2 minutes Why you can trust SCMP 11 Hayley Wong in Beijing Published: 7:39pm, 10 Feb 2025 China has announced new rules limiting what information can be shared about the military. Advertisement Beijing said the rules were designed to protect defence sources and the People’s Liberation Army’s public image, but they may mean it will be harder to monitor the development and evolution of China’s military. From March 1 “online military information providers” will be banned from “producing, copying, publishing, or disseminating” previously undisclosed information, including details of weapon systems and military facilities. The new rules ban the publication of information involving “military and national defence technology secrets”. These include information about “research and development, production, testing, transportation, equipment status and the maintenance of weapons and equipment, [as well as] the tactical and technical performance of weapons and equipment”. It also bans the release of information about the armed forces’ organisational structure, its chain of command, previous commanders and details about military units that have not been officially disclosed. Advertisement The rules also took aim at “false military information and the leakage of military secrets on the internet”, according to the PLA’s official social media accounts. They were outlined in a document signed by the Cyberspace Administration of China, the political work department of the Central Military Commission and other departments, which was made public on Saturday. Advertisement Select Voice Choose your listening speed Get through articles 2x faster 1.25 x 250 WPM Slow Average Fast 00:00 00:00 1.25 x"
  },
  {
    "url": "https://news.ltn.com.tw/news/focus/breakingnews/4946318",
    "url_mobile": "https://news.ltn.com.tw/amp/news/focus/breakingnews/4946318",
    "title": " 《 TAIPEI TIMES 》 Military institutes AI ban - 焦點",
    "seendate": "20250209T193000Z",
    "socialimage": "https://img.ltn.com.tw/Upload/news/600/2025/02/09/phpgIzXCq.jpg",
    "domain": "news.ltn.com.tw",
    "language": "English",
    "sourcecountry": "Taiwan",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "限制級 您即將進入之新聞內容 需滿18歲 方可瀏覽。 未滿18歲 或不同意本條款 離開 我同意 我已年滿18歲 進入 根據「電腦網路內容分級處理辦法」修正條文第六條第三款規定，已於網站首頁或各該限制級網頁，依台灣網站分級推廣基金會規定作標示。 台灣網站分級推廣基金會（TICRF）網站：http://www.ticrf.org.tw 首頁 > 焦點 《TAIPEI TIMES》 Military institutes AI ban 2025/02/10 03:00 The logos of OpenAI and DeepSeek are pictured in an undated photograph. Photo: Bloomberg By Aaron Tu and Shelley Shan / Staff reporters Military personnel are prohibited from uploading military or personal data, or restricted information to ChatGPT, Gemini, DeepSeek （深度求索） or any other generative artificial intelligence （AI） services, the Ministry of National Defense said. 請繼續往下閱讀... It also banned the use of the Taiwanese-developed Trustworthy Artificial Intelligence Dialogue Engine and Chungshan Institute of Science and Technology’s ANILA, which was specifically designed to handle military affairs. Due to their diverse and powerful functions, generative AI platforms can gather a massive amount of data from users and learn about them to improve or create new products, the ministry said. Any reckless use of AI platforms could lead to leaks of confidential military information, compromise personal data safety and infringe upon intellectual property rights, it said. Military personnel are not allowed to upload military information, personal data or any information with restricted access to any generative AI platform, nor are they allowed to produce official documents using the services, it said. As generative AI platforms can produce inaccurate or vague results, all military personnel should carefully scrutinize and verify information found on generative AI platforms before using them, it said, adding that they are also strictly forbidden to use generative AI platforms to engage in illegal activities or disrupt social order. Personnel who leak confidential military information or damage the reputation of the military would face legal consequences, the ministry said. Separately, the ministry said it is intensifying efforts to crack down on etomidate use after the Executive Yuan listed it as a Category 2 narcotic in November last year. The substance, also known as “zombie vapes” when used in e-cigarettes, is a type of central nervous system depressant that can induce anesthesia. In November last year, a military conscript was found with 50 tablets of etomidate during a security search. Last year, the military used sniffer dogs to crack down on illegal drugs on military premises 525 times, Deputy Minister of National Defense Huang Yu-min （黃佑民） said in a meeting at the end of last year to review the military’s efforts to prevent hazards caused by narcotics. A specialist from the National Police Agency was invited to address military personnel in the meeting on ways to deter the abuse of etomidate. “The military is responsible for safeguarding national security, and drug prevention cannot be relaxed,” Huang said, adding that all military units would continue to bolster anti-drug efforts, strengthen awareness of law and discipline among officers and soldiers, and maintain the purity of troops. 新聞來源： TAIPEI TIMES 免費訂閱 《自由體育》電子報 熱門賽事、球星動態不漏接 不用抽 不用搶 現在用APP看新聞 保證天天中獎 點我下載APP 按我看活動辦法 相關新聞 焦點今日熱門 看更多！請加入自由時報粉絲團 網友回應"
  },
  {
    "url": "https://dailypost.ng/2025/02/09/israeli-military-expands-west-bank-operation/",
    "url_mobile": "",
    "title": "Israeli military expands West Bank operation",
    "seendate": "20250209T110000Z",
    "socialimage": "https://dailypost.ng/wp-content/uploads/2024/04/download-3.jpeg",
    "domain": "dailypost.ng",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Israeli security forces said they have expanded a military operation to Nur Shams in the West Bank. A military spokesperson said this on Sunday, announcing the expansion of a military operation in the occupied territory. Recall that the military, police and intelligence services launched a counter-terrorism operation in Jenin on January 21. Officials described the operation as a large-scale and significant military operation. According to the Israeli military, several militants had been killed and a number of wanted suspect detained in the operation. Up Next I’m not interested in buying TikTok – Elon Musk Don't Miss Zamfara: Gov Lawal approves committee to investigate causes of fire at Kaura Namoda Almajeri school You may like Jordan reopens key West Bank border crossing after deadly shooting Israeli military eliminates Hamas’ military wing founder, Issa Al-Issa IDF arrests suspect behind deadly January West Bank shooting Pregnant Israeli woman killed in West Bank shooting attack ‘East Jerusalem, West Bank, Gaza belong to Palestine’ – Erdogan slams Israel Israel approves independence for 13 West Bank settlements"
  },
  {
    "url": "https://www.thedailystar.net/news/world/news/israeli-military-says-it-expanding-west-bank-operation-3819666",
    "url_mobile": "",
    "title": "Israeli military says it is expanding West Bank operation",
    "seendate": "20250209T094500Z",
    "socialimage": "",
    "domain": "thedailystar.net",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "World World Israeli military says it is expanding West Bank operation Sun Feb 9, 2025 01:16 PM Last update on: Sun Feb 9, 2025 01:19 PM Reuters Sun Feb 9, 2025 01:16 PM Last update on: Sun Feb 9, 2025 01:19 PM Members of the Israeli forces operate at the scene of a shooting attack at the military post, in Jordan Valley, in the Israeli-occupied West Bank February 4, 2025. REUTERS Israeli security forces have expanded a military operation to Nur Shams in the West Bank, a military spokesperson said on Sunday, announcing the expansion of a military operation in the occupied territory. The military, police and intelligence services launched a counter-terrorism operation in Jenin on January 21, described by officials as a \"large-scale and significant military operation\". For all latest news, follow The Daily Star's Google News channel. The Israeli military said several fighters had been killed and a number of wanted suspect detained in the operation. Related topic: Israel Click to comment Comments Comments Policy"
  },
  {
    "url": "https://www.thehindu.com/news/international/israeli-military-says-it-is-expanding-west-bank-operation/article69198755.ece",
    "url_mobile": "https://www.thehindu.com/news/international/israeli-military-says-it-is-expanding-west-bank-operation/article69198755.ece/amp/",
    "title": "Israeli military says it is expanding West Bank operation",
    "seendate": "20250209T090000Z",
    "socialimage": "https://th-i.thgim.com/public/incoming/htvicf/article69198775.ece/alternates/LANDSCAPE_1200/Israel_Palestinians_18979.jpg",
    "domain": "thehindu.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Israeli military says it is expanding West Bank operation The military, police and intelligence services launched a counter-terrorism operation in Jenin on January 21, described by officials as a “large-scale and significant military operation” Published - February 09, 2025 01:02 pm IST - JERUSALEM Reuters READ LATER SEE ALL Remove Residents of the Al-Far’a Camp, West Bank, evacuate their homes as the Israeli military continues its operation in the area, on February 8, 2025. | Photo Credit: AP Israeli security forces have expanded a military operation to Nur Shams in the West Bank, a military spokesperson said on Sunday (February 9, 2025), announcing the expansion of a military operation in the occupied territory . The military, police and intelligence services launched a counter-terrorism operation in Jenin on January 21 , described by officials as a \"large-scale and significant military operation\". The Israeli military said several militants had been killed and a number of wanted suspect detained in the operation. More details to follow... Published - February 09, 2025 01:02 pm IST Read Comments Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER SEE ALL Remove PRINT Related Topics Israel-Palestine Conflict / Israel 0 / 0 Sign in to unlock member-only benefits! Access 10 free stories every month Save stories to read later Access to comment on every story Sign-up/manage your newsletter subscriptions with a single click Get notified by email for early access to discounts & offers on our products ✕ Looks like you are already logged in from more than 5 devices! To continue logging in, remove at least one device from the below list Log out Log Out from all devices Terms & conditions | Institutional Subscriber Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "url": "https://economictimes.indiatimes.com/news/defence/israeli-military-says-it-is-expanding-west-bank-operation/articleshow/118085426.cms",
    "url_mobile": "https://m.economictimes.com/news/defence/israeli-military-says-it-is-expanding-west-bank-operation/amp_articleshow/118085426.cms",
    "title": "Israeli military says it is expanding West Bank operation",
    "seendate": "20250209T080000Z",
    "socialimage": "https://img.etimg.com/thumb/msid-118085465,width-1200,height-630,imgsize-9380,overlay-etdefence/articleshow.jpg",
    "domain": "economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "IANS Jerusalem, Feb 2 (IANS) The Israeli military said on Sunday that it has expanded its major campaign in the northern occupied West Bank. Israeli security forces have expanded a military operation to Nur Shams in the West Bank , a military spokesperson said on Sunday, announcing the expansion of a military operation in the occupied territory. The military, police and intelligence services launched a counter-terrorism operation in Jenin on January 21, described by officials as a \"large-scale and significant military operation\". The Israeli military said several militants had been killed and a number of wanted suspect detained in the operation. Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Israeli security forces military operations Nur Shams West Bank Jenin (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Israeli security forces military operations Nur Shams West Bank Jenin (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Small-Midcaps slide shows PMS managers have no magic wand The rupee’s fall might just be its rise. Here’s why! OpenAI-Oracle-Nvidia deals: Big AI moves or just balance-sheet games? With Indian at helm for the first time, can Hyundai regain lost ground? While India is dreaming of chips, punters put Nvidia to shame with bet on this unknown stock ET Prime Series: Q2 earnings estimate special Part 2 – Will banks deliver a surprise? 1 2 3 View all Stories"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/aegis-aerospace-partners-with-texas-am-university-to-create-dedicated-flight-facility-on-the-iss-for-university-research-302371793.html",
    "url_mobile": "",
    "title": "Aegis Aerospace Partners with Texas A & M University to Create Dedicated Flight Facility on the ISS for University Research",
    "seendate": "20250208T173000Z",
    "socialimage": "https://mma.prnewswire.com/media/2615851/Aegis_Depiction_TAMU_SPIRIT.jpg?p=facebook",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "HOUSTON , Feb. 8, 2025 /PRNewswire/ -- Aegis Aerospace Inc . has announced unprecedented news that the company will help bring higher education even higher at Texas A&M University by partnering with the University to create TAMU-SPIRIT, a private flight facility on the International Space Station (ISS) dedicated to university research. Continue Reading Depiction of TAMU-SPIRIT, based on Aegis Aerospace’s commercial flight facility, MISSE. MISSE has been commercially in operation on the International Space Station since 2018. TAMU-SPIRIT, which stands for Texas A&M / Aegis Aerospace Multi-Use Space Platform Integrating Research & Innovative Technology, will be a dedicated facility for activities such as in-space research, testing, advanced materials manufacturing, robotics testing, space surveillance and tracking technologies. \"It is an honor to partner with and help elevate space research for my alma mater,\" shared Aegis Aerospace CEO and Chairman Stephanie Murphy . \"Creating the TAMU-SPIRIT truly demonstrates the tenacity, spirit and world-class leadership of Texas A&M and its space research.\" Aegis Aerospace will own and operate the TAMU-SPIRIT test facility, and there will be an open call for experiments every six months for students, faculty and other researchers within the Texas A&M University System. Students and faculty will also partner in the on-going operations process. The design for the TAMU-SPIRIT flight facility will be based on Aegis Aerospace's MISSE Flight Facility, the busiest permanent commercial flight facility on the ISS, with operations to start as early as 2027. About Aegis Aerospace Inc. Aegis Aerospace Inc. is a Hispanic woman-owned small business that provides technical services and turn-key solutions to government and commercial customers in the space and defense industries. Formed in 2021 by combining Alpha Space and MEI Technologies, Aegis Aerospace offers over 30 years of success and innovation in technology development and engineering services, commercial space services, and other space and defense products and services. Our Space Testing as a Service (STaaS™) business model is turnkey which enables our customers to focus on their science and new technology development. For more information, visit www.aegisaero.com . SOURCE Aegis Aerospace Inc. 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.flightglobal.com/aerospace/conglomerates-are-out-how-honeywells-break-up-plan-could-revive-aerospace-business/161698.article",
    "url_mobile": "",
    "title": "  Conglomerates are out : How Honeywell break up plan could revive aerospace business | In depth",
    "seendate": "20250206T234500Z",
    "socialimage": "https://d3lcr32v2pp4l1.cloudfront.net/Pictures/1024x536/8/6/2/107862_honeywellanthemflightdeckpc12_sm_109556.jpg",
    "domain": "flightglobal.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "FlightGlobal is the global aviation community’s primary source of news, data, insight, knowledge and expertise. We provide news, data, analytics and advisory services to connect the aviation community globally and help organisations shape their business strategies, identify new opportunities and make better decisions faster."
  },
  {
    "url": "https://www.military.com/daily-news/2025/02/05/return-work-order-creating-chaos-anguish-military-spouses.html",
    "url_mobile": "https://www.military.com/daily-news/2025/02/05/return-work-order-creating-chaos-anguish-military-spouses.html?amp",
    "title": "The Return to Work Order Is Creating Chaos , Anguish for Military Spouses",
    "seendate": "20250205T180000Z",
    "socialimage": "https://images03.military.com/sites/default/files/styles/full/public/2025-02/ApNewsroom_NerdWallet-Remote_Work-Travel_37942.jpg",
    "domain": "military.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "In this June 19, 2017, file photo, a person types on a laptop keyboard in North Andover, Mass. (AP Photo/Elise Amendola, File) Military.com | By Jennifer Barnhill Published February 05, 2025 at 10:56am ET Jennifer Barnhill is a columnist for Military.com writing about military families. Military spouse unemployment has been around 20% for half a century. In recent years opportunities such as telework have provided a solution to the high mobility of military life, allowing spouses to retain their jobs through military moves. However, the recent return-to-work order issued by the Trump administration has military spouse s, who can't show up to work, wondering whether they still have jobs. On Jan. 20, the Trump administration issued an executive order canceling remote federal employment, mandating employees to return to the office. The Office of Personnel Management (OPM) issued a direction to federal agencies requiring them to come up with a plan to implement the order, allowing some agency flexibility. In its first memo, OPM did not include military spouses as an exempt group. While researching this article, I spoke with a dozen spouses about the impact this executive order has already had on their families. Guidance has trickled out to employees in a piecemeal fashion. Spouses shared individual agency memos from Health and Human Services and the Department of Veterans Affairs (VA), memos that named military spouses as exempt from this order. According to a DoD memo dated Jan. 24 reviewed by Military.com, the DoD did not explicitly indicate that military spouses were exempt from this change. Instead, it deferred to the service branches to make that call. However, OPM -- in collaboration with the Office of Management and Budget (OBM) -- released a follow-up memo on Jan. 27, stating: \"Agencies should also exclude military spouses working remotely.\" The DoD later revised its memo on Jan. 31 to reflect this change, which is due in large part to military spouses working behind the scenes to remind leaders of existing protections. But military spouse teleworkers are unsure whether this applies to them. While both remote work and telework offer similar flexibilities to military spouses, they are different. Remote work is a job that is established as a position that does not need to report to a central office. Telework is an agreement between an employee and an agency that allows them to take what was originally an in-person job and work from home. But these definitions have been called into question in recent weeks. Katie, who asked that she only be identified by her first name because she worried about how speaking out will impact her employment, started working in federal service three years ago. Two years into her time in her job, her supervisor left his position. As military spouses do, Katie advocated for herself and pitched the idea of her moving up into his position. This required her to also negotiate a telework position. She did what she was supposed to do: She found a way to move up in her career while moving with the military. It is unclear if the \"remote\" military spouse exemption applies to her because her job isn't remote. She's a permanent teleworker. \"There's a lot of misunderstanding right now, and a lot of misconceptions,\" Maria Donnelly, a military family advocate, said. \"Military spouses oftentimes have no choice but to work for the federal government, because bases are in places where the military or the government is the only game in town.\" Donnelly left her federal career to work for a civilian employer who guaranteed her remote employment. She said remote work was the only way she could be employed and get to live in the same location as her spouse. She has since dedicated herself to helping military spouses navigate the ups and downs of federal employment. Given this shake-up, this advocacy is needed all the more. Politicians on both sides of the aisle, along with DoD and civilian leaders, have previously branded the federal government as the \"employer of choice\" for military spouses, publicly acknowledging the relationship between employing military spouses and military readiness. But let's get something straight: This relationship is no handout. Military spouses are a highly educated addition to the federal workforce, an addition that strengthens the financial readiness of the force. Since the release of the return-to-office order, Donnelly has heard from countless spouses who are not only worried about their jobs, they are also concerned about the impact that the policy would have on their family's decision to remain in service. \"I've had multiple spouses call me crying, convinced they're about to lose their jobs,\" Donnelly said. \"The misconception is that military families can survive on one income, but we can't. It's becoming too expensive to serve.\" We are living in a two-income economy. Everyone, including the government, is looking for ways to save money and be more efficient. This is why the omission of military spouses as an exception in both teleworking and remote roles is especially confusing. It is far cheaper to promote flexible work options for military spouses than it is to pay service members more. \"There were remote positions well before the pandemic,\" said Mika Cross, a government workplace expert who has testified before Congress on the importance of telework in maintaining a competitive federal workforce. \"Those people were accurately coded and paid appropriately in remote roles, which were designed to be permanently off-site -- never requiring a government office to work in by leveraging technology to maintain productivity and connectivity.\" Cross said the order was confusing because it only highlighted \"remote\" work and not telework, and most people use the terms interchangeably, but they are different. Instead of eliminating career options for military spouses, we should be focusing on ways to codify protections, so military spouses are not forced to remind the government of their existence every time there is a change in administration. \"In all the political churn and in all of the unintended consequences, you have military families suffering,\" Donnelly said. \"We know that that's not the intent. We're just collateral damage.\" Military families are left to fight to be remembered. \"If READINESS had passed last year, none of this would be an issue,\" Donnelly added. The Resilient Employment and Authorization Determination to Increase National Employment of Serving Spouses Act ( READINESS ) was a bipartisan bill that would have created federal remote and telework protections for military spouses. \"It feels like the policies were written haphazardly, not to get us back to work but to force us out,\" said a Marine Corps spouse who works for a federal agency and asked for anonymity for fear of losing her job if she shared her concerns. She described the chilling effect the policy has already had on the community. \"It's devastating and feels like a betrayal of everything we sacrifice daily.\" One military spouse and a Navy veteran shared her family's story of upheaval. \"We're keeping our house, and I'm staying behind with the kids while he moves ahead,\" she said. Her spouse recently received permanent change-of-station, or PCS , orders, but due to this return-to-work directive, she was planning to live geographically separated because they could not afford for her to lose her job. \"The uncertainty is unbearable, and we can't afford to move twice if I'm ordered to return to the office,\" she said. While some military spouse \"remote\" workers are theoretically \"safe\" from this return-to-work policy update, teleworkers are not, nor are veteran and foreign service officer spouses. And, let's be honest, nor are our civilian counterparts who serve the military community. Story Continues Related Topics: Military Headlines Family and Spouse Donald Trump Spouse Employment By Jennifer Barnhill In addition to her reporting, Jennifer Barnhill is also the host of Military Dinner Table Conversations , a monthly reverse town hall with military families. She is the author of The Military Stories You've Been Told: And the Ones You Need to Hear (October 2025) as well as the 2025 AFI Navy Spouse of the Year, a 2023 Bush Institute StandTo Veteran Leadership Program Scholar , the editor-in-chief of the National Military Spouse Network ’s Career Connections Magazine and the military spouse liaison on The League of Wives Memorial Project . Read Full Bio © Copyright 2025 Military.com. All rights reserved. This article may not be republished, rebroadcast, rewritten or otherwise distributed without written permission. To reprint or license this article or any content from Military.com, please submit your request here ."
  },
  {
    "url": "https://www.fool.com/investing/2025/02/04/why-ge-aerospace-stock-soared-in-january/?source=iedfolrf0000001",
    "url_mobile": "",
    "title": "Why GE Aerospace Stock Soared in January",
    "seendate": "20250204T230000Z",
    "socialimage": "https://g.foolcdn.com/editorial/images/806378/ge9x-engine.png",
    "domain": "fool.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "For years, the aerospace business housed inside the General Electric conglomerate was considered a crown jewel. Now on its own, GE Aerospace ( GE 0.39% ) is proving its mettle. Shares of GE Aerospace gained 22% in January, according to data provided by S&P Global Market Intelligence , after the company posted a strong earnings report and provided an upbeat outlook for the year to come. A strong beat GE Aerospace is a collection of aircraft engines, interiors, and other components that became an independent company in April 2024 when General Electric completed a complex, multiyear breakup. Investors had high expectations for this business, and its fourth-quarter results did nothing to dispel that enthusiasm. GE earned $1.32 per share on sales of $10.8 billion, easily topping the consensus estimate for $1.04 per share on $9.5 billion in revenue. Earnings per share more than doubled and free cash flow was up more than 20% year over year. The outlook for 2025 was just as promising, with GE reporting orders in the quarter up 46% year over year. CEO Larry Culp forecast double-digit revenue and earnings growth and strong free cash flow in the new year, saying, \"I'm confident in our ability to accelerate output and deliver for our customers.\" The company also announced a 30% dividend increase and said it intends to repurchase upward of $7 billion worth of shares in 2025. The results had a good impact on Wall Street, with at least a half-dozen banks raising their price target on the company. Expand NYSE : GE GE Aerospace Today's Change ( -0.39 %) $ -1.22 Current Price $ 310.72 Key Data Points Market Cap $329B Day's Range $ 307.05 - $ 312.72 52wk Range $ 159.36 - $ 316.67 Volume 2.7M Avg Vol 4M Gross Margin 37.67 % Dividend Yield 0.00 % Is GE Aerospace stock a buy? About 75% of GE Aerospace sales come from commercial aerospace, a sector that has been impacted in recent years by issues at Boeing and supply constraints that have limited production of new aircraft. Both Boeing and Airbus have multiyear backlogs of future orders. GE Aerospace should benefit as these orders get filled, but the lack of new planes also works in the company's favor. Aerospace suppliers including GE tend to get higher margins on spare part sales and should benefit as airlines are forced to keep older planes in service for longer while awaiting deliveries. This is a cyclical business and all trends point to the cycle accelerating in the years to come. Shares of GE Aerospace are up 27% in the last six months, and the ingredients are in place for this company to fly higher in the quarters to come."
  },
  {
    "url": "https://www.insidermonkey.com/blog/should-you-consider-adding-ge-aerospace-ge-to-your-portfolio-1442233/",
    "url_mobile": "https://www.insidermonkey.com/blog/should-you-consider-adding-ge-aerospace-ge-to-your-portfolio-1442233/?amp=1",
    "title": "Should You Consider Adding GE Aerospace ( GE ) to Your Portfolio ? ",
    "seendate": "20250204T164500Z",
    "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2024/10/21044640/aircraft-464296_1280.jpg",
    "domain": "insidermonkey.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Share Aristotle Atlantic Partners, LLC , an investment advisor, released its “Core Equity Strategy” fourth quarter 2024 investor letter. A copy of the letter can be downloaded here . The U.S. stock market wrapped up the year positively, as the S&P 500 Index increased by 2.41% in the quarter. Aristotle Atlantic’s Core Equity strategy returned 4.11% gross of fees (4.00% net of fees) in the quarter outperforming the S&P 500 Index’s 2.41% total return. The relative outperformance was due to a mix of security selection and allocation effects. In addition, you can check the fund’s top 5 holdings to determine its best picks for 2024. Aristotle Atlantic Core Equity Strategy highlighted stocks like GE Aerospace (NYSE: GE ) in its Q4 2024 investor letter. General Electric Company, operating under the name GE Aerospace (NYSE:GE), develops and manufactures engines for commercial and military aircraft, The one-month return of GE Aerospace (NYSE:GE) was 17.43%, and its shares gained 84.41% of their value over the last 52 weeks. On February 3, 2024, GE Aerospace (NYSE:GE) stock closed at $204.11 per share with a market capitalization of $217.314 billion. Aristotle Atlantic Core Equity Strategy stated the following regarding GE Aerospace (NYSE:GE) in its Q4 2024 investor letter: “GE Aerospace (NYSE:GE) designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. The industry has high entry barriers and is concentrated among few players. Despite its cyclical nature, the demand for travel is driven by global middle-class growth. Boeing and Airbus have long order books, ensuring steady demand for engines and spare parts. The company also benefits from high-margin services for existing aircraft fleets, with services accounting for 70% of its commercial engine business. GE Aerospace serves customers worldwide. We see GE Aerospace making significant strides in its commercial engine business, which is expected to boost future services revenue growth. Over the past five years, the company has undergone substantial restructuring and simplification, including divesting its healthcare and energy businesses. The company now operates in three segments: Commercial Engines & Services (CES), Defense & Propulsion Technologies (DPT) and Insurance. Long-term revenue guidance is for high single-digit growth, and management has a goal of $10 billion in annual operating profit by 2028, with an expected 20% annual earnings growth. Following years of restructuring, we see GE Aerospace now positioned to return capital to shareholders through dividends and share repurchases.” A huge in-process machining center producing parts for aircraft and aerospace systems. GE Aerospace (NYSE:GE) is in 29th position on our list of 30 Most Popular Stocks Among Hedge Funds . As per our database, 95 hedge fund portfolios held GE Aerospace (NYSE:GE) at the end of the third quarter which was 86 in the previous quarter. While we acknowledge the potential of GE Aerospace (NYSE:GE) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock . In another article , we discussed GE Aerospace (NYSE:GE) and shared the list of stocks Jim Cramer recently discussed. In addition, please check out our hedge fund investor letters Q3 2024 page for more investor letters from hedge funds and other leading investors. READ NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks . Disclosure: None. This article is originally published at Insider Monkey . NYSE:GE Yahoo Finance Daily Newsletter Related Insider Monkey Articles Jim Cramer Discusses These 10 Stocks & Comments On OpenAI's Valuation Jim Cramer Discusses These 13 Stocks & Rejects The AI PC Super Cycle 10 Stocks Expected To Post Impressive Earnings This Week Jim Cramer Discussed 9 Stocks for This Week's Game Plan Why GE Stock Is Rallying Today General Electric Company (NYSE:GE) Q4 2024 Earnings Call Transcript"
  },
  {
    "url": "https://bdnews24.com/world/americas/493a5dc02c00",
    "url_mobile": "",
    "title": "US military flight deporting migrants to India",
    "seendate": "20250204T050000Z",
    "socialimage": "https://cdn.bdnews24.com/bdnews24/media/english/imgAll/2025February/PLATE/2025-01-25t210840z-521588020-rc21gca89jxv-rtrmadp-3-usa-trump-migration-military-1738637438.jpg",
    "domain": "bdnews24.com",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "World Americas US military flight deporting migrants to India, official says India is the farthest destination of the Trump administration's military transport flights for migrants A detained migrant waits to board a US Air Force C-17 Globemaster III aircraft for a removal flight at Fort Bliss, Texas, US January 23, 2025. Dept of Defense/US Army Sgt 1st Class Nicholas J De La Pena/Handout via REUTERS Reuters Published : 04 Feb 2025, 08:50 AM Updated : 04 Feb 2025, 08:50 AM A US military plane is deporting migrants to India, a US official said on Monday, the farthest destination of the Trump administration's military transport flights for migrants. President Donald Trump has increasingly turned to the military to help carry out his immigration agenda, including sending additional troops to the US-Mexico border, using military aircraft to deport migrants and opening military bases to house them. The official, speaking on the condition of anonymity, said the C-17 aircraft had departed for India with migrants aboard but would not arrive for at least 24 hours. The Pentagon has also started providing flights to deport more than 5,000 immigrants held by US authorities in El Paso, Texas, and San Diego, California. So far, military aircraft have flown migrants to Guatemala, Peru and Honduras. The military flights are a costly way to transport migrants. Reuters reported that a military deportation flight to Guatemala last week likely cost at least $4,675 per migrant. Follow bdnews24.com on Google News Related Stories Pakistan's army chief set to get expanded powers Delhi blast being probed under anti-terror law: media 12 die in suicide bombing in Pakistan capital Thailand suspends Cambodia ceasefire deal Read More Devotion lights up Rakher Upobash London councillors’ Bangladesh run leaves UK minister ‘appalled’ CMP chief orders ‘burst fire’ on armed criminals 18 fishermen missing for two months in sea Read More Opinion Julian Francis Remembering the great Bhola cyclone Anatul Fateh The Defection Biswadip Das 19 and counting: The price of independence in Bangladesh’s media Syed Badrul Ahsan The media are keepers of public conscience Read More"
  },
  {
    "url": "https://www.tribuneindia.com/news/diaspora/us-deports-indian-migrants-on-military-aircraft-amid-trumps-immigration-crackdown/",
    "url_mobile": "https://www.tribuneindia.com/news/diaspora/us-deports-indian-migrants-on-military-aircraft-amid-trumps-immigration-crackdown/amp",
    "title": "US deports Indian migrants on military aircraft amid Trump immigration crackdown",
    "seendate": "20250204T043000Z",
    "socialimage": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYWRhZDA4NTIwLWUyYTMtMTFlZi04ZGU2LTkzNGIzY2M4YTM2NC5qcGc=",
    "domain": "tribuneindia.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Add Tribune As Your Trusted Source Advertisement PREMIUM Explainers Defence Photo Gallery Cricket The Great Game Simply Punjab Simply Haryana UPSC Home / Diaspora / US deports Indian migrants on military aircraft amid Trump's immigration crackdown US deports Indian migrants on military aircraft amid Trump's immigration crackdown The C-17 aircraft had departed for India with migrants aboard but would not arrive for at least 24 hours Reuters Washington, Updated At : 01:40 PM Feb 04, 2025 IST Follow us Connect with us Photo for representation only. Reuters Advertisement A US military plane is deporting migrants to India, a US official said on Monday, the farthest destination of the Trump administration's military transport flights for migrants. Advertisement President Donald Trump has increasingly turned to the military to help carry out his immigration agenda, including sending additional troops to the US-Mexico border, using military aircraft to deport migrants and opening military bases to house them. Advertisement The official, speaking on the condition of anonymity, said the C-17 aircraft had departed for India with migrants aboard but would not arrive for at least 24 hours. Advertisement The Pentagon has also started providing flights to deport more than 5,000 immigrants held by US authorities in El Paso, Texas, and San Diego, California. So far, military aircraft have flown migrants to Guatemala, Peru and Honduras. Advertisement The military flights are a costly way to transport migrants. Reuters reported that a military deportation flight to Guatemala last week likely cost at least $4,675 per migrant. × Unlock Exclusive Insights with The Tribune Premium Take your experience further with Premium access. Thought-provoking Opinions, Expert Analysis, In-depth Insights and other Member Only Benefits Combo Yearly Monthly You are already Subscribed !! Already a Member? Sign In Now Advertisement Live Matches ❮ ❯ Tags : India Migrant Flights Military Deportation Advertisement Advertisement Advertisement The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and is run by a trust comprising five eminent persons as trustees. The Tribune, the largest selling English daily in North India, publishes news and views without any bias or prejudice of any kind. Restraint and moderation, rather than agitational language and partisanship, are the hallmarks of the newspaper. It is an independent newspaper in the real sense of the term. The Tribune has two sister publications, Punjabi Tribune (in Punjabi) and Dainik Tribune (in Hindi). Remembering Sardar Dyal Singh Majithia Home India World Sports Business Features Archive States Punjab Heart of Punjab Haryana Heart of Haryana Himachal Pradesh Himachal Calling Jammu & Kashmir Uttarakhand Uttar Pradesh Rajasthan Madhya Pradesh Chhattisgarh Cities Amritsar Bathinda Chandigarh Delhi Jalandhar Ludhiana Patiala Shaharnama Opinion Editorials Comment musings Letters To The Editor Latest News Tribune Defence UPSC Exam Mentor Exam Schedule Life Lifestyle Entertainment Movie Reviews Pollywood Arts Book Reviews Photo Gallery Weather India Pakistan News Move Ahead Jobs & Careers Health Science & Technology Coronavirus Schools Partner Exclusives Games Classifieds Grooms Wanted property for sale Situation Vacant To Let Education Other Classifieds Remembering B N Goswamy Remembering Nehru Reach us The Tribune Epaper The Tribune App - Android The Tribune App - iOS Punjabi Tribune online Punjabi Tribune Epaper Punjabi Tribune App - Android Punjabi Tribune App - iOS Dainik Tribune online Dainik Tribune Epaper Dainik Tribune App - Android Dainik Tribune App - ios Subscribe To Print Edition Contact Us About Us Code of Ethics Copyright © The Tribune Trust, 2024 Designed and developed by : Classifieds Videos Premium E-Paper Shorts"
  },
  {
    "url": "https://indianexpress.com/article/world/us-military-flight-deport-migrants-india-official-says-9815906/",
    "url_mobile": "https://indianexpress.com/article/world/us-military-flight-deport-migrants-india-official-says-9815906/lite/",
    "title": "US military flight deporting migrants to India , official says",
    "seendate": "20250203T230000Z",
    "socialimage": "https://images.indianexpress.com/2025/02/US-Deportation-Flights.jpg",
    "domain": "indianexpress.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "skip to content Advertisement Premium US deports Indian migrants using military plane amid Trump’s crackdown: Report This marks the Trump administration’s most distant military transport of migrants yet. By: Express Web Desk Washington | Updated: February 4, 2025 11:25 AM IST 3 min read Whatsapp twitter Facebook Reddit PRINT Migrants wearing face masks and shackles on their hands and feet sit on a military aircraft at Fort Bliss in El Paso, Tx., Thursday, Jan. 30, 2025, awaiting their deportation to Guatemala. (Photo: AP) A US military aircraft carrying Indian migrants has departed for India, marking the first deportation of its kind since President Donald Trump’s return to office, according to a US official who spoke to Reuters on Monday. The official confirmed that a C-17 military aircraft had taken off with Indian migrants on board, expected to arrive in India within 24 hours, Reuters reported. US expands military role in deportations Under Trump’s administration, the US military has been increasingly involved in immigration enforcement, deploying additional troops to the US-Mexico border, using military facilities to accommodate migrants, and employing military planes for deportations. Story continues below this ad Also read | Explained: India-US ties and the illegal immigration issue According to Reuters , previous deportation flights have sent migrants to Guatemala, Peru, and Honduras. However, this is the first time India has been included in the military deportation programme since Trump reassumed office. The Pentagon has now begun arranging flights to deport over 5,000 migrants detained in El Paso, Texas, and San Diego, California, the report added. Trump and Rubio discuss immigration with Indian leaders President Donald Trump and Secretary of State Marco Rubio have both raised concerns over illegal immigration from India in discussions with Prime Minister Narendra Modi and External Affairs Minister S. Jaishankar. Speaking about his talks with Modi, Trump stated that he expects India to “do what is right” in accepting the return of undocumented Indian migrants. Story continues below this ad The White House described the conversation between the two leaders as “productive,” highlighting discussions on ways to “expand and deepen” US-India cooperation. Meanwhile, Rubio raised the issue of “irregular immigration” with Jaishankar, who reiterated that India does not support illegal migration. “Illegal immigration is often linked to other unlawful activities. It is neither desirable nor beneficial for our reputation. If any of our citizens are found to be in the US illegally, and we verify their citizenship, we are open to their lawful return to India,” Jaishankar stated. Deportation costs and India’s response Military deportation flights are significantly more expensive than those operated by US Immigration and Customs Enforcement (ICE). Reuters reported that a single military deportation flight to Guatemala last week cost around $4,675 per migrant. (with inputs from agencies) Expand Stay updated with the latest - Click here to follow us on Instagram © IE Online Media Services Pvt Ltd Tags: India-US news US immigration Latest Comment Post Comment Read Comments Advertisement Man at the wheel: Umar Nabi, doctor who ‘motivated white-collar group’ India 3 hr ago Police suspect that Dr Umar Nabi Bhat was the leader of a terror module of doctors, including Dr Muzammil Ahmad Ganai and Dr Adeel Majeed Rather, who were involved in the recent Red Fort explosion. Bhat's family was taken away for questioning, while Ganai's family was shocked to learn of his involvement. View all shorts Live Blog Bihar Election 2025 Exit Polls LIVE Updates: NDA likely to retain power in Bihar, predict 9 exit polls 10 hours ago CAT 2025 Admit Card LIVE Updates: IIM Kozhikode to release hall ticket on Wednesday 13 hours ago Top News Headlines of November 11, 2025 | Singaporean moneylender who fatally stabbed debtor pleads guilty at the age of 80 after 33 years on the run 6 hours ago Bihar Election 2025 LIVE Updates: State sees highest-ever turnout since 1951 as 66.91% voters cast their ballots 10 hours ago PHOTOS In Pics: From Concept Supercars to Electric SUVs – Innovation at Bharat Mobility Global Expo 2025 Samsung launches Galaxy S25 series phones: Here’s a quick look CES 2025: A quick look at some of the most interesting gadgets announced this year Earth, space, and beyond: 12 new breathtaking images shared by NASA Lunar Eclipse 2022 images: Pictures of the last total lunar eclipse for next three years Top Stories Bihar sees highest ever turnout at 67.14% in final phase; exit polls predict NDA win Cities Red Fort blast: As police probe Lucknow link, woman doctor and her brother are taken into custody Entertainment Dharmendra Health Latest Update: Family says 89-year-old actor is recovering, responding to treatment Entertainment 'Dharmendra recovering, responding to treatment': Family shares update as Sunny and Bobby Deol visit ailing actor Trending ‘We don’t even have proper footpaths’: Indian vlogger’s Bangkok video exposes India’s urban planning woes Trending Bryan Johnson consumes magic mushrooms, shares ‘most satisfying things’ he discovered during experiment: ‘My heart had stopped’ Sports After life-changing Goa trip in 2002, Levon Aronian is back for a good time, but wins keep on coming Sports India vs South Africa: Temba Bavuma’s WTC champs get set for their hardest challenge Opinion India-Bhutan ties show how to get it right in a challenging neighbourhood How Delhi's Red Fort blast, first in capital in 13 years, marks a break from recent trend Lifestyle All about Transnistria, a place that doesn't exist on the world map Technology Meta's new speech-to-text AI models covers 1,600 languages, including rare Indian dialects Advertisement Must Read Sports After life-changing Goa trip in 2002, Levon Aronian is back for a good time, but wins keep on coming Sports India vs South Africa: Temba Bavuma’s WTC champs get set for their hardest challenge Sports Behind the rise and rise of armless archer Sheetal Devi: Lifting dumbbells with toes, improvised trigger and clay to strengthen grip Technology Meta's new speech-to-text AI models covers 1,600 languages, including rare Indian dialects Technology OnePlus 15: From expected price to specifications, here's everything we know so far Technology SoftBank has sold all its shares in Nvidia for $5.8 billion, turning focus to OpenAI Lifestyle All about Transnistria, a place that doesn't exist on the world map Advertisement Buzzing Now Trending ‘We don’t even have proper footpaths’: Indian vlogger’s Bangkok video exposes India’s urban planning woes Trending Bryan Johnson consumes magic mushrooms, shares ‘most satisfying things’ he discovered during experiment: ‘My heart had stopped’ Trending Noida man stuns internet after making a hole in Rs 1.5-crore flat’s wall with a pencil; triggers debate: ‘Gaon ke ghar isse zyada majboot hote hain’ Trending Employee opens up about company's toxic work culture: 'Team lead expects me to reply at 2.45 am after 14-hour duty' Trending ‘That’s going to be a forever memory’: Lionel Messi spotted in couple’s dating video on Barcelona street Nov 12: Latest News 01 UN believes hundreds were killed in Tanzania election protests 02 Singaporean moneylender who fatally stabbed debtor pleads guilty at the age of 80 after 33 years on the run 03 Shooting World Championships: Aishwary Pratap Singh Tomar, Esha Singh-Samrat Rana miss gold by a whisker 04 After life-changing Goa trip in 2002, Levon Aronian is back for a good time, but wins keep on coming 05 Serbian protesters vow to prevent real estate project linked to Trump son-in-law Kushner Advertisement Link Subscription Subscribe Sign In Today's Paper India Opinion Politics World Explained Business Horoscope Entertainment Bollywood Hollywood Television Web Series Sports Cricket Live Score Cities Delhi Mumbai Kolkata Pune Chandigarh Ahmedabad Lucknow Hyderabad Bangalore Technology Lifestyle Health Education Trending Top 10 Shorts My Express Photos Videos Audio Web Stories Newsletters Rss Trending Legal News UPSC Offer Bihar Elections Exit Poll Research Mini Crossword Fresh Take Archives 🎙️ Podcast Journalism of Courage Edition IND INT search Sign In Install the Express App for a better experience Featured My Express Premium UPSC Today's E-paper Nov 12, 2025 Trending Topics Legal News UPSC Offer Bihar Elections Exit Poll Research Mini Crossword Fresh Take Archives 🎙️ Podcast News Today's Paper India Opinion Politics World Explained Business Horoscope Entertainment Bollywood Hollywood Television Web Series Sports Cricket Live Score Cities Delhi Mumbai Kolkata Pune Chandigarh Ahmedabad Lucknow Hyderabad Bangalore Technology Lifestyle Health Education Trending Top 10 Shorts My Express Multimedia Photos Videos Audio Web Stories Newsletters Follow Us Facebook X Instagram LinkedIn YouTube RSS"
  },
  {
    "url": "https://www.koreaherald.com:443/article/10409323",
    "url_mobile": "https://m.koreaherald.com/article/10409323",
    "title": "Private sector - led space industry gears up for launches in 2025",
    "seendate": "20250131T051500Z",
    "socialimage": "https://wimg.heraldcorp.com/news/cms/2025/01/31/news-p.v1.20250131.9b1ea4b538d94730b57fb0ab4863f069_T1.jpg",
    "domain": "koreaherald.com",
    "language": "English",
    "sourcecountry": "South Korea",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Kan Hyeong-woo Subscribe +"
  },
  {
    "url": "https://kvia.com/news/el-paso/2025/01/29/texas-space-commission-awards-19-million-to-borderplex-alliance-for-aerospace-development/",
    "url_mobile": "",
    "title": "Texas Space Commission awards $19 million to Borderplex Alliance for aerospace development",
    "seendate": "20250130T030000Z",
    "socialimage": "https://kvia.b-cdn.net/2023/05/071G0130.00_00_00_29.Still001-860x484.jpg",
    "domain": "kvia.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "El Paso By Rishi Oza Published January 29, 2025 3:25 PM EL PASO, Texas (KVIA) -- El Paso County just announced that the Texas Space Commission is awarding $800,000 for the development of the West Texas Aerospace Corridor Master Plan. The project is lead by the county and the Midland Economic Development Corporation. It aims to create a comprehensive strategy for aerospace infrastructure, workforce development, and research in aerospace in the region. \"In addition to this award, the Texas Space Commission also awarded $19 million to the Borderplex Alliance, further demonstrating the state’s commitment to advancing aerospace development across the West Texas region,\" a county spokesperson explained today. \"These investments will foster economic growth, attract federal space missions, and create high-quality jobs for the local workforce. Article Topic Follows: El Paso Jump to comments ↓"
  },
  {
    "url": "https://www.yahoo.com/news/west-texas-secures-funding-awards-222329772.html",
    "url_mobile": "",
    "title": "West Texas secures funding awards for Aerospace Master Plan",
    "seendate": "20250130T004500Z",
    "socialimage": "https://media.zenfs.com/en/ktsm_articles_153/e0b403ce3ad72f01897e2f8031d76292",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Texas investing millions into El Paso for aerospace EL PASO, Texas ( KTSM ) – West Texas is a step closer to establishing itself as a leader in the aerospace industry with a $800,000 award from the Texas Space Commission to fund the development of the West Texas Aerospace Corridor Master Plan, El Paso County said on Wednesday, Jan. 29, in a news release. The County said this project, which is spearheaded by El Paso County in partnership with the Midland Economic Development Corporation, will create a “comprehensive strategy for aerospace infrastructure, workforce development, and research along the I-10 and I-20 corridors, solidifying the region’s place in the global aerospace landscape.” Additionally, the Borderplex Alliance was awarded $19 million from the Texas Space Commission to demonstrate the state’s commitment to advancing aerospace development across the West Texas region, the County said. Advertisement Advertisement Advertisement Advertisement The County said these investments will foster economic growth, attract federal space missions, and create high-quality jobs for the local workforce. “Last session, I was proud to help pass legislation and funding to create the Texas Space Commission, as well as provide a letter of support for the West Texas Aerospace Corridor Master Plan. This award marks a new chapter for our region, one that harnesses the potential of the space industry to fuel economic growth and create better-paying jobs in our community,” state Sen. César J. Blanco, D-El Paso, said. “El Paso is ready to take its place as a leader in aerospace innovation, turning dreams of exploration into a powerful engine for progress.” “These awards represent a monumental victory for West Texas, showcasing our region’s potential to lead in aerospace innovation while creating opportunities for our communities,” County Commissioner Iliana Holguin, Precinct 3, who also serves as the chair of the West Texas Spaceport Development Corporation, said. “The Texas Space Commission’s commitment to our region will undoubtedly pave the way for groundbreaking advancements.” “This funding is a game-changer for West Texas. By planning and coordinating infrastructure and workforce strategies, we are laying the foundation for decades of innovation and economic growth,” County Commissioner Sergio Coronado, Precinct 4, said. “We have the potential to lift up residents from at-risk populations into good-paying jobs and industries across our communities.” Advertisement Advertisement Advertisement Advertisement The Couty said the West Texas Aerospace Corridor Master Plan will bring together stakeholders across the region, including local governments, universities, and private sector partners, to assess current capabilities and chart a path forward for sustainable aerospace growth. “With the area’s unique geographic advantages, including its inland location, favorable weather conditions, and existing aerospace assets like Blue Origin’s Van Horn site, West Texas is poised to serve as a strategic hub for space exploration and innovation,” read the news release. Copyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. For the latest news, weather, sports, and streaming video, head to KTSM 9 News. About Our Ads"
  },
  {
    "url": "https://menafn.com/1109143867/GE-Aerospace-T901-Engine-Powers-Black-Hawk-For-First-Time-In-Successful-Ground-Runs",
    "url_mobile": "",
    "title": "GE Aerospace T901 Engine Powers Black Hawk For First Time In Successful Ground Runs",
    "seendate": "20250129T194500Z",
    "socialimage": "https://menafn.com/updates/pr/2025-01/29/PN_c6260image_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.marketscreener.com/quote/stock/ALTERA-CORPORATION-4845/news/Cranfield-University-Altair-and-Cranfield-University-Sign-MOU-to-Advance-Use-of-Simulation-Data-An-48899867/",
    "url_mobile": "",
    "title": "Cranfield University : Altair and Cranfield University Sign MOU to Advance Use of Simulation , Data Analytics , and AI - January 29 , 2025 at 05 : 04 am EST",
    "seendate": "20250129T103000Z",
    "socialimage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
    "domain": "marketscreener.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Cranfield University: Altair and Cranfield University Sign MOU to Advance Use of Simulation, Data Analytics, and AI Published on 01/29/2025 at 05:03 am EST - Modified on 01/29/2025 at 05:04 am EST Acquiremedia Share Altera Corporation -.--% Altair (Nasdaq: ALTR), a global leader in computational intelligence, and Cranfield University have signed a memorandum of understanding (MoU) to explore and expand the use of artificial intelligence (AI), simulation , and data analytics within the aerospace and robotics industries. The organisations will also support students, researchers, and startups looking to harness the power of computational intelligence within these industries. ' Cranfield University is a proven leader and innovator in aerospace and beyond,' said Pietro Cervellera , senior vice president of aerospace and defense, Altair . 'This MoU is just the first step in developing new breakthroughs and helping organisations of all kinds explore the immense power of simulation, data analytics, and AI within aerospace.' 'We're looking forward to working together with Altair to identify ways we can integrate technologies to support students and their research projects, and accelerate startups already working with Cranfield,' said professor Antonios Tsourdos, director of AI, robotics, and space, Cranfield University . 'We anticipate great things from our joint efforts and are delighted to work with Altair experts to drive next-generation aerospace innovation.' The agreement comes at a time when the convergence of AI, machine learning , data analytics, and simulation is increasingly pivotal in developing new innovations in areas like autonomous space exploration, Earth observation, telecommunications, and defense. (C) 2025 Electronic News Publishing, source ENP Newswire © Acquiremedia - 2025 Share"
  },
  {
    "url": "https://economictimes.indiatimes.com/industry/cons-products/electronics/aequs-to-set-up-mro-facility-this-year-plans-to-hire-more-people/articleshow/117579647.cms",
    "url_mobile": "https://m.economictimes.com/industry/cons-products/electronics/aequs-to-set-up-mro-facility-this-year-plans-to-hire-more-people/amp_articleshow/117579647.cms",
    "title": "Aequs to set up MRO facility this year , plans to hire more people",
    "seendate": "20250126T134500Z",
    "socialimage": "https://img.etimg.com/thumb/msid-117579679,width-1200,height-630,imgsize-5492,overlay-economictimes/articleshow.jpg",
    "domain": "economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Agencies BELAGAVI(KARNATAKA): Bullish on growth opportunities, contract manufacturer Aequs is set to strengthen its aerospace manufacturing capabilities , expand consumer segment footprint as well as set up an MRO this year. The company will also ramp up manpower by around 1,000 people in the financial year ending March 2026, according to its Chairman and CEO Aravind Melligeri. Aequs -- which provides vertically integrated product solutions for the aerospace and consumer goods industries, including high precision electronics components -- currently has around USD 120 million annual revenues. Airbus, Boeing, Collins and Safran are among the aerospace customers of Aequs, which also has facilities in France and the US. Elaborating on the future plans, Melligeri mentioned about expanding into the precision consumer electronics space and setting up the Maintenance, Repair and Overhaul (MRO) jointly with Canada's Magellan Aerospace Corporation in 2025. Initially, the facility will start with works for turboprop engines. Live Events \"Consumer electronics is also a field where we feel we can expand... consumer durables side, we initially focused on domestic market and now we will focus on the exports side,\" he said during an interaction here this week. Aequs operates a Special Economic Zone (SEZ) in Belagavi, Karnataka that offers an end-to-end manufacturing value stream, including forging, machining, surface treatment and aero assemblies. It is also the country's first notified precision engineering SEZ . At present, the company's aerospace vertical has around 1,800 staff and the plan is to add 300 to 400 more people this fiscal, Melligeri said. Overall, Aequs expects to increase its overall manpower, which is currently around 4,000, by another 1,000 more people. Melligeri said precision manufacturing is its core strength and added that on the consumer segment, \"we are talking to some smart ring makers... it is a growing market\". According to him, 60-70 per cent of the value addition to the products is happening in the SEZ. In financial year 2023-24, the company's aerospace segment raked in revenues of USD 100 million, accounting for a major chunk of Aequs' total revenues of around USD 120 million during that period. \"Apart from increasing the revenue, we are increasing the value add... aerospace business is profitable and Aequs group has a whole is profitable,\" Melligeri said. For the aerospace vertical alone, the target is to increase the revenues to USD 500 million from the current level of USD 100 million in the five-year period. Aequs along with Magellan Aerospace has a joint venture -- Aerospace Processing India Pvt Ltd (API) -- that provides chemical processing and surface treatments, among other works. SQuAD Forge is a joint venture with France's Aubert & Duval from France that produces forgings from aluminium, titanium, steel, and superalloys. Aerostructures Assemblies India (AAI) delivers small to medium complex sub-assemblies such as structural panels and fuselage doors for commercial aircraft. AAI manufactures Airbus Plug-door & Over Wing Exit Door (OWD) assemblies for A321 neo planes. About funding plans, Melligeri said the company has enough funds for now and if necessary, it will go for a rights issues to raise money. Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our Economic Times WhatsApp channel ) ( Originally published on Jan 26, 2025 ) Read More News on aerospace manufacturing capabilities precision engineering SEZ Aequs hiring plan consumer electronics expansion Aequs MRO facility (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on aerospace manufacturing capabilities precision engineering SEZ Aequs hiring plan consumer electronics expansion Aequs MRO facility (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less"
  },
  {
    "url": "https://www.investors.com:443/news/ge-aerospace-q4-2024-earnings-ge-stock/",
    "url_mobile": "",
    "title": "GE Aerospace Breaks Out On Booming Earnings , 2025 Guidance",
    "seendate": "20250123T231500Z",
    "socialimage": "https://www.investors.com/wp-content/uploads/2017/10/Stock-GE-07-shutter.jpg",
    "domain": "investors.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "GE Aerospace scored a breakout Thursday after the jet engine and defense manufacturer topped estimates for Q4 results, provided an optimistic outlook and stepped up shareholder returns. GE Aerospace ( GE ) reported adjusted earnings of $1.32 per share, up 103% from last year, on a 16% revenue increase to $9.9 billion. Those easily beat FactSet forecasts for earnings of $1.04 per share on $9.49 billion in sales. The earnings gain was the best in six quarters while it was the best revenue increase in years. Total orders during the quarter jumped 46% to $15.5 billion. The commercial engines & services (CES) segment had a 50% increase in orders to $12.95 billion, with 19% revenue growth to $7.65 billion. Defense and propulsion technologies (DPT) saw a 22% order increase to $2.84 billion with 4% revenue growth to $2.5 billion. GE Aerospace guided 2025 earnings to $5.10-$5.45 per share adjusted, with the midpoint just above FactSet estimates for $5.23 per share. The company expects low double-digit revenue growth, while FactSet predicts about 11% sales growth to $38.99 billion. GE Aerospace guided CES revenue to grow in the mid-teens, driven by a low-double-digit to mid-teen boost in services and equipment growth in the high-teens. DPT revenue growth is seen climbing in the mid- to high-single-digit range. GE Dividend Hike, Buyback GE Aerospace said it plans to hike its dividend by 30%. It also announced a $7 billion share buyback program. GE Aerospace Stock Set To Break Out GE stock rallied almost 10% early Thursday to clear a 194.80 buy point . Shares pared gains to 6.6% to close at 200.80. The move pushed GE Aerospace near the top of the buy zone, which extends to 204.54. Shares rebounded from the 200-day line on Jan. 13. On Jan. 14, GE Aerospace pushed above its 50-day moving average and broke a downtrend, offering an early entry. GE stock has advanced more than 20% in 2025. GE Vernova ( GEV ), which got General Electric's energy assets, rallied Wednesday to fresh highs despite a revenue miss. Boeing earnings are due on Jan. 28. You can follow Harrison Miller for more stock news and updates on X/Twitter @IBD_Harrison YOU MAY ALSO LIKE: Best Growth Stocks To Buy And Watch: See Updates To IBD Stock Lists Looking For The Next Big Stock Market Winners? Start With These 3 Steps Join IBD Live And Learn Top Chart Reading And Trading Techniques From Pros Learn How To Time The Market With IBD's ETF Market Strategy Bullish Trend Continues; AI Stocks, Tesla Test Key Levels"
  },
  {
    "url": "https://www.fool.com/data-news/2025/01/23/ge-aerospace-crushes-q4-eps-expectations/?source=iedfolrf0000001",
    "url_mobile": "",
    "title": "GE Aerospace Crushes Q4 EPS Expectations",
    "seendate": "20250123T160000Z",
    "socialimage": "https://cdn.content.foolcdn.com/images/1umn9qeh/production/f7bde8734a2bc7f6662c8e77fcdbd0c65ed80382-601x320.jpg",
    "domain": "fool.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "GE Aerospace ( GE 0.39% ) , a global leader in the design and manufacture of jet engines, delivered a stellar performance in its Q4 2024 earnings release on Thursday, Jan. 23. The company's adjusted EPS of $1.32 far exceeded the analyst estimate of $1.04, marking a 103% increase from the prior year's quarter. Adjusted revenue beat projections, totaling $9.9 billion compared to $8.55 billion last year, a 16% year-on-year increase. This strong performance indicates solid demand for aerospace products and effective strategic execution, despite some challenges in specific market segments like Defense & Propulsion Technologies. Metric Q4 2024 Analysts' Estimate Q4 2023 Change (YOY) Adjusted EPS $1.32 $1.04 $0.65 103% Adjusted revenue $9.9 billion $9.49 billion $8.55 billion 16% Operating profit $2.0 billion N/A $1.34 billion 49% Free cash flow $1.5 billion N/A $1.26 billion 21% Source: GE Aerospace. Note: Analyst consensus estimates for the quarter provided by FactSet. YOY = Year over year. Business Overview and Focus Areas GE Aerospace stands as a significant player in the aerospace industry , renowned for its advanced engines and technological innovations. The company focuses on maintaining its market position through strategic partnerships and product development. Notably, GE Aerospace has prioritized technological advances, such as the LEAP 1-A high-pressure turbine durability kit, essential for improving engine efficiency and lifespan. These innovations not only cement its competitive advantage but also align with industry demands for sustainability and efficiency. Financial performance remains a critical driver for the company's success, with a keen focus on revenue growth and profitability. The Q4 results underline its capability to maintain robust margins and cash flows, with strategic investments poised to support future expansions and technological developments. Expand NYSE : GE GE Aerospace Today's Change ( -0.39 %) $ -1.22 Current Price $ 310.72 Key Data Points Market Cap $329B Day's Range $ 307.05 - $ 312.72 52wk Range $ 159.36 - $ 316.67 Volume 2.7M Avg Vol 4M Gross Margin 37.67 % Dividend Yield 0.00 % Quarterly Highlights and Achievements GE Aerospace managed substantial order growth in Q4, rising 46% to $15.5 billion and suggesting strong market demand. This was complemented by significant contracts, such as a $1.1 billion deal with the U.S. Army. Such commitments underscore GE's role in modern aerospace technologies. On the financial front, Q4 managed exceptional growth in several core metrics. Operating profits climbed by 49% to $2.0 billion, supported by a profit-margin boost of 350 basis points, reaching 21.2%. This reflects strategic pricing and cost control measures. Additionally, adjusted revenue showcased a robust 16% increase compared to last year, affirming effective market strategies and customer engagement. GE Aerospace management said it plans to hike its $0.28 per-share dividend by 30%. It also announced a $7 billion share buyback program. Despite successes, challenges remain, particularly in supply chain management and geopolitical tension mitigation. Supply chain strategies enhanced material inputs by 26%, vital for operational continuity. The ability to address these challenges will be crucial for sustained growth in upcoming periods. Outlook and Future Prospects Looking ahead, GE Aerospace forecasts continued growth, supported by strategic investments and expanded production capacity. Management guided for 2025 adjusted earnings of $5.10-$5.45 per share, roughly matching the midpoint of analysts' consensus estimates. The company expects low double-digit revenue growth for the year and free cash flow between $6.3 billion and $6.8 billion. The anticipation of improved free cash flow and earnings in 2025 reinforces this optimistic stance. Management has indicated plans for a $1 billion investment in Maintenance, Repair, and Overhaul (MRO) facilities over five years, which is expected to bolster operational capabilities. Investors should monitor potential geopolitical influences and supply chain dynamics as these could impact future performance. Additionally, the company's ongoing focus on technological innovation and environmental sustainability remains critical to maintaining its competitive edge in the aerospace sector."
  },
  {
    "url": "https://www.prnewswire.com/news-releases/americas-frontier-fund-backs-breakthrough-hypersonic-engine-company-venus-aerospace-302357448.html",
    "url_mobile": "",
    "title": "America Frontier Fund Backs Breakthrough Hypersonic Engine Company Venus Aerospace",
    "seendate": "20250122T141500Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "Two-hour Global Travel Possible with Investment in New Engine Technology HOUSTON , Jan. 22, 2025 /PRNewswire/ -- Venus Aerospace, a trailblazer in hypersonic engine technology, is excited to announce an investment by America's Frontier Fund (AFF), a premier deep-tech investment firm focused on advancing American technological leadership. Continue Reading America’s Frontier Fund Backs Venus Aerospace Founded in 2020, Venus Aerospace has pioneered the world's most efficient hypersonic engines, positioning itself as a leader in the emerging hypersonic economy. Capable of speeds up to 4,600 mph – nearly six times the speed of sound – Venus' revolutionary VDR2 engine has the potential to enable commercial flights from Los Angeles to Tokyo in under two hours. AFF's investment will accelerate Venus's flight program with hypersonic propulsion and the development of hypersonic propulsion systems, developments that are sure to strengthen U.S. leadership in aerospace, defense, and energy innovation. Later this year, Venus plans to make history with the first atmospheric flight of the RDRE, demonstrating the significant potential for both defense and commercial markets with faster, more efficient, and longer-range vehicles. \"We're thrilled to have America's Frontier Fund join us on our journey,\" said Sassie Duggleby, CEO and Co-Founder of Venus Aerospace. \"AFF's commitment to pioneering technological advancements aligns seamlessly with our mission to enhance American competitiveness in hypersonics. Their deep-tech expertise and proven track record in scaling innovative companies will be invaluable as we work to achieve our goals.\" With this new round of funding, Venus aims to advance its cutting-edge VDR2 engine. By integrating RDRE's efficiency with air-augmentation technology capable of 2,000 pounds of thrust, the VDR2 engine will operate at even wider ranges of speeds and altitudes, a feat previously thought impossible until Mach 3.5. The company has a target to ground test the VDR2 later this year. \"AFF's investment in Venus Aerospace underscores our focus on supporting American companies that are revolutionizing industries of the future,\" said Jordan Blashek , Co-Founder and Managing Partner, AFF. \"With recent hypersonic advancements from China and Russia , safeguarding American innovation and securing our industrial base has never been more urgent. Venus Aerospace is poised to redefine hypersonic flight and ensure America's continued leadership in aerospace innovation.\" About Venus Aerospace Since its founding in 2020, Venus Aerospace has emerged as a trailblazer in the development of advanced propulsion technologies. The company's RDRE and VDR2 engines are pushing the boundaries of what is possible in high-speed flight across aviation, space, defense, and beyond. The Venus RDRE offers unmatched efficiency and compact design, with a variety of applications for both space and defense, while the VDR2 integrates RDRE and ramjet capabilities, delivering the only single-engine solution capable of takeoff to Mach 5+ speeds. Venus's groundbreaking engine technology will eventually power the Stargazer M4, the world's first Mach 4, reusable commercial aircraft. As the pinnacle of Venus's innovation, Stargazer represents the ultimate realization of their advanced propulsion systems. About America's Frontier Fund America's Frontier Fund (AFF) is the leader in building America's innovation capacity for global leadership. Through its venture funds, innovation studios, and strategic partnerships, AFF scales tomorrow's frontier-tech solutions to solve today's global challenges. AFF works in collaboration with the U.S. government and global allies to ensure America remains at the forefront of frontier innovation. Media Contacts: Rachael Yates Brand Marketing Manager [email protected] Jordan Valdés Public Relations America's Frontier Fund [email protected] SOURCE Venus Aerospace 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://menafn.com/1109113587/Azerbaijan-Proceeds-With-Trial-Against-Accused-In-Armenian-Military-Aggression-Related-Crimes-PHOTO",
    "url_mobile": "",
    "title": "Azerbaijan Proceeds With Trial Against Accused In Armenian Military Aggression Related Crimes ( PHOTO ) ",
    "seendate": "20250121T191500Z",
    "socialimage": "https://menafn.com/updates/pr/2025-01/21/TNA_e1660image_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.koreaherald.com:443/article/10403888",
    "url_mobile": "https://m.koreaherald.com/article/10403888",
    "title": "South Korea , united kingdom hold talks on joint defense exports",
    "seendate": "20250121T064500Z",
    "socialimage": "https://wimg.heraldcorp.com/news/cms/2025/01/21/news-p.v1.20250121.d93f4f91761c4ea782edf36a212daaea_T1.jpg",
    "domain": "koreaherald.com",
    "language": "English",
    "sourcecountry": "South Korea",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Hwang Joo-young Subscribe +"
  },
  {
    "url": "https://www.ksl.com:443/article/51225818/report-defense-industry-an-economic-heavyweight-in-utah",
    "url_mobile": "",
    "title": "Report : Defense industry an economic heavyweight in Utah",
    "seendate": "20250111T183000Z",
    "socialimage": "https://img.ksl.com/slc/3035/303513/30351319.jpg?filter=kslv2/responsive_story_lg",
    "domain": "ksl.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Estimated read time: 4-5 minutes KEY TAKEAWAYS The defense industry supported over 173,000 jobs in Utah in 2023. It contributed $22.2 billion to Utah's GDP, with Hill Air Force Base as a major hub. Federal defense jobs in Utah averaged $102,115, significantly higher than the state average. SALT LAKE CITY — At a time of relative peace and with fewer than 1% of Americans serving active duty in the military, it's easy to forget the economic impact of the defense industry — particularly in Utah. But in 2023, the defense industry directly and indirectly supported over 173,000 Utah jobs — about the size of the state's construction industry — and contributed an estimated $22.2 billion to the state's gross domestic product, according to a report released this week by the Kem C. Gardner Policy Institute. \"Utah continues to host many national defense businesses and military installations that provide vital contributions to our national security,\" said Kevin Sullivan, executive director and chief operating officer of the Utah Defense Alliance Board. Such contributions cast a wide net across Utah's diverse economy, according to Levi Pace, the report's lead author and a senior economist at the University of Utah's Gardner Institute. \"This industry is unique because almost 100% of its funding comes from out of state,\" Pace told the Deseret News. \"When I think of the military and the defense industry, I'm usually thinking about active duty personnel and our National Guard service members, who carry a heavy load. But it's also a lot of civilian and contractor jobs. That's where we've seen some of the higher-paying jobs or higher growth, which supports our military preparedness and service members.\" The Gardner report revealed several key economic findings from fiscal year 2023: Employment — Utah's defense industry directly provided 49,540 military and civilian jobs — 2% of the state's employment. Income — Utah's federal defense workforce earned over $3.5 billion in compensation in 2023, representing 2.5% of the statewide total. Compensation for federal defense jobs in Utah averaged $102,115 — about one-third more than the state's average ($77,801) paid by all other jobs. Contracts — Of Utah's total of $5.9 billion total in defense contracts in 2023, $5.2 billion (almost 90%) went to 10 contractors — including Northrop Grumman, with $3.5 billion. Job impact — The defense industry directly and indirectly supported over 173,000 full- and part-time jobs — mostly related to Hill Air Force Base, federal support for Utah veterans, defense contracts and grants, and the Utah National Guard. GDP impact — Utah's defense industry directly or indirectly contributed an estimated $22.2 billion in GDP. That's 7.8% of the statewide total for all industries. Fiscal impacts — Defense-related activity in Utah generated net fiscal impacts of $431.3 million for the state government, based on estimated revenues of $841.5 million versus expenditures of $410.2 million. Hill AFB's deep economic reach It's difficult to overstate the primacy of Hill Air Force Base in Utah's defense industry. Stretching across Davis and Weber counties, it's the state's premier military installation in terms of budget, staffing, land area and technology, according to the report. \"Hill Air Force Base has been the anchor of the defense industry in Utah for decades,\" said Pace. \"More than half of the (state's) federal jobs in defense are at Hill AFB. \"Much of the burgeoning aerospace industry — planes, missiles, drones — along with cybersecurity and communications all revolve around Hill AFB,\" Pace said. In 2023, Hill AFB employed 4,853 active duty military personnel, 1,067 Air Force reservists — and a whopping 14,787 federal civilian employees. That's almost 10% of the total employment in Davis County. Additionally, Hill AFB remains a major draw for government contractors. More than 6,200 employers of government contractors from the private sector worked on the base in 2023, according to the Gardner report. \"We're kind of an Air Force state,\" said Pace. Besides Hill AFB, the Gardner report identified several other \"major defense components\" contributing to Utah's economy — including Dugway Proving Grounds, Tooele Army Depot, and the Utah National Guard. Meanwhile, federal support for veterans and retired defense department civilians impacts local and state economies in several ways — including Veterans Affairs health clinics and military pensions. In 2023, Utah companies, military installations and other institutions were awarded over $6 billion in federal defense contracts and grants, according to the report. Some of the top defense contractors in Utah included Northrop Grumman, L3Harris Technologies, Utah State University and Advantaged Solutions. Looking ahead: Defense and Utah's economy and jobs Federal employment in the defense sector has been \"very stable\" in recent years — and Pace expects that to continue. \"Where I would expect to see more growth and innovation,\" he said, \"would be in the contracting of aerospace and different kinds of technologies around our defense and military preparedness.\" Pace also noted that the defense industry typically boasts above-average pay. \"The military is hiring people in virtually every occupation that you might see in the private sector,\" he said. \"Many of those jobs are from advanced STEM or really creative-type jobs. So there's a lot of (job) potential for contractors and on bases, as well.\" × The Key Takeaways for this article were generated with the assistance of large language models and reviewed by our editorial team. The article, itself, is solely human-written. Most recent Business stories US airlines cancel 1,200 flights Tuesday as government shutdown continues House returns to Washington for vote to end government shutdown Salt Lake City's historic Tower Theatre may look more like its old self with new plans Related topics Science Utah Business Jason Swensen  Jason Swensen is a Deseret News staff writer on the Politics and the West team. He has won multiple awards from the Utah Society of Professional Journalists. Swensen was raised in the Beehive State and graduated from the University of Utah. He is a husband and father — and has a stack of novels and sports biographies cluttering his nightstand. More stories you may be interested in House returns to Washington for vote to end government shutdown 'Open and ready': Clearfield Job Corps still operating despite program's uncertain future Free Utah boxing gym transforms lives of 'at-risk' youth"
  },
  {
    "url": "https://www.aa.com.tr/en/world/turkish-baykar-may-cooperate-with-italian-defense-giant-leonardo-after-acquiring-piaggio/3446992",
    "url_mobile": "",
    "title": "Turkish Baykar may cooperate with Italian defense giant Leonardo after acquiring Piaggio",
    "seendate": "20250110T154500Z",
    "socialimage": "https://cdnuploads.aa.com.tr/uploads/Contents/2025/01/10/thumbs_b_c_e1a21fa59533de096509b767a357e73d.jpg?v=172116",
    "domain": "aa.com.tr",
    "language": "English",
    "sourcecountry": "Turkey",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "World Turkish Baykar may cooperate with Italian defense giant Leonardo after acquiring Piaggio Turkish UCAV producer Baykar technologies continues to expand its footprint in Europe Mücahithan Avcıoğlu | 10.01.2025 - Update : 10.01.2025 ISTANBUL Turkish unmanned combat aerial vehicle (UCAV) producer Baykar might forge cooperation with Italian defense giant Leonardo following its recent acquisition of Piaggio Aerospace, the country’s minister of enterprises and Made in Italy said Thursday. \"The sale of Piaggio Aerospace to Turkish Baykar allows the relaunch of a strategic company and allows us to outline a broader technological and industrial partnership between Italy and Türkiye, which will also have significant developments in other projects of great interest for our country,” Adolfo Urso said at question time in the Senate. \"In this context of strengthening industrial relations between Italy and Türkiye, we are studying further alliances with companies in the sector such as Leonardo to strengthen our aerospace sector and our leadership in the EU,\" he added. Last month, Baykar announced the acquisition of Piaggio Aerospace, Italy's long-established aerospace company, founded in 1884. Aerospace and defense giant Leonardo is the 13th-largest defense company in the world and the second-largest in Europe, according to the Stockholm International Peace Research Institute. Anadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options. Related topics Baykar Technology Italy Leonardo Piaggio Aerospace Science and Technology Bu haberi paylaşın World World voices solidarity with Türkiye after military plane crash Rescue teams at site of Turkish military plane crash on Georgia-Azerbaijan border Lavrov denies Russian nuclear tests, dismisses Trump's claim as 'misunderstanding' Russia sanctions 30 Japanese nationals Russian, Kazakh presidents meet informally ahead of official summit to strengthen bilateral ties Related news Italian president warns of 'unacceptable allusions' to use weapons of mass destruction Italy urges US to resolve pay delays for local staff at American bases amid government shutdown Italy’s centenarian population surges, women make up majority: Report Palestinian president, Italian premier discuss Gaza ceasefire, two-state solution Italy's largest union calls general strike on Dec. 12 against Meloni government's budget law WHO says over 16,500 people in Gaza need urgent medical care"
  },
  {
    "url": "https://www.military.com/money/personal-finance/best-personal-finance-tools-and-resources-military-households.html",
    "url_mobile": "https://www.military.com/money/personal-finance/best-personal-finance-tools-and-resources-military-households.html?amp",
    "title": "The Best Personal Finance Tools and Resources for Military Households",
    "seendate": "20250110T151500Z",
    "socialimage": "https://images03.military.com/sites/default/files/styles/full/public/2025-01/military%20personal%20financial%20counseling%201800%20x%201200.jpg",
    "domain": "military.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "military",
    "article_text": "John Willcockson, Airman and Family Readiness Center personal financial counselor, discusses financial strategies with Liz Archuleta, personal financial readiness lead and Air Force Aid Society officer, at Schriever Space Force Base (then-Schriever Air Force Base), Colorado, Oct. 23, 2018. (Dennis Rogers/Air Force) Military.com | By Amanda Miller Published January 10, 2025 Editor's note: This is the fifth installment of New Year, New You , a weeklong look at your financial health headed into 2025. Growing up, your family may have been among the millions of American households that simply didn't talk about finances. Now that you're part of the military or a military household, you can start making up for that fact with the benefits and tools tailored to military life, many of which are exclusively available to service members. Because so much of the U.S. military is young -- with 40% under age 25 -- the Defense Department has in recent years prioritized \"financial readiness\" to help mitigate some of the challenging aspects of managing personal finances as a military member, such as unpredictable deployment s or frequent household moves. To help jump-start your 2025 financial transformation, we've put together this list of some of the most extensive and frequently cited resources of financial information and advice for members of the military: Free Personal Financial Counseling U.S. service members can consult dedicated personal financial counselors for free help navigating money issues through the Military OneSource program. The counselors can meet online, over the phone or in person to help evaluate financial accounts and plans or for pointers on how to negotiate with creditors. Troops can access unlimited counseling sessions throughout their careers. They can request a session by calling Military OneSource at 800-342-9647, through the live chat on the Military OneSource website, or by contacting their installation's Financial Readiness Program or their service or reserve component's Military and Family Support Center. Military OneSource Content The Military OneSource program's 14 MilLife Guides provide introductions and links to tools to help with topics including the Blended Retirement System , Borrowing, Budgeting and Saving, Controlling Debt, Financial Management (two guides), Food Security, Getting Settled in the Military, Higher Education for Your Children, Housing and Living, Military Flexible Spending Accounts, Taxes, Benefits and Protecting Your Finances. Military OneSource provides information in a range of formats, including courses and podcasts . Office of Financial Readiness Website At the website of DoD's Office of Financial Readiness (FINRED), service members and families can start with a Financial Well-Being Assessment and enter scenarios into the office's calculator tools for savings, loans, taxes, debt and retirement , figuring out how much they need to save long term with the Retirement Nest Egg Calculator and Retirement Planner for Two Working Spouses Calculator. In addition to articles and videos explaining financial topics and military benefits , FINRED hosts the military services' service-specific curriculum materials for financial literacy education in its Learning Resource Library . Military-Oriented Organizations and Nonprofits A number of organizations outside the military provide information online for military households, particularly on financial topics, such as: The Learning Hub of the American Armed Forces Mutual Aid Association (AAFMAA), the self-described \"longest-standing nonprofit association exclusively serving the U.S. military community.\" The Finance page of the Military Officers Association of America (MOAA) and MOAA's Military State Report Card and Tax Guide . The military-specific resources of the Financial Industry Regulatory Authority's Investor Education Foundation. Military.com's Financial Columnists Kate Horrell and JJ Montanaro draw from their careers in the financial sector and their backgrounds as a military spouse and a veteran, respectively, in their articles for Military.com. Horrell, an accredited financial counselor and personal financial educator, wrote two of the installments in this series: \"Investing for Junior Troops: A Guide to Making Your Money Multiply\" and \"What to Look for on Your January Leave and Earnings Statement.\" Meanwhile, it's actually never too late to consult Montanaro's year-end financial action plan . Previous parts in this series: Part 1 : 2025 Guide to Pay and Allowances for Military Service Members, Veterans and Retirees Part 2 : What to Look for on Your January Leave and Earnings Statement Part 3 : Investing for Junior Troops: A Guide to Making Your Money Multiply Part 4 : What to Do with Your 2025 Military Pay Raise Get the Latest Financial Tips Whether you're trying to balance your budget, build up your credit, select a good life insurance program or are gearing up for a home purchase, Military.com has you covered. Subscribe to Military.com and get the latest military benefit updates and tips delivered straight to your inbox. Story Continues Related Topics: Military Life Family Life Family and Spouse Spouse and Family Benefits Personal Finance Family Finances Thrift Savings Plan - TSP Military Retirement Spouse Retirement Blended Retirement By Amanda Miller About Amanda Miller Amanda Miller is an editor and writer specializing in coverage of military and veteran pay and benefits, along with other financial topics, for Military.com. Read Full Bio © Copyright 2025 Military.com. All rights reserved. This article may not be republished, rebroadcast, rewritten or otherwise distributed without written permission. To reprint or license this article or any content from Military.com, please submit your request here ."
  },
  {
    "url": "https://www.marketscreener.com/quote/stock/GE-AEROSPACE-4823/news/GE-Aerospace-received-an-order-for-210-engines-in-Poland-48716697/",
    "url_mobile": "",
    "title": "GE Aerospace : received an order for 210 engines in Poland",
    "seendate": "20250109T151500Z",
    "socialimage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
    "domain": "marketscreener.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "GE Aerospace: received an order for 210 engines in Poland Published on 01/09/2025 at 09:38 am EST - Modified on 01/09/2025 at 09:44 am EST - Translated by Marketscreener Legal disclaimer Contact us to request a correction Back - See original Share GE Aerospace -0.39% GE Aerospace has received an order for 210 T700 engines to power the Polish Armed Forces' 96 Boeing AH-64E Apache Guardian helicopters. The engine order follows a cooperation agreement signed in August 2024 between GE Aerospace and the Polish Ministry of National Defense. ' This order strengthens our relationship with Poland and expands GE Aerospace's Polish Armed Forces fleet, which includes F404-powered FA-50 fighter jets, T700-powered Sikorsky S-70i Black Hawks and CT7-powered Leonardo AW149 and AW101 helicopters. said Amy Gowder, President and CEO of Defense and Systems at GE Aerospace. Copyright (c) 2025 CercleFinance.com. All rights reserved. © MarketScreener.com - 2025 Share"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/ge-aerospace-receives-t700-engine-order-for-polands-apache-guardian-helicopters-302346115.html",
    "url_mobile": "",
    "title": "GE Aerospace Receives T700 Engine Order for Poland Apache Guardian Helicopters",
    "seendate": "20250108T173000Z",
    "socialimage": "",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "CINCINNATI , Jan. 8, 2025 /PRNewswire/ -- GE Aerospace (NYSE: GE ) received an order for 210 T700 engines to power the 96 Boeing AH-64E Apache Guardian helicopters for the Polish Armed Forces. \"This T700 engine is the engine of choice for medium-sized helicopters with its exceptional performance, reliability, and durability,\" said Amy Gowder , President and CEO of Defense & Systems at GE Aerospace. \"This order strengthens our relationship with Poland and expands the Polish Armed Forces' GE Aerospace-powered fleet, which includes F404-powered FA-50 fighter jets, T700-powered Sikorsky S-70i Black Hawks, and CT7-powered Leonardo AW149 and AW101 helicopters.\" The engine order follows a cooperative agreement signed in August 2024 between GE Aerospace and the Polish Ministry of National Defense. Under that agreement, Military Aviation Works in Deblin (Wojskowe Zakłady Lotnicze NR 1 S.A. or WZL-1) will provide licensed MRO support for the T700 engines on the Apache as well as the Sikorsky S-70i Black Hawk, and CT7 engines on Leonardo AW149 and AW101 helicopters that are in the Polish Armed Forces aircraft fleet. Military University of Technology in Warsaw (Wojskowa Akademia Techniczna or WAT) will manage training, including T700/CT7 engine training, for Polish technicians, military personnel, and WZL-1 employees who will support the helicopter fleet as well as preparing future engineering staff for the Polish Armed Forces. The cooperative agreement between GE Aerospace, WZL-1, and WAT will sustain high-value jobs in Poland and provide new areas of engine maintenance, repair, and overhaul (MRO) technology, training, and technical assistance for the defense industrial base, enabling Polish industry to support the Polish Armed Forces in sustainment of the Apache fleet. With these partnerships, the Polish Ministry of National Defense will have a full engine depot and engine training capabilities in country. These capabilities will ensure that the Polish Ministry of National Defense has supply security for all platforms powered by the T700/CT7 engine line. The agreement also paves the way for future partnerships in Poland on GE Aerospace's combat engines like the F110, F414, and F404. The T700/CT7 family of turboshaft and turboprop engines powers 15 types of military and civilian helicopters and fixed-wing aircraft with more than 130 customers in more than 50 countries. More than 25,000 T700/CT7 engines have been delivered and accumulated more than 130 million total flight hours. The T700/CT7 design has proven itself in the harshest environments, logging millions of flight hours in hot-harsh combat zones like Iraq and Afghanistan . In Europe , more than 1,300 T700/CT7 engines have been delivered or are on order for 20 European military and para-military customers. The engines will be built and delivered under a contract with the U.S. Army through the U.S. government's Foreign Military Sales process. In June 2024 , the U.S. Army awarded GE Aerospace an Indefinite Delivery Indefinite Quantity (IDIQ) contract for the continued production of up to 950 T700 engines in support of Army, Navy, Air Force, Marines, Coast Guard, Foreign Military Sales (FMS) and other government agency program requirements through 2029. About GE Aerospace GE Aerospace (NYSE: GE ) is a global aerospace propulsion, services, and systems leader with an installed base of approximately 44,000 commercial and 26,000 military aircraft engines. With a global team of 52,000 employees building on more than a century of innovation and learning, GE Aerospace is committed to inventing the future of flight, lifting people up, and bringing them home safely. Learn more about how GE Aerospace and its partners are defining flight for today, tomorrow and the future at www.geaerospace.com . GE Aerospace's presence in Poland spans over 30 years with more than 2,000 high-skilled employees based at six facilities who are developing the next-generation aerospace technologies for defense and commercial customers. With a total of $700M in country investment since 1992 and an annual $50M investment solely into R&D projects, GE Aerospace is proud to remain Poland's long-term strategic partner. For more information, visit us at www.GEAerospace.com SOURCE GE Aerospace 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://en.antaranews.com/news/340474/indonesia-japan-actively-pursue-collaboration-in-defense-technology",
    "url_mobile": "",
    "title": "Indonesia , Japan actively pursue collaboration in defense technology",
    "seendate": "20250107T130000Z",
    "socialimage": "https://cdn.antaranews.com/cache/1200x800/2025/01/07/IMG20250107100527.jpg",
    "domain": "en.antaranews.com",
    "language": "English",
    "sourcecountry": "Indonesia",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Jakarta (ANTARA) - Indonesian Minister of Defense Sjafrie Sjamsoeddin received a visit from his Japanese counterpart, Gen. Nakatani, on Tuesday to explore the potential for an exchange of military technology to strengthen their countries' defense posture. Brig. Gen. Frega Ferdinand Wenas Inkiriwang, head of the Indonesian Defense Ministry's Bureau of Defense Information, made the statement during a press conference following the bilateral meeting at the ministry's office in Central Jakarta. He underlined that the Defense Ministry views Japan as one of the world's most formidable military powers, renowned for its cutting-edge defense technologies. On that note, Inkiriwang remarked that his office is optimistic about the possibility of collaboration on military technology with Japan, which could improve the posture and capacity of the Indonesian Armed Forces (TNI). Moreover, he added that exchanging defense technology with Japan is expected to enhance Indonesia's capacity to counter potential cyber threats. In view of this, the official stated that both the Indonesian and Japanese delegations were on the same page about the need to pay special attention to defense posture in cyberspace. Inkiriwang, however, highlighted that the meeting did not touch upon the rumored co-manufacturing of a Mogami-class frigate between the two countries. \"The meeting discussed a transfer of defense technology. Based on my observations, it (the frigate) was not mentioned,\" he informed the media. Earlier, Defense Minister Sjafrie Sjamsoeddin personally welcomed Japan's Gen Nakatani at his office at around 10 a.m. local time. During a military welcome ceremony, the two ministers saluted their respective national flags and conducted a troop inspection before proceeding to a convention room for a closed-door bilateral meeting. Related news: Indonesia, Japan to Start New Era of Military Cooperation Related news: Indonesia open to Japan defense equipment offer: observer Translator: Walda M, Tegar Nurfitra Editor: Rahmad Nasution Copyright © ANTARA 2025"
  },
  {
    "url": "https://www.king5.com/article/news/crime/kohberger-defense-sanctions-prosecution-missing-expert-reports/293-70fe456d-0a16-4ce2-83d9-d92236406af6",
    "url_mobile": "",
    "title": "Kohberger defense team demands expert reports in high - profile murder case",
    "seendate": "20250104T001500Z",
    "socialimage": "https://media.king5.com/assets/KREM/images/505e625b-d74a-4e62-ad56-9c6046b4915e/20241121T000111/505e625b-d74a-4e62-ad56-9c6046b4915e_1140x641.jpg",
    "domain": "king5.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Crime Court to decide on defense motion for complete expert disclosures in Kohberger case The defense is seeking a court order that requires the prosecution to provide all detailed expert reports in the case. To stream KING 5 on your phone, you need the KING 5 app. Download the KING 5 app More Videos Next up in 5 Example video title will go here for this video Next up in 5 Example video title will go here for this video BOISE, Idaho — In another development in the case against Bryan Kohberger , the man accused of killing four University of Idaho students in an off-campus home, the defense has filed a motion asking the court to compel the prosecution to provide complete expert disclosures. In the court documents, the defense says the bulk of the State’s expert disclosures failed to include both opinions and reports. The defense says that only being given incomplete disclosures will “greatly prejudice Mr. Kohberger who is obligated to submit defense guilt phase expert disclosures by January 23, 2025.” In the documents, the defense says on December 18 the prosecution only disclosed 25 experts, and of those, only five had actual expert reports. The defense said that there are over 68 terabytes of discovery in the case and they added that it is all “extremely disorganized.” The defense is seeking a court order that requires the prosecution to provide all detailed expert reports. They are also asking for possible sanctions which include excluding non-compliant expert testimony or extending the defense’s deadline for disclosures. The court is expected to review the motion and decide whether to grant the defense’s request. Judge Steven Hippler ruled in November that Kohberger could face the death penalty if convicted . A final pre-trial conference is set for May 15, 2025, and will continue through May 16, 2025, if needed. Jury selection is scheduled to start on July 30, 2025. Kohberger’s trial is scheduled to start on August 11, 2025, and will run through November 7, 2025, including the penalty phase, if necessary. Kohberger is accused of killing Madison Mogen, Ethan Chapin, Xana Kernodle and Kaylee Goncalves in November 2022. Close Ad"
  },
  {
    "url": "https://www.al-monitor.com/originals/2025/01/buoyed-drones-nato-deals-turkey-defense-exports-hit-record-71b",
    "url_mobile": "",
    "title": "Buoyed by drones , NATO deals , Turkey defense exports hit record $7 . 1B",
    "seendate": "20250103T173000Z",
    "socialimage": "",
    "domain": "al-monitor.com",
    "language": "English",
    "sourcecountry": "Israel",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "defense",
    "article_text": "Buoyed by drones, NATO deals, Turkey defense exports hit record $7.1B The total value of defense exports surpassed Ankara's $6.5 billion target, with significant deals with European countries. Ezgi Akin Jan 3, 2025 A Turkish Bayraktar TB2 combat drone is displayed during a presentation at the Lithuanian Air Force Base in Siauliai, Lithuania, on July 6, 2022. — PETRAS MALUKAS/AFP via Getty Images عربي 简体中文 Español ANKARA — Turkey’s defense industry exports surpassed $7.1 billion last year, the head of Turkey's Defense Industry Agency (SSB) announced Friday, marking a significant milestone. “In 2024, our defense and aviation industry exports, including NATO and service exports, reached a new record by increasing by 29%, reaching $7.154 billion,” SSB Chairman Haluk Gorgun wrote on X. The figure exceeded Turkey’s 2024 defense export target of $6.5 billion. Gorgun also noted that Turkey exported defense products to 180 countries but did not provide further details. Turkey is poised to further increase its defense exports. A leading international arms fair held in October resulted in export agreements totaling $4.6 billion. Turkey’s NATO ally Spain agreed to purchase 24 Hurjet jet trainers, produced by Turkish Aerospace Industries (TUSAS), under a memorandum of understanding signed between the two countries in December. In the same month, Turkey’s state-owned Defense Technologies Engineering Corporation signed a deal with the Portuguese navy to build two replenishment ships. The agreements marked the first exports of manned Turkish jets and military vessels to Turkey’s NATO allies. In 2023, Turkey’s defense exports amounted to $5.5 billion, according to data from the Turkish Presidency’s Defense Industries Directorate. Leading Turkish defense exporters include TUSAS and Aselsan, the country's top defense electronics company as well as Baykar, which is owned by the family of Turkish President Recep Tayyip Erdogan’s younger son-in-law, Selcuk Bayraktar. The combined revenues, including exports, of these three companies exceeded $6 billion in 2024, according to the Stockholm International Peace Research Institute . In late December, Baykar made headlines by acquiring Italian aviation company Piaggio Aerospace as Turkey’s presence in the European defense market grew. “The world’s largest UCAV company, Baykar, outbid rivals from several countries in a competitive tender for the sale of Piaggio Aerospace,” the company said in a statement. Related Topics Defense/Security cooperation Turkish economy"
  },
  {
    "url": "https://www.mondaq.com:443/unitedstates/shareholders/1561074/honeywell-aerospace-divestiture-signals-aerospace-growth-cycle",
    "url_mobile": "",
    "title": "Honeywell Aerospace Divestiture Signals Aerospace Growth Cycle",
    "seendate": "20250102T074500Z",
    "socialimage": "http://www.mondaq.com/images/MondaqThumb.png",
    "domain": "mondaq.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "ITA",
    "industry": "Aerospace & Defense",
    "search_keyword": "aerospace",
    "article_text": "ARTICLE 2 January 2025 Honeywell Aerospace Divestiture Signals Aerospace Growth Cycle R Riveron More Contributor Founded in 2006, Riveron professionals simplify and solve complex business problems. We partner with CFOs, private equity firms, and other stakeholders to maximize outcomes. Riveron teams bring industry perspective and a full suite of solutions focused on the office of the CFO, M&A, and distress. In 2023, the company was acquired by affiliates of Kohlberg & Company from H.I.G. Capital – which is continuing its partnership with Riveron through a minority investment. Riveron has 18 global offices. Explore Firm Details The Honeywell Board of Directors indicated that, under the direction of CEO Vimal Kapur, it is undertaking a comprehensive review of its holdings to determine ways to \"unlock shareholder value,\" including spinning off... United States Corporate/Commercial Law David Nolletti To print this article, all you need is to be registered or login on Mondaq.com. Article Insights David Nolletti’s articles from Riveron are most popular: with readers working within the Banking & Credit industries Riveron are most popular: within Law Department Performance and Environment topic(s) The Honeywell Board of Directors indicated that, under the direction of CEO Vimal Kapur, it is undertaking a comprehensive review of its holdings to determine ways to \"unlock shareholder value,\" including spinning off its profitable aerospace business unit. Honeywell Aerospace Technologies manufactures a variety of end items, including avionics, flight control devices, and propulsion systems, and it has robust exposure to aftermarket opportunities, which typically provides a strong margin upside compared to the role of an original equipment manufacturer. I think this speaks positively to the long-term secular growth trends of the aerospace industry and Honeywell Aerospace can expect more growth than most other business units within Honeywell, thus the likely spin-off, which mirrors General Electric's creation of multiple stand-alone businesses from its former conglomerate structure. Commercial aerospace and aviation has experienced a very tough run over the last six years as a result of the COVID-19 pandemic, skyrocketing inflation, rising interest rates, supply chain issues, etc. The fact that we are seeing companies like Honeywell position their most valuable assets for the best equity appreciation possible indicates that the executive leadership and the board believe that is where profitable growth will come from for the foreseeable future. I love the aerospace industry , and although it is dealing with one of the most turbulent and uncertain times in the history of the sector, aerospace opportunities are still viewed as an incredible way to generate shareholder value. The content of this article is intended to provide a general guide to the subject matter. Specialist advice should be sought about your specific circumstances. Authors David Nolletti"
  }
]