[
  {
    "url": "https://cointelegraph.com/news/decentralized-solver-pools-offer-a-solution-to-liquidity-fragmentation-in-defi",
    "url_mobile": "",
    "title": "Decentralized solver pools offer a solution to liquidity fragmentation in DeFi",
    "seendate": "20240930T194500Z",
    "socialimage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/storage/uploads/view/8ac2dd03b4edcafc3f81d22bda8fa5d0.jpg",
    "domain": "cointelegraph.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "finance",
    "article_text": "Nihatcan Yanik Sep 30, 2024 Decentralized solver pools offer a solution to liquidity fragmentation in DeFi Fragmented liquidity and complex cross-chain transactions have made DeFi less accessible for users. Listen 0:00 14438 Spotlight Sponsored Content Clip Finance aims to simplify the DeFi experience with decentralized solver pools and a one-click solution for seamless cross-chain liquidity. The decentralized finance (DeFi) space is enjoying an explosive growth, with forecasts expecting DeFi to reach $48 billion by 2031. However, the underlying tech faces a fundamental problem — liquidity is scattered across an expanding ecosystem of blockchains. Users often find themselves navigating a web of bridges, protocols and complicated processes. Making the end-user a part of the backend processes, this fragmentation leads to wasted capital, high transaction costs and missed opportunities. As DeFi matures, the demand for a more efficient way to access liquidity across multiple chains grows. Yet, the complexity of building cross-chain solutions has resulted in high barriers to entry, keeping the benefits of DeFi confined to a select group of sophisticated users. Without a simpler and more effective way to manage liquidity across different platforms, the dream of a truly interconnected financial ecosystem remains out of reach. Decentralized solver pools for cross-chain transactions Clip Finance, a universal capital coordination protocol, steps into the fragmented DeFi landscape with a mission to make cross-chain liquidity accessible to everyone. The platform allows users to deposit assets across multiple blockchains with a single click, eliminating the complexity that has plagued DeFi users. Decentralized solver pools, which tackle the issue of liquidity fragmentation head-on, are at the heart of Clip Finance’s innovation. These pools enable users to stake their assets, which are then used to facilitate and fulfill cross-chain transactions. By contributing to these pools, users help bridge liquidity across different blockchains. The process is powered by solvers — decentralized nodes that monitor, propose and validate transactions across chains. This decentralized system distributes transaction fulfillment and breaks down the traditional barriers that limit cross-chain liquidity access to only a few entities, making it more inclusive and efficient. How Clip Finance’s decentralized solver pools work. Source: Clip Finance Liquidity providers can earn yield in this decentralized process by contributing to real transaction activity. Instead of relying on token emissions, as many DeFi projects do, Clip Finance’s model offers yield driven by real capital utilization, aligning growth with tangible activity in the ecosystem. Simplicity meets efficiency Clip Finance’s one-click cross-chain transaction system offers users a simpler way to move liquidity between blockchains and deposit into DeFi strategy from any other chain. What used to require multiple steps — navigating different platforms, dealing with approvals and worrying about bridge security — can now be handled with just a single click. Streamlining asset movement, Clip Finance integrates directly with DeFi protocols and offers a software development kit (SDK) that enables other platforms to incorporate this one-click solution. By reducing the technical overhead, Clip Finance empowers more users to participate in DeFi, opening the doors to a more inclusive financial system. Tokenomics that incentivize growth Another key differentiator for Clip Finance is its tokenomics model. Unlike many DeFi platforms that release tokens based on the passage of time, Clip Finance ties token unlocks to the platform’s total value locked (TVL) growth. This means that as the platform scales, users who contribute liquidity are directly rewarded in alignment with the platform’s success. Clip Finance’s roadmap. Source: Clip Finance This performance-based token model incentivizes long-term engagement and growth, ensuring that rewards are tied to the actual expansion of the Clip Finance ecosystem. “Money across different blockchains will be consolidated in a way where end-users will not know whether their stablecoins are on Ethereum, Linea, Solana, Sui, Apros or any other chain,” said Clip Finance CEO Artur Schaback, adding: “They will simply be able to use their stablecoin like it’s in their wallet.” With its decentralized solver pools and one-click cross-chain deposit functionality, Clip Finance opens new doors for liquidity providers and users to earn yield from real market activity, not just inflationary token emissions. By simplifying liquidity management and enhancing cross-chain interoperability , platforms like Clip Finance help DeFi realize its full potential as a truly interconnected, accessible financial system. Learn more about Clip Finance Disclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice. # Technology # Adoption # DeFi # Liquidity # Cointelegraph Accelerator"
  },
  {
    "url": "https://www.livemint.com/market/ipo/manba-finance-ipo-listing-date-gmp-experts-signal-gains-of-over-30-upon-debut-on-stock-market-today-11727631018663.html",
    "url_mobile": "https://www.livemint.com/market/ipo/manba-finance-ipo-listing-date-gmp-experts-signal-gains-of-over-30-upon-debut-on-stock-market-today/amp-11727631018663.html",
    "title": "Manba Finance IPO listing date : GMP , experts signal gains of over 30 % upon debut on stock market today",
    "seendate": "20240930T031500Z",
    "socialimage": "https://www.livemint.com/lm-img/img/2024/09/30/600x338/IPO_Rossaribiotech_listing_PTI_1628323849253_1724152290693_1727657073202.jpg",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "finance",
    "article_text": "View Market Dashboard Manba Finance IPO listing date: GMP, experts signal gains of over 30% upon debut on stock market today Manba Finance IPO listing date: Manba Finance IPO GMP and experts signal strong listing to share on stock market today led by strong demand for its IPO. Ankit Gohel Published 30 Sep 2024, 06:18 AM IST Manba Finance IPO listing date is today, September 30. Manba Finance IPO Listing: Manba Finance shares are set to make their stock market debut today after the staggering response to its initial public offering (IPO). Manba Finance IPO listing date is today, September 30. Manba Finance IPO was open from September 23 to September 25 and was heavily oversubscribed. Manba Finance IPO listing date has been fixed today. “Trading Members of the Exchange are hereby informed that effective from Monday, September 30, 2024, the equity shares of Manba Finance Limited shall be listed and admitted to dealings on the Exchange in the list of ‘T’ Group of Securities,” a notice on the BSE said. Manba Finance shares will be in the Trade-for-Trade segment for 10 trading days, it added. Further, Manba Finance stock will be a part of Special Pre-open Session (SPOS) on Monday, September 30, and will be available for trading from 10:00 AM. Also Read | Upcoming IPOs: 3 issues, 12 listings to keep primary market buzzing this week Ahead of the Manba Finance share listing, investors look out for trends in the grey market to gauge the listing price. Manba Finance IPO grey market premium (GMP) today ahead of the listing indicates a decent debut. Analysts also expect Manba Finance IPO listing to be at a strong premium. Manba Finance IPO GMP Today Manba Finance shares are commanding a decent premium in the unlisted market. Manba Finance IPO GMP today is ₹ 37 per share, according to stock market experts. This suggests that in the grey market, Manba Finance shares are trading higher by ₹ 37 than their issue price. Manba Finance IPO Listing Price Considering the issue price and the Manba Finance IPO GMP today, the estimated listing price of Manba Finance shares is ₹ 157 apiece, which is at a premium of 31% to the IPO price of ₹ 120 per share. Analysts also expect Manba Finance shares to list at a premium of 30-40% on the back of strong demand for its IPO. “Manba Finance Ltd’s offering saw impressive demand, with a subscription rate over 224 times, signaling a strong debut today, potentially at a 30-35% premium. With improving RoCE margins, reduced NPAs, and expansion plans, investors who have been allotted shares are advised to hold their position from a medium to long-term perspective,” said Akriti Mehrotra, Research Analyst, Stoxbox. Also Read | Manba Finance IPO: Flat GMP signals subdued debut expectations ahead of listing Manba Finance’s AUM grew at a 37.5% CAGR from FY22 to FY24, reaching ₹ 9,368.6 million, while profit after tax rose to Rs. 314.2 million. Operating across six states with over 1,100 dealers, Manba has expanded into personal, business, and used car loans, Mehrotra noted. According to Amit Goel, Co-Founder and Chief Global Strategist at Pace 360, Manba Finance IPO looks fully priced based on FY24 earnings. “We expect a listing at around ₹ 175 - 180 per share, resulting in a listing gain of around 45%. After the IPO, we advise investors to record short-term profits,” Goel said. Manba Finance IPO Details Manba Finance IPO opened for subscription on Monday, September 23, and concluded on Wednesday, September 25. The IPO allotment date was September 26 and the Manba Finance IPO listing date is today, September 30. The equity shares of Manba Finance will be listed on both the stock exchanges, BSE and NSE. The company raised ₹ 150.84 crore from the book-built issue which comprised entirely a fresh issue of 1.26 crore shares. Manba Finance IPO price band was ₹ 114 to ₹ 120 per share. Also Read | IPO frenzy: Hyundai, Swiggy, etc to raise ₹60,000 crore in 60 days Manba Finance IPO was subscribed by a staggering 224.10 times in total. The public issue was bought 144.03 times in the retail category and 148.55 times in the Qualified Institutional Buyers (QIB) category. The Non Institutional Investors (NII) portion was booked 511.65 times, according to NSE data. The company proposes to utilise the net issue proceeds towards augmenting the capital base to meet the company’s future capital requirements. Hem Securities is the book running lead manager of the Manba Finance IPO, while Link Intime India Private Ltd is the IPO registrar. Read all IPO news here Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before making any investment decisions. IPO IPO Listing Get Latest real-time updates Catch all the Business News , Market News , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates. Business News Markets IPO Manba Finance IPO listing date: GMP, experts signal gains of over 30% upon debut on stock market today HDFC Bank Share Price Reliance Industries Share Price TCS Share Price Infosys Share Price HUL Share Price More Story Url has been added to your clipboard Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue"
  },
  {
    "url": "https://www.citizen.co.za/business/fsca-imposed-r943-million-in-penalties-debarred-156-people/",
    "url_mobile": "https://www.citizen.co.za/business/fsca-imposed-r943-million-in-penalties-debarred-156-people/amp/?utm_source=flipboard&utm_content=MelissaJaco2020magazineThe%20Citizen",
    "title": "FSCA imposed about R943 million in penalties and debarred 156 people",
    "seendate": "20240927T173000Z",
    "socialimage": "https://media.citizen.co.za/wp-content/uploads/2024/09/FSCA-report.jpg",
    "domain": "citizen.co.za",
    "language": "English",
    "sourcecountry": "South Africa",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "FSCA fines moving firm R1.1 million for offering insurance unauthorised"
  },
  {
    "url": "https://news.webindia123.com/news/Articles/World/20240927/4239742.html",
    "url_mobile": "",
    "title": "CBUAE reviews latest developments in exchange businesses",
    "seendate": "20240927T113000Z",
    "socialimage": "",
    "domain": "news.webindia123.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Wednesday, November 12, 2025 Advertise with us News SEARCH NEWS NEWS HOME » WORLD CBUAE reviews latest developments in exchange businesses Share Tweet COMMENT Middle East | September 27, 2024 3:42:00 PM IST Abu Dhabi [UAE], September 27 (ANI/WAM): Khaled Mohamed Balama, Governor of the Central Bank of the UAE (CBUAE), hosted a high-level roundtable with the Chairman and representatives of the Foreign Exchange and Remittance Group, to discuss updates and developments in the exchange business in the UAE, in the presence of the CBUAE Assistant Governors. The strategic dialogue focuses on key developments in the exchange business sector in the UAE. The participants highlighted the critical contribution of exchange houses to the national financial services landscape with more than 1000 exchange house branches operating across the UAE. CBUAE discussed its main priorities in prudential supervision, market conduct, AML/CFT, and regulatory developments pertaining to exchange businesses. The participants also recognised the progress of exchange business in Emiratisation efforts and digitalisation of financial services in the UAE. Balama said, \"We at the Central Bank are keen to enhance the regulatory framework and develop the services provided by exchange houses to support the progress of the financial sector in the UAE.\" He added, \"Our meeting emphasises the importance of regular open dialogue with various licensed financial institutions, to address initiatives aimed at developing the financial sector and infrastructure, and to follow up on the Emiratisation efforts to increase the participation of national cadres in the financial sector, including exchange houses.\" (ANI/WAM) LATEST COMMENTS () POST YOUR COMMENT Comments Not Available POST YOUR COMMENT TRENDING TOPICS Tariff , GST , Diwali , Iran , election , Zubeen , Trump , Mamdani , Bihar , sensex , Israel , Congress , BJP , Ladakh , Modi , pahalgam , Pakistan , cricket , Naxal , Budget CITY NEWS Delhi Mumbai Kolkata Chennai Bangalore Kochi MORE CITIES MORE WORLD NEWS Delhi Blast: Canada PM Carney, Guyanese ... 'Despite the Delhi blast, PM Modi consid... EAM Jaishankar meets German, French, Bra... 1020 MW Punatsangchuu-II Hydroelectric P... EAM Jaishankar meets UK Foreign Secretar... 'India unequivocally rejects the baseles... More... INDIA WORLD ASIA Delhi, J-K hold candlelight march in sol... Indian Army concludes 'Exercise Maru Jwa... 'Should be investigated properly': Congr... Rajasthan Deputy CM condemns Delhi car b... IIM Kozhikode to host 6th Globalising In... Exit polls pointing towards Mahagathband... More... Delhi Blast: Canada PM Carney, Guyanese ... 'Despite the Delhi blast, PM Modi consid... EAM Jaishankar meets German, French, Bra... 1020 MW Punatsangchuu-II Hydroelectric P... EAM Jaishankar meets UK Foreign Secretar... 'India unequivocally rejects the baseles... More... Asim Munir due for another promotion, li... HRCP slams Pakistan's border management ... Pakistan army turns guns on its own citi... Pakistan's energy future at risk amid un... Pakistan's forces accused of butchering ... Russia blasts Pakistani daily for spread... More... Top Stories EAM Jaishankar meets German, French... 1020 MW Punatsangchuu-II Hydroelect... \"Should be investigated properly\": ... PM Modi, Bhutan King hold discussio... Rajasthan Deputy CM condemns Delhi ... IIM Kozhikode to host 6th Globalisi... EAM Jaishankar meets UK Foreign Sec... Exit polls pointing towards Mahagat... Information About Us Advertise with us Enquiry Sitemap Terms & Conditions Privacy Policy Free Slot India Disclaimer Explore Webindia123 News and Press Releases Education And Career Video Shows Indian online bet Movie And Celebrity Events Deals And Discounts Yellow Pages/ Business Contacts Photo Gallery Classified/ Personal Ads Automobiles Realestate/ Properties for sale Copyright Suni Systems (P) Ltd, 2000 - 2025. All Rights Reserved"
  },
  {
    "url": "https://www.myjoyonline.com/bog-directs-banks-to-submit-strategies-aimed-at-reducing-financial-fraud/",
    "url_mobile": "",
    "title": "BoG directs banks to submit strategies aimed at reducing financial fraud",
    "seendate": "20240918T100000Z",
    "socialimage": "https://www.myjoyonline.com/wp-content/uploads/2024/06/bogn-1024x683.jpg",
    "domain": "myjoyonline.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Audio By Carbonatix The Bank of Ghana (BoG) says it has tightened its supervisory and monitoring systems in the financial sector to reduce the alarming number of fraud cases. This was after its latest annual Fraud Report showed that the number of staff involved in fraudulent activities in banks and Specialized Deposit-Taking Institutions (SDIs) rose from 188 in 2022 to 274 in 2023, representing an increase of 46 percent. In addition money lost through fraud cases increase by 7 percent to hit 88 million cedis in the same period under assessment. Speaking to Joy Business, the Deputy Director of the Financial Stability Department at the BoG, Dr. John Dadzie disclosed that measures have been outlined to compel banks to submit a roadmap to curing the canker. “The Bank of Ghana is concerned about fraud prevention across all banks. We do not differentiate between institutions with higher or lower fraud rates. Upon releasing our reports, we write to all banks to submit strategies outlining their plans to minimize fraud incidence and related losses”, he said. Dr. Dadzie stated that the aim of the BoG is reduce fraud in the financial sector to the lowest level to discourage staff and the public from being enticed to engage in fraudulent acts. He added that it is the wish of the bank to stop from fraudulent activities from occurring in the first place. “Fraud is fraud and from the regulators point of view, we are looking at not having fraud situations at all. Even if a bank has one or two incidences of fraud, the impact could be very significant”, he pointed out. Declining to mention specific names of banks involved, Dr. Dadzie said the mandate of the central bank is to put in measures that will prescribe punitive actions for anybody involved in fraud in the financial sector. “The Bank of Ghana is very much concerned not just in terms of who has more or less. Fraudulent activities are unacceptable, and from a regulator point of view, we aim to eliminate such occurrences entirely. Even isolated incidents of fraud can have significant consequences for banks”. DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: BoG Ghana DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Ghana loses $200m annually to disasters – NADMO Tension in Ogbojo: Immigration officials attempt forcible removal of US deportees from hotel KNUST holds International Sustainability Conference to advance Ghana’s development agenda Explainer: How Ghana’s Z-9 helicopter crashed Caller tunes vs. streaming: The Ghanaian reality Cedi rally cools off; one dollar going for GH¢11.95 at forex bureaus Ghana hosts maiden Africa Education Trust Fund Artificial Intelligence Conference Towards a quality revolution in Ghanaian life Leading a central bank has never been for the faint-hearted – Dr. Asiama tells colleagues Joseph Cudjoe writes: Declare a state of emergency in Ghana’s small-scale mining sector now Most Popular News Latest Stories Trump asks Supreme Court to overturn E Jean Carroll verdict 45 minutes China needs its youth to spend but they are embracing frugality 56 minutes British prime minister Starmer will fight attempts to replace him, allies say 1 hour EdTech for special needs: Inclusive education for all 5 hours HeFRA shuts down Tamale Technical University Hospital over safety violations 5 hours Abu Jinapor raises serious issues about the Ewoyaa lithium mining lease agreement between the Government of Ghana and Barari DV Ltd 5 hours Increase budget to agriculture sector to at least 10% of GDP – Chamber of Agribusiness to government 5 hours Ghana loses $200m annually to disasters – NADMO 5 hours Bank of Ghana announces new foreign exchange operations framework 5 hours Father and son convicted to a fine for stealing and assault 5 hours Refuse collector jailed 10 years for attempting to rob US diplomat 6 hours BBC must fight to restore trust, Nandy tells MPs 6 hours GTEC directs NaCCA Deputy Director-General to cease using invalid SMC ‘Dr’ title 6 hours COP 30: Climate finance remains Africa’s top priority 6 hours MTN Ghana highlights SME support at 2025 SMEGA Awards 6 hours"
  },
  {
    "url": "https://www.prokerala.com/news/articles/a1564786.html",
    "url_mobile": "",
    "title": "Somalia secures grant to reform financial system",
    "seendate": "20240917T151500Z",
    "socialimage": "",
    "domain": "prokerala.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Mogadishu, Sep 17 : The African Development Bank Group (AfDB) said it has approved a grant of $6.6 million to strengthen Somalia's financial architecture for inclusive and equitable growth. AfDB said in a statement issued on Monday that the Somalia Financial Sector Development Project will also enhance financial sector expertise through targeted training and assistance. The project will focus on improving the capacity of financial institutions, including the Central Bank of Somalia, the Somali Development and Reconstruction Bank, and the Financial Reporting Center, to formulate efficient credit delivery and implement anti-money laundering and counter-terrorism financing measures, Xinhua news agency reported. \"This will also build robust national financial systems that offer increased long-term finance availability, reduced intermediation costs, and improved financial infrastructure,\" said Ahmed Attout, AfDB's director of the Financial Sector Development Department. Somalia has long grappled with security threats from armed groups that depend on illicit financing, and strengthening its financial institutions is thus crucial for its stability and that of the wider Horn of Africa region, according to the AfDB. AfDB said the reforms seek to build a competitive and globally connected financial sector in Somalia, enhancing stability, trust, and financial inclusion, and attracting private investment. \"This is a timely intervention that will enhance governance, accountability, skills, and technology development while fostering private sector growth through regulatory improvements and financial sector development,\" Attout said. According to the Bank, institutional barriers, as well as insecurity, have made Somalia's integration into the global financial system difficult. The absence of intermediary and correspondent banking services has further isolated the country from international financial networks, limiting critical remittance inflows."
  },
  {
    "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1227332",
    "url_mobile": "",
    "title": "Somalia secures grant to reform financial system",
    "seendate": "20240917T151500Z",
    "socialimage": "",
    "domain": "daijiworld.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Mogadishu, Sep 17 (IANS): The African Development Bank Group (AfDB) said it has approved a grant of $6.6 million to strengthen Somalia's financial architecture for inclusive and equitable growth. AfDB said in a statement issued on Monday that the Somalia Financial Sector Development Project will also enhance financial sector expertise through targeted training and assistance. The project will focus on improving the capacity of financial institutions, including the Central Bank of Somalia, the Somali Development and Reconstruction Bank, and the Financial Reporting Center, to formulate efficient credit delivery and implement anti-money laundering and counter-terrorism financing measures, Xinhua news agency reported. \"This will also build robust national financial systems that offer increased long-term finance availability, reduced intermediation costs, and improved financial infrastructure,\" said Ahmed Attout, AfDB's director of the Financial Sector Development Department. Somalia has long grappled with security threats from armed groups that depend on illicit financing, and strengthening its financial institutions is thus crucial for its stability and that of the wider Horn of Africa region, according to the AfDB. AfDB said the reforms seek to build a competitive and globally connected financial sector in Somalia, enhancing stability, trust, and financial inclusion, and attracting private investment. \"This is a timely intervention that will enhance governance, accountability, skills, and technology development while fostering private sector growth through regulatory improvements and financial sector development,\" Attout said. According to the Bank, institutional barriers, as well as insecurity, have made Somalia's integration into the global financial system difficult. The absence of intermediary and correspondent banking services has further isolated the country from international financial networks, limiting critical remittance inflows. Follow Daijiworld News Network on Top Stories"
  },
  {
    "url": "https://www.graphic.com.gh/business/business-news/financial-sector-fraud-unacceptable.html",
    "url_mobile": "",
    "title": "Financial sector fraud unacceptable",
    "seendate": "20240917T060000Z",
    "socialimage": "https://www.graphic.com.gh/images/2024/sept/16/B_OG.jpg#joomlaImage://local-images/2024/sept/16/B_OG.jpg",
    "domain": "graphic.com.gh",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Dr Ernest Addison — BoG Governor Financial sector fraud unacceptable Graphic Business Editorial Business News Sep - 17 - 2024 , 04:50 It has emerged that the level of fraud cases reported within the country’s financial services sector is still rising despite efforts by the Bank of Ghana to get players within the industry to check the practice. For instance, data collated from the three sub-sectors, banks, Special Deposit Taking Institutions (SDIs), and Payment system platforms (PSPs) indicated that overall, the count of fraud cases increased to 15,865 in 2023 from 15,164 in 2022, reflecting a 5% rise. These cases, the report noted, corresponded to a total loss value of approximately GH¢88 million in 2023 as compared to GH¢82 million in 2022, indicating an increase of about 7%. This staling revelation was contained in the publication of the annual Fraud Report by the Bank of Ghana (BOG), 2023, which seeks to create awareness of fraud occurrences and trends identified within the reporting year with the view to promote the soundness and integrity of the banking system. The 2023 report presents fraud typologies observed in relation to services provided by banks, SDIs and PSPs. (Read the full story on the front page). The Graphic Business finds the development worrying just as it is a disturbing trend because it speaks ill of a sector that is battling to recover fully from the impact of the government’s Domestic Debt Exchange Programme (DDEP). We believe that considering the value of a financial sector to the development of every economy, there should be no room for such sad events which goes to undermine confidence and trust in such an important sector. What we believe, should not be lost on us is the fact that the level of financial inclusion in the country is still low despite the use of electronic payments and, therefore, such cases further goes to reduce the confidence people have in the sector. We also want to remind the players in the sector that the impact of the banking sector reforms, coupled with the DDEP, has seriously affected the confidence people have in the financial sector and, therefore, it behoves them to strictly follow the BoG directives to ensure that they minimise or better still, reverse this worrying trend. It is increasingly becoming evident that the players in the financial services sector are dropping the ball by focusing more on deposit mobilisation without putting in the necessary measures in a sustained manner to check such fraudulent activities within their institutions. The Graphic Business is very oblivious to the competition within the sector and what players are doing to win more customers to stay afloat within the environment. However, it is equally crucial to note that the measures needed to fully secure the deposits of their customers are paramount. It will be unacceptable in our opinion, for any player within the sector to assume that they will take up the cost when such incidents arise. Our strong point is premised on the fact that the more the cost emanating from fraudulent practices within the financial sector rises, the more the institutions find ways to pass on the cost to their customers in a subtle way. There are countless instances where financial institutions develop lame excuses to raise their charges abysmally at the expense of their customers and this is why we believe that such fraudulent acts within their systems, which gives them reasons to do so, must be checked at all costs to save the customer. Going through the report, we find that the BoG has introduced new directives that these financial institutions must follow as a way to check the practice. The Graphic Business expects that the financial sector players will strictly adhere to the directives no matter the extent to which it might create some discomfort or inconvenience for their customers. To us, there is a need for financial institutions to start a campaign to educate their customers and the public regarding the directives and the reasons adduced so that their customers will bear with them when they execute the directives. We need a sound, flexible and potent financial sector. Its relevance to the building of our economy should also not be lost on us at any point through complacency or otherwise because without a strong financial sector, there will not be a strong economy. From Around The Web © 2005 - 2025 Graphic Online | Graphic Communications Group Ltd."
  },
  {
    "url": "https://tribuneonlineng.com/acamb-seeks-stronger-collaboration-between-npdc-financial-sector/",
    "url_mobile": "",
    "title": "ACAMB seeks stronger collaboration between NPDC , financial Sector",
    "seendate": "20240912T171500Z",
    "socialimage": "https://tribuneonlineng.com/wp-content/uploads/2024/01/ndpc.jpg",
    "domain": "tribuneonlineng.com",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "SHARE President of the Association of Corporate Affairs Managers of Banks in Nigeria (ACAMB), Rasheed Bolarinwa is advocating for a stronger working relationship between the Nigerian Data Protection Commission (NDPC) and players in Nigeria’s banking and financial sector. During a working visit to the NDPC headquarters in Abuja on Monday, Bolarinwa met with Dr. Vincent Olatunji, the National Commissioner/CEO of NDPC, to discuss aligning efforts on regulatory oversight and data protection compliance. Bolarinwa emphasised the importance of minimizing regulatory risks by fostering a clear understanding of the NDPC’s mandate within the financial sector. He stressed that reducing data protection infractions and ensuring compliance, can only be achieved through stronger communication and advocacy efforts. As both the ACAMB President and Chairman of NIPR’s Finance Hub Management Committee, Bolarinwa urged the Data Protection Commission to enhance awareness campaigns about its operations, pledging ACAMB’s full support in this endeavor. He highlighted ACAMB’s commitment to helping financial service providers better understand the Commission’s objectives, thereby ensuring compliance with data protection laws. He added, “As social engineers responsible for managing perception and corporate reputation, we cannot afford to have our brands breach the Data Protection Act. Such violations, according to him has could damage corporate trust and harm the business’s long-term sustainability.” In response, Olatunji assured ACAMB of the NDPC’s willingness to collaborate with financial sector players, clarifying that the Commission’s role is not punitive but rather to ensure full compliance with the Data Protection Act. He welcomed ACAMB and NIPR Finance Hub’s offer to support the Commission’s advocacy efforts. NDPC top brass who joined the CEO to host the ACAMB were; Babatunde Bamigboye Esq. Head Legal Enforcement and Regulations Dept; Mrs. Fitto Watirayhel Danladi; Head People Management & Administrator and Olayinka Oyebanji, Technical Advisor to the National Commissioner/CEO. The NDPC’s mandate is to safeguard individuals’ data privacy rights, foster safe personal data transactions, and prevent the misuse of personal data, among other objectives. ALSO READ THESE TOP STORIES FROM NIGERIAN TRIBUNE CBN directs payment service providers to begin PoS transaction tracking EXPOSED!! POPULAR ABUJA DOCTOR REVEALED HOW NIGERIA MEN CAN NOW NATURALLY AND PERMANENTLY CURE POOR ERECTION,QUICK EJACULATION, SMALL AND SHAMEFUL SIZE , WITHOUT SIDE EFFECTS. EVEN IF YOU ARE HYPERTENSIVE,DIABETES, OR BATTLING PROSTRATE...STOP THE USE OF HARD DRUG FOR SEX!! IT KILLS!. WATCH TOP VIDEOS FROM NIGERIAN TRIBUNE TV Back to School, Back to Business A Fresh Start Relationship Hangout: Public vs Private Proposals – Which Truly Wins in Love? “No” Is a Complete Sentence: Why You Should Stop Feeling Guilty Relationship Hangout: Friendship Talk 2025 – How to Be a Good Friend & Big Questions on Friendship Police Overpower Armed Robbers in Ibadan After Fierce Struggle Get real-time news updates from Tribune Online! Follow us on WhatsApp for breaking news, exclusive stories and interviews, and much more. Join our WhatsApp Channel now TAGGED: Association of Corporate Affairs Managers of Banks in Nigeria (ACAMB) Nigerian Petroleum Development Company (NPDC) Share This Article Facebook Email Print Previous Article Ibadan Circular Road corridor residents appeal to Makinde over setback Next Article Edo guber: Gov Otti rallies support for Akpata Most Read Strike suspension: ASUU gives update on negotiation with FG Wike: Four things to know about Major General Sarham Trump's threat: New twist as US congressman proposes sanctions on Nigeria I have over 500 body counts, slept with seven women at once — Adult film actor UK issues fresh travel warning for six Nigerian states over rising insecurity Pastor Adeboye, Tinubu, Trump and truth Kukah and a nation of marabouts Killings in Nigeria: Donald Trump spoke the truth — Orji Kalu VIDEO: Wike, naval officer in shouting match over alleged illegal land in Abuja Again, Court stops PDP National Convention Frontpage Today Subscribe to e-Paper"
  },
  {
    "url": "https://www.pymnts.com/news/banking/2024/57percent-of-americans-trust-financial-institutions-to-protect-their-data/",
    "url_mobile": "",
    "title": "57 % of Americans Trust Financial Institutions to Protect Their Data",
    "seendate": "20240912T130000Z",
    "socialimage": "https://www.pymnts.com/wp-content/uploads/2024/09/PYMNTS-Intelligence-open-banking-instant-payments.jpg",
    "domain": "pymnts.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "57% of Americans Trust Financial Institutions to Protect Their Data By PYMNTS | September 12, 2024 | Open banking , which allows third-party providers to access banking data through secure application programming interfaces (APIs), has gained momentum globally as a means to enhance financial services . Recent U.S. regulatory developments may pave the way for increased adoption, particularly for real-time payments . Get the Full Story Complete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required. yes Subscribe to our daily newsletter, PYMNTS Today. By completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions . Δ But a PYMNTS Intelligence report, “ Can Open Banking Win Trust to Drive Real-Time Payments? ,” created in conjunction with The Clearing House , shows how data security and privacy remain obstacles before open banking can realize its potential in the American financial landscape. U.S. Regulators Push Forward on Open Banking Although 46% of U.S. adults are interested in open banking, adoption lags at a mere 11%. The Consumer Financial Protection Bureau (CFPB) has proposed a new rule under Section 1033 of the Dodd-Frank Act that aims to expand open banking in the U.S. This regulation would require financial institutions to share consumer data with authorized third parties while implementing enhanced privacy and security measures. Although the proposal is a significant step toward broader adoption of open banking, it has faced criticism from industry groups like The Clearing House Association and the Bank Policy Institute , which argue that it does not sufficiently protect consumer data. Their concerns focus on practices such as credential-based access and screen scraping, which they believe could jeopardize data security. Consumer and Business Skepticism Hampers Adoption U.S. and U.K. stakeholders remain skeptical about open banking due to concerns about data security. In the U.K., where open banking has been operational since 2018, 84% of consumers distrust its safety and 72% believe it benefits third-party providers more than consumers. Advertisement: Scroll to Continue Additionally, businesses cite cybersecurity concerns as a barrier despite recognizing open banking’s potential benefits. In the U.S., while 60% of Americans view open banking favorably, significant concerns persist about data storage and collection practices. Only 57% of Americans trust financial institutions to protect their personal information, underscoring the need for improved trust and transparency. Open Banking’s Potential to Revolutionize Real-Time Payments Despite these challenges, open banking has the potential to transform the payments industry by facilitating real-time payments. Open banking could enhance the efficiency of account-to-account (A2A) transactions, offering a cost-effective alternative to credit card payments by reducing fees and fraud. According to the report, proponents estimate A2A payments could reach $200 billion in consumer-to-business transactions in North America by 2026. The U.K. government is also encouraging the use of open banking to improve real-time payment systems and reduce transaction times. For open banking to revolutionize real-time payments, it must address ongoing concerns about data security and privacy. Effective regulation and collaboration between public and private sectors are crucial in ensuring that the final rules safeguard consumer information while promoting innovation. By addressing industry concerns and creating a secure environment for data sharing, open banking can achieve its full potential, driving forward the adoption of real-time payments and expanding financial inclusion across various demographics. Recommended Nvidia and Uber Join Forces to Accelerate Autonomous Driving Target to Cut 1,800 Corporate Jobs as It Struggles to Regain Momentum OpenAI Acquires Former Apple Shortcuts Team to Expand Desktop Offering California Tops States for AI and Social Platforms Accountability Rules See More In: APIs , banking , data brief , data protection , data sharing , Digital Payments , faster payments , Featured News , financial institutions , instant payments , News , Open Banking , Payment Methods , PYMNTS Intelligence , PYMNTS News , real time payments , The Data Point"
  },
  {
    "url": "https://www.hani.co.kr/arti/english_edition/e_business/1158311.html",
    "url_mobile": "",
    "title": "Excess household , corporate debt is inhibiting Korea economic growth , BIS report says",
    "seendate": "20240912T091500Z",
    "socialimage": "https://flexible.img.hani.co.kr/flexible/normal/900/600/imgdb/original/2024/0912/3117261310989124.jpg",
    "domain": "hani.co.kr",
    "language": "English",
    "sourcecountry": "South Korea",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Go to Body all > Business Excess household, corporate debt is inhibiting Korea’s economic growth, BIS report says Posted on : 2024-09-12 17:56 KST Modified on : 2024-09-12 17:56 KST Facebook 페이스북 Twitter 트위터 The report explained that while increased investment based on borrowing helps increase growth in the short term, an increase in liabilities can detract from future growth potential (Getty Images Bank) South Korea’s level of household and corporate debt has reached a level with the potential to inhibit economic growth, an international organization concluded. The warning message was that South Korea has passed the era when debt once promoted growth and has arrived in one where the benefits are outweighed by even greater negative impacts. An examination Wednesday of a recently published report by the Bank for International Settlements (BIS) found that in most emerging economies, credit to the non-financial sector has dramatically increased amid a long-term trend of low interest rates since the 2000s. “Credit to the non-financial sector” conventionally refers to liabilities associated with households and companies but excluding financial institutions. Since 2000, the ratio between credit to the non-financial sector and gross domestic product (GDP) has risen by an average of over 1.3 times among emerging economies in Asia. China’s ratio nearly doubled over the same period. In some respects, increased credit to the non-financial private sector contributes to growth through greater access to funds and investment in real assets and education. Beyond a certain point, however, its net effects become negative, the report observed. From BIS Bulletin No. 91 “Credit and resource allocation in EMEs: taking stock of two decades of falling interest rates.” An examination of the correlation between amount of debt and growth rates shows a proportional relationship early on — but at a certain point, a peak is reached, and the relationship becomes inversely proportional, creating an “inverted U-shaped” curve. The report explained that while increased consumption and investment based on borrowing help increase the growth rate in the short term, an increase in the amount of liabilities translates into a growing principal and interest repayment burden that detracts from future growth potential. It also noted that while most emerging economies are still in the space where increased credit to the non-financial sector stokes growth, Asian countries in particular have reached an inflection point where it has begun inhibiting growth. The report listed the economies of Korea and China in recent years as its primary examples. For both countries, right around when the ratio of credit to the non-financial sector to GDP hit the 100% mark is when their economic growth peaked and started to fall. A look at Bank of Korea figures shows that as of the end of last year, Korea’s ratio of credit to the non-financial private sector to GDP was 222.7% (BIS standard). The ratio fluctuated around the 100% mark in the 1980s (jumping to 160% in the direct aftermath of the Asian financial crisis) before surpassing 150% in the second quarter of 2007 and 200% in the first quarter of 2020. The BIS also pointed out that as growing household credit typically leads to increased demand for housing, it can “weigh on growth” because productivity gains are low in the construction and real estate sectors. The larger the increase in the share of construction and real estate loans, the greater the plunge in labor and total factor productivity growth for a country. “The shift might reflect — to some extent — overinvestment in construction and services, which could have adverse and persistent effects on aggregate labour productivity and income growth long after the credit impulse towards housing subsides,” the report noted. In its conclusion, the report noted that the inverted U-shape between credit and growth is “not set in stone” and can be mitigated with policy initiatives. Namely, it listed increasing the role of equity markets and dampening unbalanced credit growth, as well as increasing productive firms’ access to credit. By Kim Hoe-seung, senior staff writer Please direct questions or comments to [ english@hani.co.kr ] Related stories · Korean household debt reaches another new high as mortgages soar by 16 trillion won · Steep, quick jump in household loans prompts concern about debt explosion in Korea · Korea tops global household debt-to-GDP ratio rankings for 4th year running · Korea saw 9-year high in real estate auctions due to loan default last year, up 61% from 2022 · Korea’s household credit hits record high on surging mortgage balances 광고 Editorial・opinion [Editorial] Prosecutors’ selective outrage is self-incriminating [Column] Korea’s ‘republic of lawyers’ is only making things worse [Column] Trump should win Nobel War Prize [Editorial] Boozing, luxe gifts, playing royalty: Yoon and Kim must pay for privatizing power [Column] Korea’s young men need liberating too [Correspondent’s column] Yet another fragmented Sado mine memorial [Column] Why is South Korea clamoring for yesterday’s nuclear submarines? [Column] The banality of Korea’s ‘democratic fascism’ [Editorial] New York City elects a potent foil to Trump [Column] Nuclear submarines and the paradoxes of pursuing denuclearization Most viewed articles 1 Yoon sent drones to North Korea to stoke conflict and justify martial law, special counsel alleges 2 [Column] Korea’s ‘republic of lawyers’ is only making things worse 3 China issues official list of North Korea embargo products 4 Chairman orders replacement of all Joint Chiefs generals over martial law crisis 5 [Editorial] Boozing, luxe gifts, playing royalty: Yoon and Kim must pay for privatizing power 6 The valley of 7,000 deaths: Still seeking truth of gruesome Korean War massacres 73 years on 7 Trump-Kim meeting would be ‘even riskier today,’ warns architect of Agreed Framework 8 ‘Very proud’: Korea’s president congratulates T1 on LoL Worlds win three-peat 9 Top prosecutor called on to resign amid controversial handling of Daejang corruption case 10 How the story of Chol Soo Lee, who united Asian Americans in fight for justice, was forgotten"
  },
  {
    "url": "https://www.fool.com/investing/2024/09/08/berkshire-hathaway-financial-stock-buy-now/?source=iedfolrf0000001",
    "url_mobile": "",
    "title": "Berkshire Hathaway Holds Bank of America , American Express , Visa , and Mastercard Stock , but So Does This Low - Cost Vanguard ETF",
    "seendate": "20240908T130000Z",
    "socialimage": "https://g.foolcdn.com/editorial/images/789306/gettyimages-1181691208-1200x798-36b7a2e.jpg",
    "domain": "fool.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Warren Buffett-led Berkshire Hathaway ( BRK.A +0.17% ) ( BRK.B +0.03% ) achieved a new milestone in August, surpassing $1 trillion in market cap for the first time. Although Berkshire is known for its public equity investments in companies like Apple and Coca-Cola , the value of the rest of the business is actually much higher. In fact, Berkshire's holdings in public companies are worth about $320 billion compared to the $1.026 trillion market cap for Berkshire as a whole. Berkshire has a treasure trove of property and casualty insurance segments, ownership of BNSF Railway, 92% ownership of Berkshire Hathaway Energy, manufacturing, service, and retailing businesses, and more. It also has a combined $79.41 billion invested in Bank of America ( BAC +0.39% ) , American Express ( AXP +0.62% ) , Visa ( V +1.14% ) , and Mastercard ( MA +0.97% ) . While you could buy Berkshire Hathaway stock to get exposure to these top companies and Berkshire's private holdings, a simpler and perhaps more effective way of investing in the financial sector is through an exchange-traded fund (ETF) like the Vanguard Financials ETF ( VFH +0.45% ) . In fact, Berkshire Hathaway stock is the fund's second-largest holding with an 8.1% weighting. Here's why financials are one of the market's most diversified and value-orientated sectors and why the Vanguard Financials ETF could be worth buying now. Image source: Getty Images. Getting to know the financial sector The financial sector is the second most valuable sector behind technology -- making up 13.3% of the S&P 500 . It includes a diverse array of industries, from big banks to regional banks, investment banking, insurance providers, payment processors, financial exchanges, and more. Although the financial sector generally benefits from economic growth, not every part of it reacts to economic factors in the same way. For example, banks can benefit from higher interest rates by collecting more interest income from consumers. But credit card companies make money by the number of transactions and the average amount of each transaction. So, they would prefer lower interest rates and higher spending rates. Similarly, investment banks and venture capital firms may prefer lower capital costs to spur merger and acquisition activity. However, an insurance company depends more on regulations than economic conditions. Stodgy low-growth pockets of the financial sector tend to have dirt cheap valuations and pay rising dividends. In contrast, faster-growing companies may pay small dividends (or none at all) and focus more on reinvesting in the business. Diversification is especially important in the financial sector. For example, several regional banks failed in early 2023. Having diversification across the industry and not just one niche can help protect against a crisis. But too much investment in banks or insurance companies would have led investors to miss out on the boom in credit card companies. One of Berkshire's best long-term winners has been American Express -- which is now its second most valuable position behind only Apple. The combined market cap of American Express, Visa, and Mastercard nearly matches the combined value of the three largest U.S. banks by market cap -- JPMorgan Chase , Bank of America, and Wells Fargo -- illustrating the importance of payment processors to the financial sector. A balanced sector with plenty of opportunities The Vanguard Financials ETF is a simple, low-cost way to unlock diversification and invest in a blend of growth, income, and value stocks. The ETF has a mere 0.1% expense ratio, or just $.10 per $100 invested. And with a minimum investment amount of just $1, it's easy to dip your toes in the ETF without allocating a large chunk of your portfolio. Thanks to the inexpensive valuations of so many large financial companies, the ETF has a 16.3 price-to-earnings (P/E) ratio and a yield of 1.8% -- which is especially impressive considering the fund is up 20% year to date. The following table shows that the fund's top 10 holdings include a variety of leading companies from different segments of the financial industry. Company Weighting in the Vanguard Financials ETF JPMorgan Chase 8.6% Berkshire Hathaway 8.1% Mastercard 5.5% Visa 4.1% Bank of America 4.1% Wells Fargo 3% Goldman Sachs 2.3% S&P Global 2.2% American Express 2.1% BlackRock 1.8% Data source: Vanguard. Combined, the top 10 holdings make up 42% of the fund, which represents balance and diversification. Let the Vanguard Financial Sector ETF work for you The Vanguard Financial Sector ETF is a low-cost way to invest in Berkshire Hathaway and other top financial stocks. It's a useful tool for getting baseline exposure to various companies. Some investors may look to pair the ETF with individual stock holdings if they want extra exposure to particular companies. For example, if you're extra confident in the growth potential of payment processors, then you may want to consider buying Visa, Mastercard, and American Express to increase your exposure beyond what the ETF provides. The Vanguard Financial Sector ETF is worth a closer look for investors who want to put new capital into the market without chasing high-flying companies with sky-high valuations."
  },
  {
    "url": "https://bulawayo24.com/index-id-news-sc-national-byo-245316.html",
    "url_mobile": "",
    "title": "South Africa GDP growth is an  illusion  benefiting the few",
    "seendate": "20240905T131500Z",
    "socialimage": "https://img.bulawayo24.com/articles/eff_eff-EFF.jpg",
    "domain": "bulawayo24.com",
    "language": "English",
    "sourcecountry": "Zimbabwe",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "News / National South Africa GDP growth is an 'illusion' benefiting the few by Staff reporter 05 Sep 2024 at 09:17hrs | 187 Views The Economic Freedom Fighters (EFF) have dismissed the recent GDP growth figures released by Statistics South Africa (Stats SA) as \"misleading\", accusing the government and financial institutions of creating a false narrative of economic recovery while key sectors continue to struggle. Stats SA's report indicates that South Africa's economy has grown by 0.4% in the second quarter of 2024, but the EFF argues that this growth has not translated into job creation or real improvements for the majority of South Africans. In a statement released on Tuesday, the EFF said, \"This so-called growth is an entrenchment of market-oriented and financial sector-centred policies that have benefited only a small portion of society, primarily banks. The people of South Africa should never be hoodwinked into celebrating what must correctly be seen as jobless growth.\" According to the party, the finance sector contributed 0.3 percentage points to the growth, while labour-intensive sectors like agriculture, forestry, and mining all declined. The EFF emphasized that unemployment has risen, citing the latest figures showing a 0.6% increase, amounting to 158,000 more people without jobs. The party further pointed out that unemployment in the agricultural sector alone rose by 45,000 people during this period, undermining any claims of economic progress. \"The reality is that this growth benefits the capitalist establishment through the financial sector, and is the intended agenda of this very government, which is established by private sector interests to deliver narrow profit maximization for the few at the expense of the majority of South Africans,\" the EFF said. The party also highlighted the impact of high interest rates on South Africans, noting that many households are struggling to repay their debts and are at risk of losing their homes and vehicles. \"The financial sector has grown on the back of the suffering of South Africans who are repaying high amounts on their homes, vehicles, and debts, and in many instances, losing these assets to the financial sector because they can no longer afford them,\" the statement added. In response to these challenges, the EFF has called on the South African Reserve Bank (SARB) and the Monetary Policy Committee (MPC) to reduce the repo rate by 150 basis points in an effort to ease the cost of living for South Africans. They argue that the current economic policy framework only serves to enrich the few at the expense of the many, and have warned that continuing down this path will lead to further social unrest and economic inequality. \"The people of South Africa should not be misled by a narrative of economic growth, while they remain unemployed and gripped by poverty. This growth has not benefited the masses, and those claiming easy victories ought to be careful, as they will be held responsible for the increased unemployment rate, crime rate, and rising cases of sexual assaults and rape,\" the EFF cautioned. Source - iol More on: #EFF , #GDP , Join the discussion Loading comments… Enable JavaScript to view comments."
  },
  {
    "url": "https://www.myjoyonline.com/resetting-the-economy-ndcs-2024-agenda-for-structural-reforms-and-sustainable-growth/",
    "url_mobile": "",
    "title": "  Resetting  the economy : NDC 2024 agenda for structural reforms and sustainable growth",
    "seendate": "20240903T174500Z",
    "socialimage": "https://www.myjoyonline.com/wp-content/uploads/2020/03/Johnson-Asiama1.jpeg",
    "domain": "myjoyonline.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Audio By Carbonatix 'Resetting' an economy usually involves substantial changes or reforms aimed at correcting structural weaknesses, boosting efficiency, and promoting sustainable growth. These measures can vary depending on a country's specific circumstances, but generally include the following: Restoring macroeconomic stability: Addressing issues such as high inflation, persistent fiscal deficits, excessive debt levels, restructuring SOEs, and reducing risks to the fiscal, etc. This might also require monetary and exchange rate policy reforms, fiscal austerity measures, or debt restructuring. Deep structural reforms: Modifying the fundamental frameworks of the economy to enhance productivity and competitiveness. This could involve further deregulation, labour market reforms, and changes to trade policies, etc. Institutional reforms: Improving the effectiveness of institutions that support economic activity, such as the legal system, regulatory bodies, and financial institutions. This could include tackling corruption, improving governance, and strengthening property rights. Financial sector reforms: Addressing issues within the banking and financial sector to restore stability and ensure efficient capital allocation. Specifically, this might involve recapitalizing banks, enhancing regulatory frameworks, resolving non-performing loans, and promoting local ownership in Ghana’s financial sector, etc. Social and human capital development: Investing in education, healthcare, and social protection systems to reduce poverty and inequality, promote healthcare and education and ensure long-term sustainable growth. Innovation and technology: Promoting innovation, advancing technology adoption, and fostering digital transformation to create new growth opportunities. Hence, the term \"reset\" implies a comprehensive and fundamental overhaul rather than incremental adjustments (or “upgrading,”). Such resets typically occur in response to a crisis or prolonged stagnation, similar to what Ghana is currently experiencing. Historical examples include the structural adjustments in Latin America during the 1980s and 1990s, transformations in Eastern Europe post-communism, and efforts to address economic turmoil in the wake of the global financial crisis in 2008. The specific details on the NDC’s comprehensive reset agenda for a better Ghana, are all contained in their 2024 Manifesto for reference. **The writer is a former Deputy Governor of the Bank of Ghana (BoG) DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: Resetting Ghana DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story ‘Resetting Ghana’ with results; Mahama trumpets early achievements Fiscal discipline is key to resetting Ghana – Dr. Ishmael Yamson ‘Mahama has set the tone, now his team must follow’, says Dr Ishmael Yamson Ebenezer De-Gaulle: Resetting Ghana through Digital Cheetah Generation Akwasi Opong-Fosu: The youth as partners in resetting the nation Democracy of Principle: Resetting Ghana Must Go with Resetting of Minds Too Welding in a 24-hour economy: Part 1 NDC Manifesto launch ‘First Step’ in ‘Resetting Ghana’ – Mahama Most Popular News Latest Stories Trump asks Supreme Court to overturn E Jean Carroll verdict 46 minutes China needs its youth to spend but they are embracing frugality 57 minutes British prime minister Starmer will fight attempts to replace him, allies say 1 hour EdTech for special needs: Inclusive education for all 5 hours HeFRA shuts down Tamale Technical University Hospital over safety violations 5 hours Abu Jinapor raises serious issues about the Ewoyaa lithium mining lease agreement between the Government of Ghana and Barari DV Ltd 5 hours Increase budget to agriculture sector to at least 10% of GDP – Chamber of Agribusiness to government 5 hours Ghana loses $200m annually to disasters – NADMO 5 hours Bank of Ghana announces new foreign exchange operations framework 5 hours Father and son convicted to a fine for stealing and assault 5 hours Refuse collector jailed 10 years for attempting to rob US diplomat 6 hours BBC must fight to restore trust, Nandy tells MPs 6 hours GTEC directs NaCCA Deputy Director-General to cease using invalid SMC ‘Dr’ title 6 hours COP 30: Climate finance remains Africa’s top priority 6 hours MTN Ghana highlights SME support at 2025 SMEGA Awards 6 hours"
  },
  {
    "url": "https://www.thehindu.com/business/Industry/financial-sector-carries-a-significant-weight-of-responsibility-on-its-shoulders-cea-nageswaran/article68595752.ece",
    "url_mobile": "https://www.thehindu.com/business/Industry/financial-sector-carries-a-significant-weight-of-responsibility-on-its-shoulders-cea-nageswaran/article68595752.ece/amp/",
    "title": "CEA Anantha Nageswaran : Financial sector carries a significant weight of responsibility on its shoulders",
    "seendate": "20240902T080000Z",
    "socialimage": "https://th-i.thgim.com/public/incoming/w0mobg/article68595811.ece/alternates/LANDSCAPE_1200/IMG_Chief_Economic_Advis_2_1_RMD3EBA5.jpg",
    "domain": "thehindu.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Financial sector carries a significant weight of responsibility on its shoulders: CEA Nageswaran Nageswaran also emphasised on 3Cs -Collaboration, Challenges, and Confidence that has significantly shaped Indian economy’s progress Updated - September 02, 2024 02:09 pm IST The Hindu Bureau READ LATER SEE ALL Remove Chief Economic Advisor V. Anantha Nageswaran. File. | Photo Credit: PTI Chief Economic Advisor to the Government of India V. Anantha Nageswaran on Monday (September 2, 2024) said that since the consequences of what happens in the financial sector reverberate throughout, therefore it carries a significant weight of responsibility on its shoulders Mr. Nageswaran, while speaking at the CII Financing 3.0 Summit in Mumbai said that the big difference between the financial sector and other sectors is that the consequences of what happens in this [financial] sector reverberate throughout the economy and beyond. The Confederation of Indian Industry (CII) Financing Summit 3.0 is aimed at addressing key issues and come out with relevant recommendations to provide an impetus to financial sector’s role in supporting India’s growth. Mr. Nageswaran also emphasised on 3Cs -Collaboration, Challenges, and Confidence that has significantly shaped Indian economy’s progress. India has one of the brightest global economic growth prospects, he said, cautioning that the country needs to avoid ‘financialization’ as it marches towards the goal of becoming a developed nation by 2047. India’s stock market capitalization is around 140% of the GDP, he said, adding, the record profitability of the Indian financial sector and high levels of market capitalization, or the ratio of market capitalization to GDP, give rise to another phenomenon which deserves closer examination. “When the market becomes bigger than the economy, it is natural, but not necessarily reasonable, that the considerations and priorities of the market dominate the public discourse and also influence the policy discourse. I am referring to the phenomenon called financialization, or the financial market’s dominance of policy and macroeconomic outcomes,” he said. Financialization is the dominance of financial market expectations trends, and importantly, interest in public policy and macroeconomic outcomes, he said at CII Financing 3.0 Summit here while making a disclaimer that these are his personal views and not as CEA. As India looks ahead to 2047 with optimism and hope, he said, this is something it has to avoid, because the consequences of such financialization is there for all to see in the developed world. “Unprecedented levels of public and private sector debt, some visible to regulators and some not, economic growth dependent on continued increase in asset prices to offset the leverage that have built up and hence a massive surge in inequality. India must be wary of these outcomes and avoid this trap,” he said. Developed countries are encountering these challenges after they have become materially prosperous, he said, adding per capita, India is just stepping into the lower middle income category. “Therefore, as we deliberate on preparing our financial system to support our economic aspirations, India can ill afford the financialization and its ramifications that afflict advanced societies. In other words, we cannot afford to let the tail wag the dog,” he said. Observing that retaining policy autonomy and space to insulate the economy from the vagaries of global capital flows is critical, Nageswaran said India relies on global capital flows despite modest current account deficit. “India has one of the brightest global economic growth prospects. It is up to us to sustain it, and it is also up to us to use that to our advantage in carving out policy space for ourselves,” he said. In short, he said, the country has to find a fine balance between national imperatives and investor interest or preferences. Of course, he said, “it also means becoming a global agenda setter, rather than an agenda taker. That will be a good thing. While some actions can be initiated now, such as, for example, an Indian entity making the effort to become a global credit rating agency, the outcome and the impact will take much longer to materialize.” “Economic size and economic clout will influence our ability to become a global agenda setter, and that, in turn, will favourably impact our economic performance. We have to work on both, therefore simultaneously, but agenda setting aspirations cannot run ahead of acquiring economic strength, size, heft and vitality,” he said. (With PTI inputs) Published - September 02, 2024 12:21 pm IST Read Comments Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER SEE ALL Remove PRINT Related Topics business (general) / economy, business and finance 0 / 0 Sign in to unlock member-only benefits! Access 10 free stories every month Save stories to read later Access to comment on every story Sign-up/manage your newsletter subscriptions with a single click Get notified by email for early access to discounts & offers on our products ✕ Looks like you are already logged in from more than 5 devices! To continue logging in, remove at least one device from the below list Log out Log Out from all devices Terms & conditions | Institutional Subscriber Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/MoF-releases-GH-700-million-in-asset-management-bailout-1948251",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/MoF-releases-GH-700-million-in-asset-management-bailout-1948251",
    "title": "MoF releases GH¢700 million in asset management bailout",
    "seendate": "20240830T144500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/821/82146838.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 08 30 → Article 1948251 Business News of Friday, 30 August 2024 Disclaimer Source: thebftonline.com 2024-08-30 MoF releases GH¢700 million in asset management bailout « Prev Next » Show Video Comments (4) Listen to Article Share: play video The Ministry of Finance The Ministry of Finance has initiated a release of GH¢700million as the first tranche of a GH¢1.5billion bailout package for investors affected by the collapse of asset management companies (AMCs), which was announced during the 2024 mid-year budget review. This development, Finance Minister Dr. Mohammed Amin Adam said – during the August 2024 Monthly Press Briefing on the Economy, marks a crucial step for government’s efforts to restore confidence in the financial sector. The funds, part of a larger relief package approved by the Cabinet, are aimed at providing relief to thousands of investors whose funds have been locked up in defunct fund management companies since the financial sector clean-up began in 2017. This move comes at a critical time, as government faces mounting pressure to resolve lingering effects of the financial sector reforms. “This intervention is being done despite the tight fiscal space, evidence of government’s commitment to provide relief for investors in the defunct AMCs – especially the pensioners,” Dr. Adam stated during the briefing. He added that the emphasis on pensioners is an acknowledgement of the financial sector clean-up’s social impact on a vulnerable segment of the economy. According to the Finance Minister, the GH¢1.5billion package will be released in three tranches – with the first GH¢700million already processed for release through the Controller and Accountant-General. This initial disbursement is expected to significantly increase the number of fully settled investors under the bailout scheme. The Securities and Exchange Commission (SEC) will oversee distribution of funds with a particular focus on Blackshield Fund Management Ltd. – one of the largest affected AMCs. The bailout is projected to fully settle 82,096 Blackshield investors, representing 92 percent of its claimants, and 12,069 investors from other fund management companies, accounting for 78 percent of their claimants. In total, government expects this latest intervention to bring the number of fully settled investors to 94,165 – representing 90 percent of the total 105,178 validated claims. An analyst with a fund management firm, who wished to remain anonymous due to his position in the market, said: “While this bailout is a positive step, it’s important to note that it comes nearly seven years after the initial financial sector reforms. The delay has caused considerable hardship for many investors, particularly retirees who relied on these funds for their daily sustenance”. The announcement has been met with cautious optimism in financial circles. Market watchers are keen to see how quickly the funds will reach affected investors and what impact this will have on overall market confidence. Analysts say as the country continues to navigate its economic challenges, including high inflation and the ongoing IMF programme, government’s ability to fulfil its financial commitments will be closely scrutinised. They added that successfully implementing this bailout could play a crucial role in restoring trust in the financial system and attracting both domestic and foreign investments. “As of date, several bank depositors (savings and loans, microfinance and discount houses) whose claims were certified by the receiver in 2019 and 2020 have yet to be reimbursed. Are they among the GH¢700million…if not, when? “What has changed since Blackshield customers were first excluded from payments made to fund management companies? And are those fund management customers who received only 25% of their locked-up funds going to receive the rest of their monies? In all these, what are the timelines for government to bring these processes to an end?” quizzed Korsi Dzokoto, an analyst. Mr. Dzokoto also pointed out inconsistencies in government’s communication regarding the bailout programme, saying: “How much does government’s clean-up of the banking system cost? We have heard amounts ranging from GH¢21billion to GH¢25billion. “In the main budget, government announced GH¢4billion to pay-off locked funds in the banking and fund management sectors, including GH¢2.3billion for NIB recapitalisation. In its mid-year budget, government mentioned GH¢1.5billion.” The MoF has however maintained that the bailout package’s remaining tranches will be released in due course, with the timeline to be communicated in subsequent briefings. Related Articles: GFL urges calm amid rising tensions over 2026 base pay negotiations T-bills auction falls by GH¢2.33 billion as investor appetite weakens 'We found it reasonable' - GFL defends 9% base pay increment 37,000 football fields of forests lost each year – Report Private sector must be seen as a partner, not a competitor - Alex Dadey Read all related articles Comments: This article has 4 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://eng.obozrevatel.com/section-news/news-banks-of-georgia-and-kazakhstan-will-not-make-transfers-through-the-russian-payment-system-what-happened-28-08-2024.html",
    "url_mobile": "https://eng.obozrevatel.com/section-news/newsamp-banks-of-georgia-and-kazakhstan-will-not-make-transfers-through-the-russian-payment-system-what-happened-28-08-2024.html",
    "title": "US sanctions against Russia - Banks in Georgia and Kazakhstan will not make transfers through the Russian payment system",
    "seendate": "20240828T154500Z",
    "socialimage": "",
    "domain": "eng.obozrevatel.com",
    "language": "English",
    "sourcecountry": "Ukraine",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "News War in Ukraine Ukrainian armed forces counter-offensive Military aid to Ukraine Volodymyr Zelensky"
  },
  {
    "url": "https://www.albawaba.com/business/canadian-companies-see-income-rise-15-q2-1582747",
    "url_mobile": "",
    "title": "Canadian companies see an income rise by 1 . 5 % in Q2",
    "seendate": "20240826T174500Z",
    "socialimage": "https://www.albawaba.com/sites/default/files/styles/default/public/2024-08/shutterstock_2153117893.jpg?itok=amait20r",
    "domain": "albawaba.com",
    "language": "English",
    "sourcecountry": "Israel",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Published August 26th, 2024 - 02:12 GMT Shutterstock Canadian corporations reported an increase of 1.5%, or $2.4 billion, in net income before taxes (NIBT) in the second quarter of this year, according to official figures released on Friday. The gain was driven by an increase in the non-financial sector with 3%, but partially offset by the financial sector with a decline of 1.8%, Statistics Canada said in a statement. NIBT of primary metal and fabricated metal product, and machinery manufacturing industry, was up 10.2%, or $326 million. This was followed by the transportation, postal and couriers services, and support activities for transportation industry, which rose $323 million. Petroleum and coal product manufacturing industry also recorded increase of $307 million in the second quarter, due to higher price of energy and petroleum products. Tags: Canada Q2 Via SyndiGate.info � Copyright Andolu Ajansi Latest Popular Macron warns Israel against West Bank annexation Iraq concludes public voting in 2025 parliamentary elections as polls close nationwide 2 killed, 15 injured as bus bombings rock Bangladesh’s capital 20 killed as Turkish military plane crashes in Georgia Serenay Sarıkaya, Hande Erçel, and Afra Saraçoğlu as TV’s powerful lawyer women Loading content ... Subscribe Sign up to our newsletter for exclusive updates and enhanced content Subscribe Now Subscribe Sign up to get Al Bawaba's exclusive celeb scoops and entertainment news"
  },
  {
    "url": "https://www.dailypioneer.com/2024/business/adopt-more-supportive--empathetic-approach-towards-msmes--lenders-told.html",
    "url_mobile": "",
    "title": "Adopt more supportive , empathetic approach towards MSMEs , lenders told",
    "seendate": "20240822T231500Z",
    "socialimage": "https://www.dailypioneer.com/uploads/2024/story/images/big/adopt-more-supportive--empathetic-approach-towards-msmes--lenders-told-2024-08-23.jpg",
    "domain": "dailypioneer.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Home Business Adopt more supportive, empathetic approach towards MSMEs, lenders told Friday, 23 August 2024 | PTI | Mumbai Share T T T T 0 Adopt more supportive, empathetic approach towards MSMEs, lenders told Friday, 23 August 2024 | PTI | Mumbai Reserve Bank Deputy Governor Swaminathan J has asked financial institutions to adopt a more sensitive and empathetic approach towards MSMEs, and deploy supportive measures like restructuring options for loans, to support the sector which plays a key role in the economy. In a speech at the Annual Day of the Foreign Exchange Dealers Association of India (FEDAI) here, the deputy governor said MSMEs face challenges like access to affordable finance, delayed payments, infrastructure bottlenecks, and requirements of compliance, among others. The journey of Indiaâ€™s economic transformation cannot be complete without the robust development of the MSME sector. â€œMSMEs are not just the backbone of our economy, they are the engines of growth, innovation, and employment,â€ he said at the event held on Wednesday. However, for these enterprises to truly thrive and scale up, the financial sector must step up with innovative solutions, sensitivity, and a forward-looking approach, Swaminathan said. â€œThis is not just about providing credit; itâ€™s about enabling these enterprises compete globally, drive exports, and contribute to the nationâ€™s goal of becoming a developed economy by 2047. While financial instruments and support mechanisms are crucial, the way we engage with the MSME sector, our sensitivity to their challenges and our commitment to their success, will ultimately determine the strength and sustainability of this partnership,â€ he said. The deputy governor also emphasised that considering the key role that MSMEs play in the economy, the financial sector should adopt a more sensitive and empathetic approach towards them. â€œWhile financial discipline is crucial, the unique challenges faced by MSMEs, such as low capital base, lack of scale, cash flow constraints from delayed payments, fluctuating market conditions, and external economic pressures, necessitate a more nuanced approach to assessment as well as follow-up,â€ he said. While timely repayment of dues is crucial to maintain the health of the financial system, financial institutions should focus on deploying supportive measures such as restructuring options, grace periods, and tailored repayment plans that give MSMEs the breathing space they need to recover and get back on track while encountering difficult situations, the senior official said at the event attended by representatives of financial sector, among others. Trending News Russia, India to sign labour mobility accord during Putin’s visit China, Japan embroil in major diplomatic row over Taiwan US to press forward Israel-Hamas ceasefire Inside the media storm that toppled the BBC’s leadership PM hails Bhutan’s welcome for Buddha relics US President endorses Vivek for Ohio Governor race No US officials to attend G-20 summit: Trump President Trump hosts Central Asian leaders China commissions aircraft carrier Fujian for global power Pakistan presents evidence-based demands to end cross-border terrorism Indian-Americans hail new era in US politics Ukraine claims it has hit major Russian oil refinery with drones more State Editions Blast leaves streets strewn with human remains 12 November 2025 | Pioneer News Service | Delhi Blast survivor recalls horror near Red Fort 12 November 2025 | Pioneer News Service | Delhi Lal Quila metro station to stay closed on Nov 12 12 November 2025 | Pioneer News Service | Delhi Bhogal panic after RDX alert turns out to be false 12 November 2025 | Pioneer News Service | Delhi CM announces Rs 10 lakh for families of victims 12 November 2025 | Pioneer News Service | Delhi Probe launched into explosives used in Red Fort blast 12 November 2025 | Pioneer News Service | Delhi Delhi , Bhopal , Bhubaneswar , Ranchi , Lucknow , Chandigarh , Dehradun , Raipur Sunday Edition Flavours of Jharkhand: Where forest, faith and food converge 09 November 2025 | Anil Rajput | Agenda Mind wavers: Five things that influence your mind 09 November 2025 | Gurudev Sri Sri Ravi Shankar | Agenda Being on the shores of the future 09 November 2025 | Team Agenda | Agenda Inside India’s political gender shift 09 November 2025 | Team Agenda | Agenda Jharkhand: A story of resilience & renewal 09 November 2025 | Rajeev Kumar,Former DGP, Jharkhand | Agenda Chhattisgarh: At a turning point of growth 09 November 2025 | Ganesh Shankar Mishra, Retd. IAS Officer; served as Principal Secretary, Chhattisgarh | Agenda E-mail this link to a friend. Email of your friend: Your Name (Sender's): Your Email (Sender's): Subject:"
  },
  {
    "url": "https://news.webindia123.com/news/Articles/Business/20240822/4227558.html",
    "url_mobile": "",
    "title": "Financial sector should enhance digitisation in credit delivery to help MSMEs : RBI Deputy Governor",
    "seendate": "20240822T094500Z",
    "socialimage": "",
    "domain": "news.webindia123.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Wednesday, November 12, 2025 Advertise with us News SEARCH NEWS NEWS HOME » BUSINESS Financial sector should enhance digitisation in credit delivery to help MSMEs: RBI Deputy Governor Share Tweet COMMENT Mumbai (Maharashtra) | August 22, 2024 2:41:42 PM IST Speaking at the Annual Day of the Foreign Exchange Dealers on Thursday Swaminathan J, Deputy Governor, Reserve Bank of India (RBI) said that the financial sector should leverage digitisation in credit delivery to help Micro, Small and Medium Enterprises (MSMEs). The Deputy Governor highlighted the adoption of digital payment systems by MSMEs as an opportunity, adding that the bankers should explore these opportunities. Underscoring the significance of the financial sector in enhancing the export of the MSMEs, the Deputy Governor asked for tailored and focused services for MSMEs. He stated that the financial sector can significantly provide aid to the MSMEs by offering services such as pre-and post-shipment finance, factoring, and invoice discounting. \"The financial sector can play a crucial role in boosting MSME exports by offering targeted support and tailored services that address the unique challenges these businesses face in the global market,\" he said. \"We have seen significant traction towards end-to-end digitalisation of credit delivery in the past few years, largely in Retail and to some extent in the MSME sector. I would urge bankers to explore these opportunities further for greater digitalisation of their transactions with MSMEs,\" the RBI Deputy Governor added. He further stated that financial institutions can expedite approval times and significantly lower the costs of availing credit by using digital tools for application processing, verification, and disbursement. Pointing out the data footprint generated from these transactions, he said that a better risk assessment system can be developed. \"Extending finance after a proper understanding of the cash flows of MSMEs, including factoring in the possible delayed payments from their buyers, will ensure a proper reading of the actual working capital cycle and ensure adequate financing,\" he said. \"Many small business owners lack the knowledge and skills to effectively manage their finances, which can hinder their growth. The sector can significantly aid MSMEs in managing risks through export credit insurance and currency risk hedging solutions,\" the Deputy Governor said. \"While financial discipline is crucial, the unique challenges faced by MSMEs--such as low capital base, lack of scale, cash flow constraints from delayed payments, fluctuating market conditions, and external economic pressures--necessitate a more nuanced approach to assessment as well as follow up,\" he added pointing out at the need to adopt a more sensitive and sympathetic approach towards the MSMEs. Going further, the Deputy Governor emphasised the need to spread awareness and enhance financial literacy among MSMEs. (ANI) LATEST COMMENTS () POST YOUR COMMENT Comments Not Available POST YOUR COMMENT TRENDING TOPICS Tariff , GST , Diwali , Iran , election , Zubeen , Trump , Mamdani , Bihar , sensex , Israel , Congress , BJP , Ladakh , Modi , pahalgam , Pakistan , cricket , Naxal , Budget CITY NEWS Delhi Mumbai Kolkata Chennai Bangalore Kochi MORE CITIES MORE BUSINESS NEWS Nykaaland 3.0 Welcomes 30,000+ Attendees... UST wins Indian CSR Awards 2025 for Wate... Press Industry calls for a balancing act... Vice President of India Calls for Nation... India's hiring intent rebounds to 11% fo... A Landmark Alliance for India's Built En... More... INDIA WORLD ASIA Delhi, J-K hold candlelight march in sol... Indian Army concludes 'Exercise Maru Jwa... 'Should be investigated properly': Congr... Rajasthan Deputy CM condemns Delhi car b... IIM Kozhikode to host 6th Globalising In... Exit polls pointing towards Mahagathband... More... Delhi Blast: Canada PM Carney, Guyanese ... 'Despite the Delhi blast, PM Modi consid... EAM Jaishankar meets German, French, Bra... 1020 MW Punatsangchuu-II Hydroelectric P... EAM Jaishankar meets UK Foreign Secretar... 'India unequivocally rejects the baseles... More... Asim Munir due for another promotion, li... HRCP slams Pakistan's border management ... Pakistan army turns guns on its own citi... Pakistan's energy future at risk amid un... Pakistan's forces accused of butchering ... Russia blasts Pakistani daily for spread... More... Top Stories EAM Jaishankar meets German, French... 1020 MW Punatsangchuu-II Hydroelect... \"Should be investigated properly\": ... PM Modi, Bhutan King hold discussio... Rajasthan Deputy CM condemns Delhi ... IIM Kozhikode to host 6th Globalisi... EAM Jaishankar meets UK Foreign Sec... Exit polls pointing towards Mahagat... Information About Us Advertise with us Enquiry Sitemap Terms & Conditions Privacy Policy Free Slot India Disclaimer Explore Webindia123 News and Press Releases Education And Career Video Shows Indian online bet Movie And Celebrity Events Deals And Discounts Yellow Pages/ Business Contacts Photo Gallery Classified/ Personal Ads Automobiles Realestate/ Properties for sale Copyright Suni Systems (P) Ltd, 2000 - 2025. All Rights Reserved"
  },
  {
    "url": "https://www.globenewswire.com/news-release/2024/08/14/2929847/0/en/Canada-Banking-Consumer-Habits-Market-Report-2024-Gen-Z-is-Reshaping-the-Early-Stages-of-the-Customer-Journey.html",
    "url_mobile": "",
    "title": "Canada Banking Consumer Habits Market Report 2024",
    "seendate": "20240814T093000Z",
    "socialimage": "https://ml.globenewswire.com/Resource/Download/2a41bfd4-f7f9-4c12-a00b-7271c8d133a8",
    "domain": "globenewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Dublin, Aug. 14, 2024 (GLOBE NEWSWIRE) -- The \"Canada Banking Consumer Habits 2024\" report has been added to ResearchAndMarkets.com's offering. Gen Z Is Crowdsourcing Its Banking Research Gen Zers are banks' richest source of customer acquisition, but their customer journey is shaped much more by crowdsourced information than other generations'. The inaugural survey of 1,598 banking consumers in Canada spotlights Gen Zers' unique behaviors to help banks drive conversions. Key Question: What are the differences between Canada Gen Zers and other generations when it comes to product discovery and consideration? Key Stat: Banks are losing the fight for influence over Gen Zers on social media. Just 27.3% called bank-generated content the most trusted source of banking information, while 60.6% cited customer-generated content. Here's what's in the full report 4 Exportable files for easy reading, analysis and sharing. 11 Charts: Reliable data in simple displays for presentations and quick decision making. Key Topics Covered: Gen Z is reshaping the early stages of the customer journey Mobile and web take the lead in building Gen Zers' awareness - but email is holding its own User-generated content is shaping Gen Zers' consideration stage Gen Z sticks to the status quo when it comes to actually buying banking products Methodology Survey Demographics Media Gallery Charts in This Report Trusted Sources of Banking Information on Social Media According to Gen Z vs. Total Banking Consumers in Canada, Nov 2023 (% of respondents) Channels Through Which Banking Consumers in Canada Become Aware of a Bank's Products/Services, Gen Z vs. Total, Nov 2023 (% of respondents) Sources Gen Z Banking Consumers in Canada Use to Research Banking Products/Services, Nov 2023 (% of respondents) Social Media Platforms Gen Z Banking Consumers in Canada Have Used to Find Banking Information, Nov 2023 (% of respondents) Methods Gen Z Social Media Users in Canada Use to Research/Evaluate Banking Products/Services on Social Media, Nov 2023 (% of respondents) Willingness of Banking Consumers in Canada to Shop Around vs. Go Straight to a Trusted Brand for New Financial Products/Services, by Generation, Nov 2023 (% of respondents) Providers Gen Z Banking Consumers in Canada Would Most Likely Buy Banking Products/Services From Based Solely on Brand Trust, Nov 2023 (% of respondents) Top Factors Gen Z Banking Consumers in Canada Would Consider Before Choosing a New Bank, Nov 2023 (% of respondents) Banking Consumers in Canada Who Bought Banking Products/Services via a Physical Branch vs. an App, by Generation, Nov 2023 (% of respondents) Top 10 Factors That Ultimately Led Gen Z Banking Consumers in Canada to Buy a Banking Product/Service, Nov 2023 (% of respondents) Demographic Summary of Respondents to Canada Banking Consumer Habits Survey, Nov 2023 (% of total) For more information about this report visit https://www.researchandmarkets.com/r/91qwwv About ResearchAndMarkets.com ResearchAndMarkets.com is the world's leading source for international market research reports and market data. We provide you with the latest data on international and regional markets, key industries, the top companies, new products and the latest trends. Attachment Canada Banking Consumer Habits 2024"
  },
  {
    "url": "https://www.prokerala.com/news/articles/a1555819.html",
    "url_mobile": "",
    "title": "Financial sector needs to step up vigil against 4 risks in digital tech , says RBI Dy Governor",
    "seendate": "20240814T074500Z",
    "socialimage": "",
    "domain": "prokerala.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Jaipur, Aug 14 : RBI Deputy Governor Swaminathan Janakiraman at a global conference here on Wednesday highlighted that while the \"evolving technological landscape\" in the financial sector presents huge opportunities it also shows significant challenges that have to be taken care of. Jaipur, Aug 14 (IANS) RBI Deputy Governor Swaminathan Janakiraman at a global conference here on Wednesday highlighted that while the \"evolving technological landscape\" in the financial sector presents huge opportunities it also shows significant challenges that have to be taken care of. He highlighted four risks against which financial institutions needed to step up their vigil. These include cyberattacks, the quick outflow of funds due to digital payments, third-party risks and the risk from fintech companies that operate outside the regulatory system. \"In an era where digital transformation is reshaping every facet of banking and finance, the integration of advanced technologies into the financial sector, brings both unparalleled opportunities and significant risks,\" Swaminathan said. \"The evolving technological landscape presents both significant challenges and opportunities for deposit insurers. By adopting a proactive, risk-based approach -- including enhanced oversight, risk-based premiums, reliance on supervisory ratings, faster claim settlements, and industry collaboration -- deposit insurers can effectively manage these risks,\" he observed. In his address on the second day of the global conference of the International Association of Deposit Insurers - Asia Pacific Regional Committee (IADI-APRC), Swaminathan pointed out that by assuring depositors that their funds up to the coverage limit are protected, deposit insurance fosters confidence and stability within the banking sector. Deposit insurance stands as a key pillar of the financial safety-net system, playing a crucial role in maintaining financial stability. Deposit insurance also helps prevent bank runs that could escalate into broader financial crises, he added. The financial sector is a prime target of frequent cyberattacks due to the vast amounts of sensitive data and capital it handles. Significant cyber incidents can cause micro-prudential risks for individual financial institutions, namely solvency, liquidity, market, operational and reputational risks. \"Therefore, protecting critical infrastructure from breaches is of paramount importance, and it requires not only advanced technical defences but also a robust culture of cybersecurity awareness across all levels of the organisation. Financial institutions therefore need to have robust business continuity preparedness by testing their systems periodically encompassing possible adverse combinations,\" he said. He said that today a significant portion of banking transactions and services are conducted through digital channels. The expansion and widespread adoption of digital payment systems has enabled rapid, low-cost transactions and easy withdrawals via online banking and mobile apps. However, this shift increases the risk to operational stability and resilience, necessitating ongoing investments in IT systems and technology to manage peak loads effectively. Additionally, the 24/7 availability of online and mobile banking can heighten vulnerabilities, potentially accelerating bank runs and liquidity crises during periods of stress, as customers may withdraw funds even outside of traditional banking hours and without having to visit a Bank branch, the RBI Deputy Governor explained. He also highlighted the risks of the increasing dependence on third parties. The digital transformation in banking has also led to a multitude of distinct third-party entities getting involved in the provision of a single product or service, creating a complex web of technical and operational dependencies. However, the impact of failure in any link in this chain can often be catastrophic as was seen in a global IT services outage incident last month. Further, third parties could be points of intrusion for ransomware and other cyber threats. The rise of fintech companies and the entry of entities that operate outside the traditional regulatory and supervisory framework introduce new dimensions of risk to the financial sector. While fintech innovations have greatly enhanced financial inclusion, efficiency, and customer experience, they also present challenges related to data security, consumer protection, and regulatory compliance, Swaminathan added."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/GEF24-Unified-vision-paramount-for-economic-transformation-Panellists-1944751",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/GEF24-Unified-vision-paramount-for-economic-transformation-Panellists-1944751",
    "title": "GEF24 : Unified vision paramount for economic transformation – Panellists",
    "seendate": "20240809T123000Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/790/79007358.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 08 09 → Article 1944751 Business News of Friday, 9 August 2024 Disclaimer Source: thebftonline.com 2024-08-09 GEF24: Unified vision paramount for economic transformation – Panellists « Prev Next » Comments (1) Listen to Article Share: Panellists at the forum A well-coordinated financial sector and a comprehensive national development plan backed by strong political leadership are indispensable elements if the nation is to redefine its economic model, key industry leaders have stressed. Speaking as part of a high-level panel at the 13th Ghana Economic Forum (GEF) organised by the B&FT, under theme ‘Re-engineering Ghana’s Economic Model for Sustainable Development: A Robust Financial Sector, Political Leadership & National Development Plan is Key’, they insisted there must be a well-defined picture of the collective future aspired to by all Ghanaians. “A development plan should do a couple of things. First and foremost, locate where we are now, ask additional questions and then cast a vision for the future,” a former Commissioner at the National Planning Development Commission (NDPC) Dr. Eben Armah said. He noted the previous 40-year development plan, launched in 2017, was not effectively implemented due to a lack of political commitment and stakeholder alignment. Dr. Armah stressed the importance of broad-based engagement to ensure the new plan – Vision 2057, which he said would span 25 years, eight election cycles and coincide with Ghana’s 100th year of independence – has full ownership and continuity regardless of changes in political leadership. “Once we’re set in stone that there is agreement, it becomes a plan. Nobody can change it,” he said, underscoring the need for all stakeholders within the political economy and the Executive to be on board with the development strategy. Addressing the financial sector’s role, Chief Executive Officer (CEO) Ghana Stock Exchange (GSE) Abena Amoah highlighted the capital markets as a crucial tool for national economic transformation. “The capital markets are such an important tool for national economic development and transformation… Foreign capital is good but we need to have a framework that better mobilises domestic capital,” she said. Ms. Amoah elaborated on the need to mobilise domestic savings, saying they would be channelled into investments, infrastructure and business development. She also underscored the importance of policy support and a conducive macroeconomic environment for growth of the capital markets. Sharing Ghana Statistical Service data – which showed that the country’s real Gross Domestic Product (GDP) at 2013 constant prices grew from GH¢29.81billion in 2013 to GH¢50.64billion in 2023, a modest 10-year increase of around 70 percent – she noted that the capital market is a reflection of the broader economy. “High interest rates and a depreciating currency affects all of us. We cannot live sustainably,” the GSE MD added, highlighting the need for policymakers to address macroeconomic challenges impacting the financial sector and broader economy. The GSE’s market capitalisation has reached record highs over the past 14 months and currently sits at around GH¢92billion, yet market observers have decried the impact of inflation and currency depreciation on the stock market’s real growth. A concern raised by a financial advisory consultant, Richmond K. Frimpong, was a seeming lack of coordination among the regulators’ various components of the financial sector – including banking, insurance, pensions and asset management. He argued that a more integrated approach, potentially through the creation of a “national financial services authority”, could help channel domestic savings more effectively into productive investments. “Instead of just having a regulator that looks at one arm depending on their own strength and leadership, we need to have a superstructure that’s able to look at where domestic savings is sitting in that ecosystem and channel policy – then bring it to the centre in driving financial literacy,” said a financial sector expert. The Financial Stability Council was established in 2018 in the wake of the sector clean-up to “identify and evaluate the threats, vulnerabilities and risks to the financial sector’s stability”, but has come under criticism for other developments in the financial sector since its establishment. The council is chaired by the Bank of Ghana Governor and its members are a Deputy Governor of the Bank of Ghana; a Deputy Minister of the Ministry of Finance; and the Director-General of the Securities and Exchange Commission (SEC). Others are the National Insurance Commission (NIC) Commissioner, the Chief Executive Officer-National Pensions Regulatory Authority (NPRA) as well as the CEO-Ghana Deposit Protection Corporation (GDPC). Mr. Frimpong also highlighted a need to address the financial literacy gap among Ghanaians, with the panelist estimating that only about 20 percent of the population has a clear understanding of different available financial products and services. “Until now, they have seen the backdrop of challenges we’ve had during the last few months and years in our financial health system, where the work that’s gone on over the years bringing people to appreciate why financial independence and cooperation is critical – and why it is required for somebody to put some funds somewhere for a rainy day,” he said. On his part, Kwame Jantuah – Chairman-Oil and Gas sector, Association of Ghana Industries (AGI) – stressed the critical role of political leadership in driving the economic transformation agenda and ensuring continuity for the national development plan across election cycles. He stated that economic challenges currently facing the country, while significant, are not insurmountable. Mr. Jantuah advocated for a more strategic and concentrated approach to national development. He underscored the necessity for a collective consensus on prioritising the nation’s most pressing issues, urging that all stakeholders come together to identify and tackle these priorities in a systematic and collaborative manner. “Our economic problems, though formidable, are not beyond our ability to resolve. It is imperative that we adopt a focused approach to our development, whereby we reach a consensus on what truly matters most. Once we agree on these priorities, every stakeholder must commit to addressing them with unwavering dedication and unity of purpose,” he said. The Dean-PSA Law School, Professor Ernest Kofi Abotsi, doubled down on calls for the adoption of a “long-term, bipartisan economic plan based on the constitution”. He argued that this approach will help address the country’s persistent economic challenges by preventing short-term, politically motivated policies which are often discarded with changes in government. Prof. Abotsi believes a shared economic blueprint will ensure policy consistency and stability without sacrificing social protection. “A sustainable economic future requires a delicate balance between growth and equity. By fostering a bipartisan economic blueprint, we can create a nation where prosperity is shared and social safety nets are strengthened,” he noted. Related Articles: 37,000 football fields of forests lost each year – Report Private sector must be seen as a partner, not a competitor - Alex Dadey Trade-based money laundering topping the agenda BoG's gold reserves hit 38.04 tonnes in October 2025 GRA unveils Modified Taxation Scheme to widen informal tax net Read all related articles Comments: This article has 1 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.devdiscourse.com/article/law-order/3046301-ethiopia-opens-doors-for-independent-forex-bureaus-amid-financial-reform",
    "url_mobile": "https://www.devdiscourse.com/article/law-order/3046301-ethiopia-opens-doors-for-independent-forex-bureaus-amid-financial-reform?amp",
    "title": "Ethiopia Opens Doors for Independent Forex Bureaus Amid Financial Reform",
    "seendate": "20240808T213000Z",
    "socialimage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/30_05_2024_21_35_16_8093416.png?&format=jpeg",
    "domain": "devdiscourse.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Ethiopia Opens Doors for Independent Forex Bureaus Amid Financial Reform Ethiopia begins licensing independent foreign exchange bureaus as part of its financial sector liberalization. The move follows the recent floatation of the birr currency and the approval of a $3.4 billion program from the IMF, aiming to transform the financial landscape and address economic challenges. Devdiscourse News Desk | Updated: 08-08-2024 21:48 IST | Created: 08-08-2024 21:48 IST AI Generated Representative Image SHARE Ethiopia has taken a crucial step in its financial sector liberalization by licensing independent foreign exchange bureaus, the central bank announced on Thursday. This initiative follows the recent floatation of the local birr currency, which was part of the government's broader economic reform program. Late last month, Africa's second-most populous nation secured a four-year, $3.4 billion program from the International Monetary Fund (IMF), enabling long-awaited debt restructuring. The National Bank of Ethiopia's strategy aims to reshape and expand the financial sector significantly, according to central bank governor Mamo Mihretu. 'With the licensing of independent FX bureaus, we are making yet another important milestone in the opening up of Ethiopia's financial sector and aligning it with global norms and best practices,' Mihretu stated. Facing high inflation and chronic foreign currency shortages, Ethiopia defaulted on its debt at the end of last year, making it the third African economy to do so recently. The nation has been in talks with the IMF to establish a new lending program, following an abandoned 2019 agreement impacted by conflict in Tigray. Prime Minister Abiy Ahmed defended the move to a market-determined exchange rate, emphasizing that it aimed to close the gap between official and black market rates. (With inputs from agencies.) Advertisement POST / READ COMMENTS"
  },
  {
    "url": "https://www.ibtimes.co.in/rbi-governor-highlights-indias-financial-resilience-amidst-globaluncertainties-870961",
    "url_mobile": "https://amp.ibtimes.co.in/rbi-governor-highlights-indias-financial-resilience-amidst-globaluncertainties-870961",
    "title": "RBI Governor Highlights Strength and Concerns in India Financial Sector",
    "seendate": "20240808T144500Z",
    "socialimage": "https://data1.ibtimes.co.in/en/full/800850/shaktikanta-das-25th-governor-reserve-bank-india-rbi.jpg",
    "domain": "ibtimes.co.in",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Crackdown on all hospital lockers underway after AK-47 discovery from GMC Anantnag"
  },
  {
    "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2024/08/08/indonesia039s-economic-growth-remains-strong-amid-global-uncertainty-imf",
    "url_mobile": "",
    "title": "Indonesia economic growth remains strong amid global uncertainty : IMF",
    "seendate": "20240808T081500Z",
    "socialimage": "https://apicms.thestar.com.my/uploads/images/2024/08/08/2847641.jpg",
    "domain": "thestar.com.my",
    "language": "English",
    "sourcecountry": "Malaysia",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Erwin Haryono. - File photo JAKARTA: (Bernama-Antara) The International Monetary Fund (IMF) has assessed that Indonesia's economic growth remains robust despite external turbulence, with inflation maintained at the target range and a resilient financial sector, reported Antara news agency. \"Indonesia's prudent policy framework in both the monetary, fiscal, and financial sectors is assessed by the IMF as having created a solid foundation for macro stability and social welfare,\" said Head of the Communications Department of Bank Indonesia (BI) Erwin Haryono in Jakarta on Thursday (Aug 8). IMF's assessment of Indonesia's economy in the 2024 Article IV Consultation report was released yesterday (August 7). The IMF Board of Directors expressed appreciation and positive remarks regarding the policy measures taken by Indonesian authorities. This was noted in several key areas: Indonesia's commitment to fiscal discipline, inflation reduction within the established target range, data dependent monetary policy, market deepening efforts, and enhancing the effectiveness of monetary policy transmission. Other important points included strengthening the macroprudential policy framework, the growth agenda towards high-income status by 2045, and commitments to achieve zero emissions by 2060, including measures to limit greenhouse gas emissions and deforestation. In its report, the IMF projected that Indonesia's economic performance would remain high, at 5 per cent and 5.1 per cent in 2024 and 2025 respectively, amidst risks such as commodity price volatility, slowing growth in major trading partner countries, and spillovers from prolonged high interest rates in global finance. The IMF recommended maintaining fiscal prudence, appreciating Indonesia's monetary policy stance, continuing reforms to protect the resilience of the financial sector, supporting financial market deepening, and bridging structural gaps to achieve higher and more inclusive growth to support Indonesia's Vision 2045. The IMF's positive outlook aligns with Bank Indonesia's assessment, which anticipates continued strong growth and resilience of the Indonesian economy against global spillovers. Bank Indonesia will continue to strengthen policy coordination with the government to mitigate global uncertainty risks while maintaining independence in achieving its legislated goals. Coordination of monetary and fiscal policies will also be reinforced to maintain macroeconomic stability, financial sector stability, and economic growth momentum.- Bernama-Antara Follow us on our official WhatsApp channel for breaking news alerts and key updates! Tags / Keywords: Indonesia , economic growth , strong , amid , global uncertainty , IMF , Report a mistake What is the issue about? Spelling and grammatical error Factually incorrect Story is irrelevant This field is mandatory. Please provide details of the report. Email (optional) Please enter valid email. Report issue Report issue Cancel Invalid captcha response. Please re-try again. Thank you for your report! Related News Indonesia 1d ago Who was Indonesia’s strongman Suharto? Corporate News 1d ago Eni, PETRONAS JV to launch eight upstream projects in Indonesia, Malaysia Corporate News 1d ago Ramssol enters Indonesia EV market through bike leasing partnership"
  },
  {
    "url": "https://www.livemint.com/bank-holidays-india/august",
    "url_mobile": "",
    "title": "Bank Holidays in August 2024 | List of August Bank Holidays in 2024",
    "seendate": "20240808T081500Z",
    "socialimage": "https://www.livemint.com/lm-img/static/default/newmintdefault-120.jpg",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Business News / Bank Holidays India / Bank Holidays in August 2025 August Bank Holidays in India Summary India observes a wide range of banking holidays throughout the year. These holidays include national holidays, state-specific festivals, and important observances. The Reserve Bank of India (RBI) designates certain holidays under the Negotiable Instruments Act, Real-Time Gross Settlement (RTGS) holidays, and Banks' Closing of Accounts. On these designated holidays, banks suspend their operations, and physical banking services are not available. However, modern digital banking solutions have made it convenient to manage financial transactions even during holidays. Online banking platforms, mobile apps, and digital payment methods like UPI, IMPS, and net banking remain accessible, enabling users to perform various financial tasks seamlessly. In addition to the holidays prescribed by the RBI, each state in India has its own set of regional festivals and holidays. These state-specific holidays vary across different regions, adding further diversity to the banking holiday calendar. Please note that banks in India are also closed on second and fourth Saturdays of each month, along with Sundays, as part of the regular weekly holidays. To help you plan ahead, we provide a comprehensive list of banking holidays in India for the year 2025. This list covers holidays in all states and union territories, ensuring you have the necessary information to manage your financial activities effectively. Whether you need to make payments, perform online transactions, or plan your banking activities, our banking holiday guide will assist you in staying updated and organized throughout the year. Please keep in mind that banking holiday schedules may be subject to changes or additions. It is always advisable to cross-check with official announcements and notifications from the Reserve Bank of India and your respective state governments for any updates or revisions to the holiday calendar. State Select Select Andaman and Nicobar Islands Andhra Pradesh Arunachal Pradesh Assam Bihar Chandigarh Chhattisgarh Dadra and Nagar Haveli and Daman and Diu Delhi Goa Gujarat Haryana Himachal Pradesh Jammu and Kashmir Jharkhand Karnataka Kerala Ladakh Lakshadweep Madhya Pradesh Maharashtra Manipur Meghalaya Mizoram Nagaland Odisha Puducherry Punjab Rajasthan Sikkim Tamil Nadu Telangana Tripura Uttar Pradesh Uttarakhand West Bengal Month August Select January February March April May June July August September October November December List of Bank Holidays Andaman And Nicobar Islands DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Andhra Pradesh DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Arunachal Pradesh DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Assam DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Bihar DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Chandigarh DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Chhattisgarh DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Dadra And Nagar Haveli And Daman And Diu DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Delhi DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Goa DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi 28 Aug 2025 Thursday Ganesh Chaturthi Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Gujarat DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Shri Krishna Astami 16 Aug 2025 Saturday Parsi New Year 27 Aug 2025 Wednesday Ganesh Chaturthi 28 Aug 2025 Thursday Ganesh Chaturthi Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Haryana DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Himachal Pradesh DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Jammu And Kashmir DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Jharkhand DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Karnataka DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 26 Aug 2025 Tuesday Ganesh Chaturthi 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Kerala DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 26 Aug 2025 Tuesday Ganesh Chaturthi 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Ladakh DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Lakshadweep DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Madhya Pradesh DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Maharashtra DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 15 Aug 2025 Friday Parsi New Year (Shahenshahi) 16 Aug 2025 Saturday Parsi New Year 27 Aug 2025 Wednesday Ganesh Chaturthi 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Manipur DATE DAY HOLIDAY 13 Aug 2025 Wednesday Patriots Day 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Meghalaya DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Mizoram DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Nagaland DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Odisha DATE DAY HOLIDAY 8 Aug 2025 Friday Tendong Lho Rum Faat 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Puducherry DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Punjab DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Rajasthan DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Shri Krishna Astami 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Sikkim DATE DAY HOLIDAY 8 Aug 2025 Friday Tendong Lho Rum Faat 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Shri Krishna Astami 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi 28 Aug 2025 Thursday Nuakhai Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Tamil Nadu DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Telangana DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami 27 Aug 2025 Wednesday Ganesh Chaturthi Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Tripura DATE DAY HOLIDAY 3 Aug 2025 Sunday Ker Puja 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Janmashtami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Uttar Pradesh DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Shri Krishna Astami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) Uttarakhand DATE DAY HOLIDAY 9 Aug 2025 Saturday Rakshabandhan 15 Aug 2025 Friday Independence Day 16 Aug 2025 Saturday Shri Krishna Astami Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) West Bengal DATE DAY HOLIDAY 15 Aug 2025 Friday Independence Day Note : This bank holiday data is provisional and subject to change, pending final confirmation from the Reserve Bank of India (RBI) NEWS Veterans Day Holiday: Are banks, stock market, schools, post offices open or closed in America? 1 min read 11 Nov 2025 From post offices to banks, here’s everything that will be closed on Veterans Day 2025 2 min read 11 Nov 2025 Veterans Day 2025: Check out services that stay functional on 11 November — complete list here 2 min read 11 Nov 2025 Veterans Day 2025: Free food offers at Texas Roadhouse, Applebee’s and other restaurants for service members on Nov 11 3 min read 11 Nov 2025 More From News State List for Bank Holidays in India Andaman and Nicobar Islands Bank Holidays Andhra Pradesh Bank Holidays Arunachal Pradesh Bank Holidays Assam Bank Holidays Bihar Bank Holidays Chandigarh Bank Holidays Chhattisgarh Bank Holidays Dadra and Nagar Haveli and Daman and Diu Bank Holidays Delhi Bank Holidays Goa Bank Holidays Gujarat Bank Holidays Haryana Bank Holidays Himachal Pradesh Bank Holidays Jammu and Kashmir Bank Holidays Jharkhand Bank Holidays Karnataka Bank Holidays Kerala Bank Holidays Ladakh Bank Holidays Lakshadweep Bank Holidays Madhya Pradesh Bank Holidays Maharashtra Bank Holidays Manipur Bank Holidays Meghalaya Bank Holidays Mizoram Bank Holidays Nagaland Bank Holidays Odisha Bank Holidays Puducherry Bank Holidays Punjab Bank Holidays Rajasthan Bank Holidays Sikkim Bank Holidays Tamil Nadu Bank Holidays Telangana Bank Holidays Tripura Bank Holidays Uttar Pradesh Bank Holidays Uttarakhand Bank Holidays West Bengal Bank Holidays Month Wise Bank Holidays Bank Holidays in January Bank Holidays in February Bank Holidays in March Bank Holidays in April Bank Holidays in May Bank Holidays in June Bank Holidays in July Bank Holidays in August Bank Holidays in September Bank Holidays in October Bank Holidays in November Bank Holidays in December Recommended For You No Network Internet Not Available Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue You are just one step away from creating your watchlist! Login Now Wait for it… Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. Yes, Continue"
  },
  {
    "url": "http://english.www.gov.cn/news/202408/02/content_WS66acdd34c6d0868f4e8e9b40.html",
    "url_mobile": "",
    "title": "China to power modernization drive through financial sector reform : official",
    "seendate": "20240802T151500Z",
    "socialimage": "",
    "domain": "english.www.gov.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "App HOME NEWS INSTITUTIONS POLICIES ARCHIVE 中文 HOME NEWS INSTITUTIONS POLICIES ARCHIVE 中文 China to power modernization drive through financial sector reform: official Updated: August 2, 2024 21:20 Xinhua BEIJING, Aug. 2 -- China will make further efforts to deepen the reform of its financial sector, aiming to support the country's modernization endeavors, a Central Finance Commission official has said. Wang Jiang made the remarks in an interview with Xinhua after the 20th Communist Party of China (CPC) Central Committee's third plenary session outlined major tasks to deepen reform in the financial sector. China's financial sector still faces prominent problems such as financial risks, the relatively low quality and efficiency of financial services, corruption, and relatively weak financial supervision and governance capacities, said Wang, who also works with the Central Financial Work Commission. To implement the guiding principles of last month's CPC plenum, efforts should be made to improve the central bank system and the monetary policy transmission mechanism, and work should be done to build a modern financial institution, market, product and services system, he said. The capital market's functions related to balancing investment and financing should be improved, the reform of the financial regulatory system should be deepened, and the incentive and constraint mechanisms serving the real economy should be optimized, Wang noted. The official also called for the promotion of the financial sector's high-standard opening-up, and strengthening formulation of financial laws and regulations. He called for efforts to accelerate the construction of a modern financial system with Chinese characteristics, focus on preventing and defusing financial risks, strengthen financial regulation comprehensively, and continue increasing financial support for the real economy through reform. \"We must strike an effective balance between all aspects of reform, coordinate efforts to prevent risks, strengthen regulation, promote development, and strive to achieve the best results,\" Wang said. Copyright© www.gov.cn | About us | Contact us Website Identification Code bm01000001 Registration Number: 05070218 All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to www.gov.cn. Without written authorization from www.gov.cn, such content shall not be republished or used in any form. Mobile Desktop Copyright© www.gov.cn | Contact us Website Identification Code bm01000001 Registration Number: 05070218"
  },
  {
    "url": "https://www.livemint.com/industry/banking/digitalization-revolution-upi-online-banking-middle-level-staff-labour-reforms-upskilling-bankers-ai-gdp-digital-economy-11722578261364.html",
    "url_mobile": "https://www.livemint.com/industry/banking/digitalization-revolution-upi-online-banking-middle-level-staff-labour-reforms-upskilling-bankers-ai-gdp-digital-economy/amp-11722578261364.html",
    "title": "Mint Explainer : How middle - level banking staff is paying the price for digitalization - led growth",
    "seendate": "20240802T074500Z",
    "socialimage": "https://images.livemint.com/img/2024/08/02/600x338/3-0-21078159-iStock-1071770928-0_1679823649460_1722581003742.jpg",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Mint Explainer Mint Explainer: How middle-level banking staff is paying the price for digitalization-led growth Nandita Venkatesan 3 min read 02 Aug 2024, 12:32 pm IST India has been at the forefront of the digitalization “revolution” through initiatives such as India Stack, UPI and consent-based data sharing. Summary The digitalization comes with its trade-offs. While it could contribute to higher growth, it's disrupting jobs landscape in the financial sector, shows the RBI's Currency and Finance report for 2023-24 Gift this article This is a Mint Premium article gifted to you. Subscribe to enjoy similar stories. Subscribe now MUMBAI : In Currency and Finance report for 2023-24 , the Reserve Bank of India (RBI) points out that digitalization is disrupting the jobs landscape in the financial sector and driving out middle-level banking staff. This comes even as digitalization is expected to constitute a fifth of India's gross domestic product (GDP) by 2026, doubling from 10% at present. The central bank also flagged potential challenges related to digital upskilling and the required employee adaptability. Mint explores the pros and cons of digitisation as highlighted in the RBI's 29 July report. What will be the impact of digitalization on India’s economic growth? According to the RBI, India has been at the forefront of the digitalization “revolution\" through initiatives such as India Stack, unified payments interface (UPI) and “consent-based data sharing\". The banking system has also contributed to the digital push by enabling direct benefit transfers. The central bank estimates the impact of digitalization on India’s economic output as measured by gross value added (GVA), under four scenarios: 1) Business as usual. 2) Only increase in capital investments 3) Increase in capital as well as information and communication technologies’ (ICT) investments. 4) ICT and capital investments, combined with investments in human capital. Investments in digital tech infrastructure can help India achieve real GVA growth (growth stripped of inflation) of 8.2% by 2030, according to the report. This is versus the current growth of 7.2% as of 2023-24. However, the central bank contends that India can achieve “maximum growth\" only when labour reforms are also undertaken. Labour reforms can push India’s growth above 9%. “The investment-led growth path may lose momentum unless supported by reforms that focus on productivity, human capital and higher labour force participation,\" the RBI stated. Also Read: Reform the UPI system: We need sustainable digital payments infrastructure How would digital push, though, affect the labour force in the financial sector? The central bank states that with most clerical jobs in the financial sector facing automation, the low- and middle-tier jobs are being displaced by technology. This calls for greater investments in upskilling. Employees in support roles have decreased in India’s financial sector while the number of professionals/technicians have risen, mirroring a global trend, the RBI says. The share of support staff (e.g. customer service representatives) in the banking sector has steadily fallen in the past decade from 50% to 26% in 2022-23. The proportion of bank officers to support staff stands at 74:26 as of 2022-23. Also Read: Eco survey flags impact of AI on workers, puts onus on pvt sector to create jobs What solutions has the RBI proposed? Financial institutions need to invest in digital upskilling of their staff, according to the report. “Digitalization may induce human resource challenges in the financial sector, necessitating strategic investments in upskilling and reskilling,\" governor Shaktikanta Das stated in his foreword to the report. The report also flagged some potential challenges in the skilling drive. These include adaptability of employees and management to imbibe new digital tools and high turnover rates in banks leading to loss of institutional knowledge once the employee exits the company. Also Read: RBI’s jobs data has economists baffled, spurs a quantity versus quality debate What is the situation world-wide? Over the past decade, the global digital economy has grown 2.5 times faster than the physical world economy, accounting for over 15% of global GDP (United Nations, 2023). A report by investment banking major Citigroup released in June this year shows that the banking sector will be the hardest hit, with automation threatening 54% of human jobs. This is followed by insurance (48%) and software sector (36%). By 2028, the \"profit pool\" for the global banking sector could increase 9%, or $170 billion from the adoption of AI, rising from just over $1.7 trillion to close to $2 trillion, the report states. Gift this article Catch all the Industry News , Banking News and Updates on Live Mint. Download The Mint News App to get Daily Market Updates . more less topics #in charts #Banking #RBI #mint-explainer"
  },
  {
    "url": "https://www.forbes.com/sites/ronshevlin/2024/07/31/americans-want-open-banking-but-dont-know-what-that-means/",
    "url_mobile": "",
    "title": "Americans Want  Open Banking  ( But Dont Know What That Means ) ",
    "seendate": "20240731T214500Z",
    "socialimage": "https://imageio.forbes.com/specials-images/imageserve/66aa70e229bee43b04a31eae/0x0.jpg?format=jpg&crop=3462,2434,x494,y117,safe&fit=bounds",
    "domain": "forbes.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Money Fintech Americans Want ‘Open Banking’ But Don’t Know What That Means By Ron Shevlin , Senior Contributor. Forbes contributors publish independent expert analyses and insights. Observations from the Fintech Snark Tank Follow Author Jul 31, 2024, 05:21pm EDT Oct 23, 2024, 12:19pm EDT Share Save Comment Laptop safe with gold bars isolated on white background 3D rendering getty OBSERVATIONS FROM THE FINTECH SNARK TANK More and more, whenever I see the term “open banking” being used, my eyes roll and I think “ok, let’s see how this over-used, under-defined term is being used this time.” Recent incidences: 1) An academic study titled “ Open data and API adoption of US Banks ” which equates the use of APIs with open banking, and 2) a Pymnts article titled “ 46% of US Consumers Say They’re Ready for Open Banking .” Does Open Banking Equal API Adoption? The authors of the academic study say the report focuses on “the implications of API and open banking adoption for traditional banks in the US.” The report found that “banks that adopt APIs tend to face lower competitive pressure, are less capital-intensive, and experience: 1) an increase in ROA and Tobin’s Q, and 2) a decrease in loan loss provisions.” The causal inference here—that adopting APIs leads to increased ROA and a decrease in loan loss provisions—is pretty shaky. Getting back to “open banking,” though, the report cites research that found that: “Open banking and bank data portability might result in unintended consequences for bank and fintech competition and borrower welfare. Allowing voluntary data porting by consumers can lead to possible unraveling (i.e., customers are compelled to share data as non-disclosure will be perceived negatively by providers) and negative data externality for customers who don’t share data. The loss of customer information due to fintech competition can disrupt information spillover within banks (e.g., by using payment data to learn about consumers’ credit quality).” MORE FROM FORBES ADVISOR How To Buy Cryptocurrency Best Cryptocurrencies To Buy Now Best Cryptocurrency Exchange Proponents of open banking never seem to address these unintended consequences. Are Open Banking Payments Really Open Banking? When I saw that “46% of US consumers say they’re ready for open banking” my first reaction was “Really? What do these Americans think ‘open banking’ is?” It turns out that it’s not really “open banking” the article was talking about—it’s “open banking payments .” The article says: “Open banking payments stand on the verge of widespread acceptance. This payment method, which allows users to complete transactions directly from their bank accounts using familiar online banking credentials, offers an alternative to traditional methods by bypassing credit card details.” The article cites a study which found that younger consumers are more interested than older ones in “open banking payments” and that the “disparity suggests that open banking providers should focus their marketing efforts on younger demographics, who are more inclined to integrate this payment method into their routine transactions.” Three reactions here: 1) “Open banking payments” doesn’t sound like “API adoption” 2) Interest in “open bank payments” doesn’t mean interest in “open banking,” and 3) What are “routine” transactions? ‘Open Banking’ is a Meaningless Term The term “open banking” has become nearly meaningless. “Open banking providers” may want to redefine the space they playing in. The academic study claims that it provides “insight into the role of competitive pressures on the decision to adopt an open banking strategy.” Just one problem: There is no such thing as an “open banking strategy.” And proponents of open banking—whatever that might be—who believe that “consumers want it” should check a Q4 2023 Axway survey which found that only 55% of Americans have heard of open banking, and just 32% say they understand it. It’s a step too far to say Americans want—or are ready for—open banking. Editorial Standards Reprints & Permissions"
  },
  {
    "url": "https://www.thedailystar.net/business/news/politically-motivated-lending-causing-bad-loans-spiral-wb-3665071",
    "url_mobile": "https://www.thedailystar.net/business/news/politically-motivated-lending-causing-bad-loans-spiral-wb-3665071?amp",
    "title": "Politically - motivated lending causing bad loans to spiral : WB",
    "seendate": "20240729T183000Z",
    "socialimage": "",
    "domain": "thedailystar.net",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Business Business Politically-motivated lending causing bad loans to spiral: WB Tue Jul 30, 2024 12:00 AM Last update on: Tue Jul 30, 2024 10:11 AM Rejaul Karim Byron , AM Jahid Tue Jul 30, 2024 12:00 AM Last update on: Tue Jul 30, 2024 10:11 AM The amount of bad loans has been spiralling in Bangladesh owing to rampant politically-motivated lending and inadequate credit risk management, according to a World Bank report. \"Non-performing loans (NPLs) are rising, triggered by widespread related-party and politically directed lending on the back of weak credit risk management,\" it said. For all latest news, follow The Daily Star's Google News channel. The global lender prepared the report as a project information document for a $400 million loan project for Bangladesh, which is still under scrutiny. This project is designed to support financial stability and inclusion by enhancing financial sector infrastructure and safety net and fostering access to catalytic private sector finance in Bangladesh. The WB said NPLs had officially increased by 20.7 percent year-on-year at the end of December 2023 to 9 percent of the loan portfolio, but that was significantly understated due to lax NPL definition, poor accounting and disclosure standards and regulatory forbearance. Read more What’s really causing our non-performing loans to skyrocket? State-owned banks account for almost half of the NPLs, it added. \"Growing NPLs and rising cost of funds lower banks' returns and ability to build additional capital buffers, while the requirement to distribute dividends even by loss-making banks further depletes banks' reserves and increases risks to depositors and creditors,\" it added. The WB said the four watchdogs who regulate the financial sector -- namely Bangladesh Bank, Insurance Development and Regulatory Authority, Bangladesh Securities and Exchange Commission, and Microcredit Regulatory Authority -- lack operational independence, powers, skills, and the modern legislation necessary for sound financial sector development. Despite recent efforts supported by the World Bank and other international financial institutions, much of the financial sector regulatory framework still needs to be brought in line with international standards, it said. The banking sector's risks are also being triggered because of long-standing poor governance, weak market discipline, and low capital buffers, according to the report. \"The reported aggregate banking sector capital adequacy ratio (CAR) – 11.64 percent in December 2023 – is too low given the high level of risks in the banking sector. At least 16 banks are undercapitalised, with special BB waivers for deferred loan loss provisions (LLP) and capital increases.\" Besides, the existing framework for intervening in ailing financial institutions is weak, with authorities relying on mergers and capitalisation using state money to deal with failing banks, it said. In December 2023, the central bank adopted a new Prompt Corrective Action (PCA) framework, supported by the WB, but it will not be fully in force until April 1, 2025, it said. As a way forward, the World Bank said broad-based financial sector reforms are crucial for mobilising the private capital necessary to drive further growth. \"This in return requires the authorities to address in a timely and orderly manner the persistent financial sector vulnerabilities which distort credit flows and, if left unattended, may lead to large losses to the budget and the people's savings.\" The WB also said the financial sector safety net and crisis preparedness framework need to be strengthened in the face of rising stability risks. The deposit insurance system (DIS) for banks and non-bank deposit-taking institutions, while established under BB two decades ago, is not fully operational and does not comply with international standards, according to the report. It said deposit insurance coverage is low and the payout mechanism is undeveloped and was never tested. While BB revoked the licences of several banks in the past, it did not trigger insured deposits despite a large accumulated DIS fund of nearly $ 1.2 billion as of the end 2023. \"The crisis response framework remains fragmented, non-transparent, and underdeveloped, including access to lender of last resort, least cost resolution and liquidation tools, use of government funds to bail out domestic systemically important banks, mandate and operations of financial stability committee, and crisis communications framework.\" Upgrading the regulatory and supervisory capacity of the central bank is also required to safeguard market confidence and foster sustainable financial intermediation, it said. The global lender added that while the banking sector has shown rapid growth in loans and deposits over the past decade, private sector access to credit is now constrained by tightened liquidity in the banking sector and rising interest rates. Private sector credit growth slowed to 9.9 percent in the first nine months of FY24 from 16.2 percent in the same period a year earlier. New letters of credit declined from $8 billion per month in FY22 to $5 billion per month in FY24, according to the report. Related topic: non-performing loans (npls) Bad loans NPL Bangladesh Click to comment Comments Comments Policy"
  },
  {
    "url": "http://usa.chinadaily.com.cn/a/202407/28/WS66a5b3e5a31095c51c51053a.html",
    "url_mobile": "",
    "title": "Pay cuts in finance sector signal the need to provide  good financial service  ",
    "seendate": "20240728T033000Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202407/28/66a5b470a31095c551b5e75f.png",
    "domain": "usa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Business Macro Companies Industries Technology Motoring China Data Finance Top 10 Home / Business / China Perspectives Home Business China Perspectives Pay cuts in finance sector signal the need to provide 'good financial service' chinadaily.com.cn | Updated: 2024-07-28 10:58 Share Share - WeChat CLOSE With the 3rd plenary session of the 20th CPC Central Committee outlining further financial reforms, Liu Qiao, dean of Peking University's Guanghua School of Management, told China Perspectives that pay cuts in the financial sector serves as a call for the sector to provide good financial service that better serves the real economy and promotes China's high-quality development. The financial sector needs an incentive mechanism to encourage innovation that serves high-quality economic development. Photo China Post strives to ensure package delivery for 'Double Eleven' online shopping festival Wuzhen's Internet museum reopens with new highlights CIIE Culture Night celebrates fusion of global arts and culture beyond trade 2025 WIC Light of Internet Expo kicks off in Wuzhen Global participation surges at 8th CIIE as exhibits hit record highs CIIE 2025 breaks records as global participation surges Most Viewed in 24 Hours State Council News China’s public holidays for 2026 Policies concerning expats, foreign enterprises in October 2025 Top 10 Top 10 countries attracting Chinese tourists Business focus Silk Road e-commerce Dewu rides wave of Chinese consumption China Data A look at China's economic data from Jan-Sept SOEs Fund for SOEs in place to spur innovation Special fund to support strategic emerging industries launched in Beijing Special Scholar calls for a collaborative and secure AI future in Wuzhen WIC Wuzhen Summit Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US CLOSE"
  },
  {
    "url": "https://www.moneycontrol.com/news/opinion/digital-initiative-financial-inclusion-and-msme-troika-takes-centre-stage-for-budget-2024-12776605.html",
    "url_mobile": "https://www.moneycontrol.com/news/opinion/digital-initiative-financial-inclusion-and-msme-troika-takes-centre-stage-for-budget-2024-12776605.html/amp",
    "title": "Digital initiative , financial inclusion and MSME troika takes centre stage for Budget 2024",
    "seendate": "20240724T051500Z",
    "socialimage": "https://images.moneycontrol.com/static-mcnews/2024/07/20240723122807_Budget-MSME-2024.jpg",
    "domain": "moneycontrol.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Home News Opinion Digital initiative, financial inclusion and MSME troika takes centre stage for Budget 2024 Digital initiative, financial inclusion and MSME troika takes centre stage for Budget 2024 The Budget announcements on DFM will bolster the efforts of the financial sector to support India's economic growth. This budget is expected to set the agenda for the next five years and provide a framework for regulators, financial institutions and market participants Moneycontrol Opinion July 24, 2024 / 09:57 IST DFM takes centre stage in this year's Budget. By Gurpreet Chhatwal The Union Budget for full fiscal 2025 strongly emphasises the critical role the financial sector needs to play in supporting economic growth through a series of welcome announcements. These will arm the lenders in increasing credit flow to the crucial sectors of the economy and optimise outcomes in 3 critical areas — credit expansion, financial inclusion and stressed assets resolution. Story continues below Advertisement Remove Ad And the tools used are referred to as the DFM troika , i.e., digital or tech-enabled initiatives, financial inclusion, and MSME (micro, small and medium enterprise) support measures. Digital Initiatives First, technology initiatives in agriculture through successful implementation of the Digital Public Infrastructure (DPI) can expand lending to this segment, supported by strengthened underwriting and monitoring to control the traditionally high non-performing assets in the sector. Related stories Bigger Banks, Bigger Ambitions: Why India must build banks with global heft ‘Predictable tactic’: India slams Pakistan for blaming it over Islamabad car blast Weight loss drug Wegovy to become cheaper as Novo Nordisk cuts prices by up to 37% Technology is also expected to contribute to strengthening the recovery ecosystem, with an integrated technology platform to improve implementation of the Insolvency and Bankruptcy Code. This, coupled with other proposed changes, such as strengthening of the tribunal and appellate tribunal, can improve its efficacy from the perspective of both enhancing recovery levels and speeding up the resolution process. Financial Inclusion Two, from an inclusion perspective, the government’s thrust on supporting affordable housing continues with a planned central assistance of Rs 2.2 lakh crore in the next five years. Story continues below Advertisement Remove Ad Together with the proposed interest subsidy, this will support growth for companies offering affordable-housing finance. These companies, on the back of a favourable regulatory dispensation and solid underlying demand, have been growing faster than traditional housing finance companies. Further, the proposed 3% interest subvention on education loans to youth currently not eligible for Government benefits should lead to robust growth in the segment. Several other steps focused on women and youth have also been announced. Boost to MSME Sector Third, and perhaps the most overarching thrust, has been on the MSME front — a number of measures have been proposed to support credit flow to this sector, such as introduction of a credit guarantee scheme for facilitating term loans to MSMEs for purchase of machinery and equipment without collateral or third-party guarantee, solidifying credit assessment criteria of MSMEs by public sector banks and providing guarantee from a government-promoted fund to ensure flow of credit to this sector even during stress periods. Further, the role of SIDBI has been enhanced from its hitherto primarily refinance focus to expanding direct lending to MSMEs in addition to raising the limit of MUDRA loans. Also, for facilitating MSMEs to unlock their working capital by converting their trade receivables into cash, the turnover threshold of buyers for mandatory onboarding on the TReDS platform has been reduced. To be sure, today the Indian financial sector is in sound health with strong profitability and comfortable capital buffers. The banking system’s provisioning cover and net non-performing assets are also at their all-time best levels. The measures announced in the Budget are expected to bolster the efforts of the financial sector in supporting overall economic growth by expanding the addressable credit base across various borrower segments, while at the same time supporting lenders’ asset quality. All said, the criticality of the financial sector in achieving the government’s objectives of growth and development is clearly reinforced by the plan for a financial sector vision and strategy document. While the final contours are awaited, this budget is expected to set the agenda for the next five years and provide a framework to guide the efforts of the government, regulators, financial institutions and market participants. Gurpreet Chhatwal is Managing Director, CRISIL Ratings Ltd. Views are personal and do not represent the stand of this publication. Moneycontrol Opinion first published: Jul 24, 2024 09:54 am Discover the latest Business News , Sensex , and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Advertisement Remove Ad Subscribe to Tech Newsletters Al Edge Newsletter On Saturdays Find the best of Al News in one place, specially curated for you every weekend. MC Tech 3 Newsletter Daily-Weekdays Stay on top of the latest tech trends and biggest startup news. Subscribe Trending news When UPSC Fails You: 12 Attempts, 7 Mains, 5 Interviews but NO Selection — the Most Heartbreaking IAS Story Ever Warren Buffett left his 3 kids $500 million a year to give away: 'Ruling from the grave does not...' Man gets Rs 5.7 crore plastic surgery after being bullied: 'If I become world’s most beautiful...' Dharmerndra discharged from hospital, family decides to take him home Jimmy Kimmel’s childhood friend and bandleader Cleto Escobedo III passes away at 59 IIT Factory: A small village in Bihar sends more students to IIT than most big cities JEE Main 2026: What Are Your Chances of Getting an IIT Admission? Last Year, Only 16.96% Qualified for JEE Advanced 11:11 Portal Opens Today (Nov 11, 2025): Manifestation Guide for Love, Wealth & Success - Dos, Don’ts, Rituals and Affirmations This hidden southeast Asian gem lets Indians travel abroad for under Rs 2,000 a day—and it’s absolutely stunning! Zoho founder Sridhar Vembu says he has a 'Plan B' for India if US bans Google, Meta, and Microsoft platforms Domino’s Pizza takes a jab at GTA VI launch delay; asks Rockstar Games if they need help Reliance Jio announces referral program for its customers: Rewards, benefits and all you need to know Nephrologist reveals 7 most common daily habits that cause damage to your kidneys Expert shares 5 best vegetables to reverse fatty liver naturally Weight loss drugs causing hair fall? Delhi-based dermatologist has easy solutions to stop hair loss Advisory Alert: It has come to our attention that certain individuals are representing themselves as affiliates of Moneycontrol and soliciting funds on the false promise of assured returns on their investments. We wish to reiterate that Moneycontrol does not solicit funds from investors and neither does it promise any assured returns. In case you are approached by anyone making such claims, please write to us at grievanceofficer@nw18.com or call on 02268882347 You got 30 Day’s Trial of Grab it Now Ad-Free Experience Top Articles from Financial Times Actionable Insights MC Research Economic Calendar & Many More You are already a Moneycontrol Pro user. OK Namrata Agarwal"
  },
  {
    "url": "https://economictimes.indiatimes.com/news/economy/policy/budget-at-a-glance-your-one-stop-for-top-industry-announcements-by-sitharaman/articleshow/111969014.cms",
    "url_mobile": "https://m.economictimes.com/news/economy/policy/budget-at-a-glance-your-one-stop-for-top-industry-announcements-by-sitharaman/amp_articleshow/111969014.cms",
    "title": "budget news : Budget at a Glance : Your one stop for top industry announcements by Sitharaman",
    "seendate": "20240723T193000Z",
    "socialimage": "https://img.etimg.com/thumb/msid-111969157,width-1200,height-630,imgsize-45224,overlay-economictimes/photo.jpg",
    "domain": "economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "PTI Finance minister Nirmala Sitharaman Finance Minister Nirmala Sitharaman on Tuesday presented the first budget for Modi 3.0, opening doors for several reforms and paving a growth roadmap for India. Meanwhile, the India Inc has lauded the budget calling it 'balanced'. ET takes a look at the top announcements for industry : MANUFACTURING BOOSTER Toys, Footwear, Leather get PLI: Toys, footwear and leather will be eligible for PLI scheme with the budget making a token Rs 1 lakh provision. The commerce and industry ministry has proposed an outlay of Rs 3,489 crore for toys and Rs 2,600 crore for footwear and leather under the expanded scheme. FINANCIAL SECTOR VISION Agenda for next 5 years: The government will bring out a financial sector vision and strategy document to prepare the sector in terms of size, capacity and skills. This will set the agenda for the next 5 years. INDUSTRIAL PARKS Live Events Plug and Play: Centre, in partnership with states and industry, will facilitate investment-ready “plug and play” industrial parks with complete infrastructure in or near 100 cities with town planning schemes. LITTLE CHANGE Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on budget news budget 2024 union budget Nirmala Sitharaman industry india inc manufacturing financial sector (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on budget news budget 2024 union budget Nirmala Sitharaman industry india inc manufacturing financial sector (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Sterlite back in Thoothukudi with green copper. Will it get the red carpet? Barrels to bytes & gigawatts: Inside RIL’s carefully scripted green ambition From heirloom to hedge: How India’s love for gold became a trillion-dollar powerhouse Bira 91 – From challenging king of good times to fight for survival Stock Radar: 30% rally in a month! Inox Green stock hits fresh record high; check target & stop loss Recovery in consumption: Rather than bet on 1 or 2, is it better to own a basket? 12 stocks with an upside potential of up to 32% 1 2 3 View all Stories"
  },
  {
    "url": "https://www.scmp.com/news/china/politics/article/3271494/beijing-trains-sights-chinas-vast-finance-sector-new-anti-corruption-body",
    "url_mobile": "https://amp.scmp.com/news/china/politics/article/3271494/beijing-trains-sights-chinas-vast-finance-sector-new-anti-corruption-body",
    "title": "Beijing trains sights on China vast finance sector with new anti - corruption body",
    "seendate": "20240723T043000Z",
    "socialimage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2024/07/23/a8009727-5441-473d-8857-d6cb2b1c5e91_a6f67bf7.jpg?itok=kMB25i5f&v=1721704771",
    "domain": "scmp.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Advertisement China’s third plenum China Politics Beijing trains sights on China’s vast finance sector with new anti-corruption body CCDI makes announcement following third plenum goal to ‘bring all financial activities under supervision’ Reading Time: 2 minutes Why you can trust SCMP 2 William Zheng Published: 12:00pm, 23 Jul 2024 Updated: 3:29pm, 23 Jul 2024 Beijing has founded a new anti-graft entity exclusively tasked with targeting the finance sector, according to the country’s top anti-corruption body. Advertisement The announcement of the founding of the watchdog came days after Beijing wrapped up a long-awaited third plenum of the ruling Communist Party’s elite last week. The gathering was capped with the release of hundreds of policy goals for the next five years, including to “bring all financial activities under supervision”. The new body was revealed in an article posted on Monday on the website of the Central Commission for Discipline Inspection (CCDI) , China’s top political discipline and anti-corruption body. 03:14 China’s Communist Party wraps up policy meeting amid growing uncertainties China’s Communist Party wraps up policy meeting amid growing uncertainties The article named Wang Weidong, 56, former anti-corruption chief in Tibet , as the party secretary of the “Central Financial Discipline Inspection and Supervision Working Commission”. Advertisement Advertisement Select Voice Choose your listening speed Get through articles 2x faster 1.25 x 250 WPM Slow Average Fast 00:00 00:00 1.25 x"
  },
  {
    "url": "https://www.devdiscourse.com/article/business/3025474-financial-sector-outlook-appears-bright-but-needs-to-brace-for-vulnerabilities-survey",
    "url_mobile": "https://www.devdiscourse.com/article/business/3025474-financial-sector-outlook-appears-bright-but-needs-to-brace-for-vulnerabilities-survey?amp",
    "title": "Financial sector outlook appears bright , but needs to brace for vulnerabilities : Survey",
    "seendate": "20240722T103000Z",
    "socialimage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_19_18_04_5779125.jpg?&format=jpeg",
    "domain": "devdiscourse.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Financial sector outlook appears bright, but needs to brace for vulnerabilities: Survey The outlook for Indias financial sector appears bright, but it needs to brace for likely vulnerabilities, said Economic Survey 2023-24 tabled in Parliament on Monday.The Indian financial sector is at a turnpike moment, it said, adding that the dominance of banking support to credit is being reduced, and the role of capital markets is rising.For a country that aspires to be a developed nation by 2047, this is a long-awaited and welcome development, it said. PTI | New Delhi | Updated: 22-07-2024 13:30 IST | Created: 22-07-2024 13:30 IST Country: India SHARE The outlook for India's financial sector appears bright, but it needs to brace for likely vulnerabilities, said Economic Survey 2023-24 tabled in Parliament on Monday. The Indian financial sector is at a ''turnpike moment'', it said, adding that the dominance of banking support to credit is being reduced, and the role of capital markets is rising. For a country that aspires to be a developed nation by 2047, this is a long-awaited and welcome development, it said. ''Being reliant on and exposed to the capital market, however, comes with its challenges and trade-offs. As India's financial sector undergoes this critical transformation, it must also brace for likely vulnerabilities and prepare itself with regulatory and government policy levers to intervene and hedge, as required,'' it said. Even as banks, non-banks and corporates battled balance-sheet excesses, the consequences of the credit boom of the first decade of the new millennium and the inevitable bust that followed in the second decade, the broad industry kept advancing the cause of financial inclusion and financial deepening, it said. ''Moving forward, healthier corporate and bank balance sheets will further strengthen private investment. The positive trends in the residential real estate market indicate that the household sector capital formation is increasing significantly,'' it said. As India embarks on the vision to become a developed country by 2047, it is imperative that financial intermediation costs decline globally, the Survey prepared by Chief Economic Adviser V Anantha Nageswaran and his team said. It further said the financial sector needs to support capital formation and promote trade, business, and investments in MSMEs, enabling them to scale. ''It also needs to provide insurance protection and retirement security to all citizens. The share of insurance and pension fund assets in GDP stands at 19 per cent and 5 per cent, respectively, in India, compared to a high of 52 per cent and 122 per cent in the US and 112 per cent and 80 per cent in the UK, leaving scope for further improvements,'' it added. Financial sector firms – public or privately owned – must become customer-centric. Without that, most quantitative metrics will remain elusive, it recommended. (This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.) READ MORE ON: Parliament Indian V Anantha Nageswaran India Advertisement ALSO READ Iraq's Parliamentary Elections Surpass Turnout Expectations Amid Boycotts and Violence: Iraq's Pivotal Parliamentary Election Winter Session of Parliament Set to Tackle Key National Issues Key Issues and Strategies for Upcoming Winter Session of Parliament President Droupadi Murmu Addresses Angolan Parliament, Deepens Ties POST / READ COMMENTS"
  },
  {
    "url": "https://www.thehindu.com/business/budget/economic-survey-2023-24-financial-sector-outlook-appears-bright-but-needs-to-brace-for-vulnerabilities/article68431914.ece",
    "url_mobile": "https://www.thehindu.com/business/budget/economic-survey-2023-24-financial-sector-outlook-appears-bright-but-needs-to-brace-for-vulnerabilities/article68431914.ece/amp/",
    "title": "Economic Survey 2023 - 24 : Financial sector outlook appears bright , but needs to brace for vulnerabilities",
    "seendate": "20240722T093000Z",
    "socialimage": "https://th-i.thgim.com/public/business/budget/jafp98/article68431938.ece/alternates/LANDSCAPE_1200/FinancialSector.jpg",
    "domain": "thehindu.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Primary healthcare registers rise in expenditure with reduction in out-of-pocket treatment cost: Economic Survey Bindu Shajan Perappadan"
  },
  {
    "url": "https://www.livemint.com/money/personal-finance/sebi-enables-credit-rating-agencies-to-give-ratings-in-gift-city-details-inside-11721494400861.html",
    "url_mobile": "https://www.livemint.com/money/personal-finance/sebi-enables-credit-rating-agencies-to-give-ratings-in-gift-city-details-inside/amp-11721494400861.html",
    "title": "Sebi enables credit rating agencies to give ratings in GIFT City . Details inside",
    "seendate": "20240721T060000Z",
    "socialimage": "https://images.livemint.com/img/2024/07/20/600x338/CRA_1721495032472_1721495038549.png",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "View Market Dashboard Sebi enables credit rating agencies to give ratings in GIFT City. Details inside With IFSCA being added to the list of financial sector regulators, the rating activities will be carried out in the IFSC-GIFT (Gujarat International Finance Tec-City) as well. MintGenie Team Published 21 Jul 2024, 10:16 AM IST Credit rating agencies tend to undertake the rating of financial instruments as per the respective guidelines framed by financial sector regulators or authorities The capital markets regulator Securities Exchange Board of India (Sebi) has issued instructions to enable credit rating agencies to undertake the rating of financial instruments in International Financial Services Centre (IFSC) - GIFT (Gujarat International Finance Tec-City) or GIFT City . In order to make this happen, Sebi has added International Financial Services Centres Authority (IFSCA) to the list of financial sector regulators, which is given in the master circular for CRAs dated May 16, 2024. It is noteworthy that credit rating agencies tend to undertake the rating of financial instruments according to the guidelines framed by different financial sector regulators. With IFSCA being added to this list of regulators, the rating activities will be carried out in the IFSC-GIFT city as well. These instructions were issued via a Sebi circular dated July 19, 2024. This Sebi circular lists the following provisions with regards to the credit rating agencies under IFSCA: 1. If there is an issue arising from the activities of such agencies in the IFSC, it will be dealt with by IFSCA under section 12 and 13 of IFSCA Act. 2. If there are complaints, enforcement actions, and furnishing information to third parties including statutory or judicial bodies with regards to the services provided by the CRAs in the IFSC, it will the responsibility of IFSCA to deal with them. Also Read | Sovereign credit ratings: Give local rating agencies a chance Meanwhile, the Sebi circular specifies that the ratings undertaken by a CRA under the guidelines of IFSCA will be under the purview of IFSCA only. Regulator for ESG rating providers Likewise, Sebi has issued another similar circular with regards to IFSCA which enables ESG rating providers (ERPs) to undertake ESG rating activities. For this, Sebi has issued instructions adding IFSCA to the list of financial sector regulators that are listed in the master circular for ERPs. Also Read | Mint Explainer: What are ESG rating providers and why should investors care? The Sebi circular, however, categorically mentions that the ESG ratings undertaken by an ERP under the guidelines of IFSCA will be under the purview of IFSCA only. Meanwhile, in another news, Reserve Bank of India recently allowed resident Indians to open foreign currency accounts in GIFT City. Mintgenie Money GIFT City Sebi Circular Get Latest real-time updates Catch all the Instant Personal Loan , Business Loan , Business News , Money news , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates. Business News Money Personal Finance Sebi enables credit rating agencies to give ratings in GIFT City. Details inside More Story Url has been added to your clipboard Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue"
  },
  {
    "url": "https://menafn.com/1108462387/Indian-Banks-Minimally-Affected-By-Global-Technology-Disruption-RBI",
    "url_mobile": "",
    "title": "Indian Banks Minimally Affected By Global Technology Disruption : RBI",
    "seendate": "20240720T184500Z",
    "socialimage": "https://menafn.com/updates/pr/2024-07/20/KI_2906aimage_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.newkerala.com/news/2024/42507.htm",
    "url_mobile": "",
    "title": "India financial sector is sound and resilient : RBI Governor",
    "seendate": "20240719T194500Z",
    "socialimage": "https://one.newkerala.com/images/t/bnews.webp",
    "domain": "newkerala.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "business-india India's financial sector is sound and resilient: RBI Governor IANS July 20, 2024 Mumbai, July 19 RBI Governor Shaktikanta Das said on Friday that amidst global challenges and uncertainties, India stands out as a fast-growing major economy with strong macroeconomic fundamentals, backed by a healthy and resilient financial sector. \"The recent annual financial results of banks and NBFCs indicate that the financial system remains sound and resilient. Further, macro stress tests done by the Reserve Bank reveal that the banking sector will continue to remain resilient even under stress scenarios,\" he observed at a media event here. Given the strong macroeconomic configuration, favourable demographics and significant pace of digitalisation, the Indian financial sector is poised to scale new heights, he added. In terms of market dynamics, the financial landscape in India is undergoing a structural transformation, driven by factors like innovations in technology, financial deepening, and changing savings and investment patterns. Each of these shifts has a bearing on how financial entities carry out their business and adapt to the emerging risks. The Reserve Bank has also been actively fostering innovation by envisaging mechanisms like the United Payment Interface (UPI), regulatory sandbox, co-lending models and account aggregator framework, Das said. With the synergies provided by mobile phone penetration, internet availability, reoriented payment systems and the multitude of customer data points, lending institutions as well as financial markets have been able to leverage upon such mechanisms to amplify their reach to the target segments and also carry forward the agenda of a more inclusive financial sector, he pointed out. Overall, there has been a transformation in the banking and financial landscape in the last decade driven by technological innovations, changing consumer preferences and the emergence of alternative business models. While these have fostered competition and collaboration, they also have implications for consumer trust and regulatory oversight. Such structural changes also create opportunities as well as challenges. Financial institutions like banks, NBFCs and others need to carefully assess the impact of these changes on their business models, resilience and sustainability, the Governor added. Disclaimer: This story was supplied by an external content provider; we do not endorse or accept responsibility for its accuracy, completeness, or any outcomes from relying on it. It is for informational purposes only and does not constitute legal, financial, medical, or other professional advice. Laws and regulations vary and may change; readers should verify accuracy and compliance with local requirements and consult a qualified professional for tailored guidance."
  },
  {
    "url": "https://www.livelaw.in/news-updates/sebi-enables-esg-and-credit-rating-activities-in-ifsc-gift-city-263916",
    "url_mobile": "https://www.livelaw.in/amp/news-updates/sebi-enables-esg-and-credit-rating-activities-in-ifsc-gift-city-263916",
    "title": "SEBI Enables ESG And Credit Rating Activities In IFSC - GIFT City",
    "seendate": "20240719T164500Z",
    "socialimage": "https://www.livelaw.in/h-upload/2024/06/29/546719-sebi.webp",
    "domain": "livelaw.in",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Academy Bazar NEW Login Account Subscribe Premium Home / News Updates / SEBI Enables ESG And Credit Rating... SEBI Enables ESG And Credit Rating Activities In IFSC-GIFT City Rajesh Kumar 19 July 2024 9:56 PM IST Share this To bolster the financial ecosystem at the International Financial Services Centre (IFSC) in Gujarat International Finance Tech-City (GIFT City), the Securities and Exchange Board of India (SEBI) has granted permission to credit rating agencies (CRAs) and ESG rating providers (ERPs) to operate under the jurisdiction of the International Financial Services Centres... To bolster the financial ecosystem at the International Financial Services Centre (IFSC) in Gujarat International Finance Tech-City (GIFT City), the Securities and Exchange Board of India (SEBI ) has granted permission to credit rating agencies (CRAs) and ESG rating providers (ERPs) to operate under the jurisdiction of the International Financial Services Centres Authority (IFSCA). According to SEBI's latest circular, the inclusion of IFSCA in the list of financial sector regulators will allow SEBI-registered CRAs and ERPs to conduct their rating activities within the IFSC-GIFT City framework. The ESG ratings undertaken by ERPs under IFSCA guidelines will now fall under the purview of IFSCA. This means that any issues arising from the activities of these CRAs and ERPs in the IFSC will be addressed by IFSCA. IFSCA will handle complaints related to services provided by ERPs within the IFSC. This includes enforcement actions and the furnishing of information to third parties, including statutory or judicial bodies. Under Regulation 28E(d) of SEBI (Credit Rating Agencies) Regulations, 1999, and Para 7.1 of the Master Circular for ERPs dated May 16, 2024, ERPs are authorized to undertake ESG rating activities as required by other financial sector regulators. The inclusion of IFSCA as a financial sector regulator under Annexure 4 of the Master Circular for ERPs formally extends this authorization to the IFSC. Click Here To Read/Download Circular Tags SEBI ESG And Credit Rating International Financial Services Centre (IFSC) Next Story"
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Persons-implicated-in-banking-sector-clean-up-cannot-hold-positions-in-banks-SDIs-BoG-1939946",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Persons-implicated-in-banking-sector-clean-up-cannot-hold-positions-in-banks-SDIs-BoG-1939946",
    "title": "Persons implicated in banking sector clean - up cannot hold positions in banks , SDIs – BoG",
    "seendate": "20240711T154500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/246/24668235.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 07 11 → Article 1939946 Business News of Thursday, 11 July 2024 Disclaimer Source: starrfm.com.gh 2024-07-11 Persons implicated in banking sector clean-up cannot hold positions in banks, SDIs – BoG « Prev Next » Comments (4) Listen to Article Share: BoG Governor, Dr. Ernest Addison The Bank of Ghana (BoG) says persons who were directly implicated in the 2017–2019 financial sector clean-up, and all previous directors of failed banks are barred from holding key positions under the fit and proper person criteria. According to the BoG, the move is to entrench the gatekeeping role of the Central Bank in the financial sector. “Poor Corporate Governance contributed significantly to excessive and imprudent risk-taking in the financial sector, which led to the failure of some Regulated Financial Institutions (RFIs) licensed by the Bank of Ghana (BoG), consequently necessitating the 2017-2019 banking sector clean-up. “In order to sustain the gains made from the clean-up, the BOG issued the Corporate Governance Directive in 2018 as well as the Fit and Proper Persons Directive in 2019 to strengthen and embed sound corporate governance practices in RFIs and to entrench the gatekeeping role of the BOG in the financial sector”, a notice signed by BoG’s secretary, Sandra Thompson stated. “The BOG reminds the public that persons who have been directly implicated in the 2017-2019 Financial Sector clean-up, and all previous directors of failed banks and SDIs since the enactment of Banks and Specialized Deposit-Taking Institution Act, 2016 (Act 930) do not qualify to hold key positions under the fit and proper persons criteria,” it continued. The banking sector clean-up exercise took place from mid-2017 to January 2020. It resulted in a reduction in the number of banks from 34 to 23, while 347 microfinance institutions, 15 savings and loans, and eight finance houses had their licenses revoked for various breaches, according to the Central Bank. Comments: This article has 4 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.adomonline.com/persons-implicated-in-financial-sector-cleanup-not-fit-to-hold-positions-bog/",
    "url_mobile": "",
    "title": "Persons implicated in financial sector cleanup not fit to hold positions – BoG",
    "seendate": "20240711T141500Z",
    "socialimage": "https://www.adomonline.com/wp-content/uploads/2023/11/Dr-Ernest-Addison.png",
    "domain": "adomonline.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Persons implicated in financial sector cleanup not fit to hold positions – BoG Source Joy Business Business Banking July 11, 2024 12:20 pm - Share Facebook WhatsApp Twitter Telegram Email Pinterest Print Governor of the Bank of Ghana, Dr. Ernest Addison The Bank of Ghana has indicated that persons who have been directly implicated in the 2017-2019 Financial Sector clean-up, and all previous directors of failed banks and Specialized Deposit Taking institutions since the enactment of Banks and Specialised Deposit Taking Institution Act, 2016 (Act 930) do not qualify to hold key positions under the fit and proper persons criteria. As such, banks and SDIs and the general public are to note the above for their information. In a notice to banks, SDIs and the public, the Central Bank said in order to further promote the safety and soundness of (Regulated Financial Institutions) RFIs, It is by this notice bringing to the attention of RFIs, their obligation under the Banks and Specialised Deposit-Taking Institutions Act, 2016 (Act 930) and the Fit and Proper Persons Directive, 2019 to ensure the continuous fitness and propriety of significant shareholders, and persons, serving as directors and key management personnel of RFIs. The regulator of the financial sector had reminded all and sundry that poor Corporate Governance contributed significantly to excessive and imprudent risk-taking in the financial sector, which led to the failure of some RFIs licensed by the BoG, consequently necessitating the 2017-2019 banking sector clean-up. “In order to sustain the gains made from the clean-up, the BoG issued the Corporate Governance Directive in 2018 as well as the Fit and Proper Persons Directive in 2019 to strengthen and embed sound corporate governance practices in RFIs and to entrench the gatekeeping role of the BoG in the financial sector”, it added. To enhance governance disclosure practices by RFIs, the BoG further issued the Corporate Governance Disclosure Directive in 2022 to convey its regulatory expectations under Pillar III of the Basel Capital Accord, relating to regulatory and public disclosures. The Central Bank recapped that Significant Shareholder, Directors and Key Management Personnel in their oversight and management functions shall at all times be of good repute and possess sufficient knowledge, skills and experience to perform their duties in line with the dictates of the Fit and Proper Persons Directive, 2019. Among others, the Fit and Proper Standards considers whether a person has been a director of, or directly involved in the management of, any company or institution: a. which had its licence revoked; b. or is being or has been wound up by a court of competent jurisdiction or other authority competent to do so within or outside Ghana; c. has gone into receivership, insolvency or involuntary liquidation. ALSO READ: You should have consulted me – Dr. UN tells Chef Smith… Man caught smuggling 100 snakes in his trousers [Video] Facebook WhatsApp Twitter Telegram Email Pinterest Print Previous article I will complete Saglemi housing project if… – Akua Donkor Next article Africa Energy Partners Joins African Energy Week (AEW) 2024 as Partner Amid Surge in African Block Opportunities Tags financial sector cleanup RELATED ARTICLES Business Trade Minister inaugurates GNPA, GITC Boards Business Bond market: Turnover declines 30% to GH¢399m Business Ghana signs bilateral debt agreement with Germany"
  },
  {
    "url": "https://www.myjoyonline.com/persons-implicated-in-financial-sector-cleanup-not-fit-to-hold-positions-bog/",
    "url_mobile": "",
    "title": "Persons implicated in financial sector cleanup not fit to hold positions – BoG",
    "seendate": "20240711T134500Z",
    "socialimage": "https://www.myjoyonline.com/wp-content/uploads/2022/06/Dr.-Ernest-Addison.jpg",
    "domain": "myjoyonline.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Dr Ernest Addison is the Governor of the Bank of Ghana. Audio By Carbonatix The Bank of Ghana has reminded banks, Specialised Deposit-Taking Institutions and the public that persons who have been directly implicated in the 2017-2019 Financial Sector clean-up, and all previous directors of failed banks and Specialized Deposit-Taking institutions since the enactment of Banks and Specialised Deposit-Taking Institutions Act, 2016 (Act 930) do not qualify to hold key positions under the fit and proper person criteria. As such banks' SDIs and the general public are to note the above for their information. In a notice to banks, SDIs and the public, the Central Bank said to further promote the safety and soundness of Regulated Financial Institutions (RFIs), it is this notice bringing to the attention of RFIs, their obligation under the Banks and Specialised Deposit-Taking Institutions Act, 2016 (Act 930) and the Fit and Proper Persons Directive, 2019 to ensure the continuous fitness and propriety of significant shareholders, and persons, serving as directors and key management personnel of RFIs. The regulator of the financial sector had reminded all and sundry that poor Corporate Governance contributed significantly to excessive and imprudent risk-taking in the financial sector, which led to the failure of some RFIs licensed by the BoG, consequently necessitating the 2017-2019 banking sector clean-up. “To sustain the gains made from the clean-up, the BoG issued the Corporate Governance Directive in 2018 as well as the Fit and Proper Persons Directive in 2019 to strengthen and embed sound corporate governance practices in RFIs and to entrench the gatekeeping role of the BoG in the financial sector”, it added. To enhance governance disclosure practices by RFIs, the BoG further issued the Corporate Governance Disclosure Directive in 2022 to convey its regulatory expectations under Pillar III of the Basel Capital Accord, relating to regulatory and public disclosures. The Central Bank recapped that Significant Stakeholders, Directors and Key Management Personnel in their oversight and management functions shall at all times be of good repute and possess sufficient knowledge, skills and experience to perform their duties in line with the dictates of the Fit and Proper Persons Directive, 2019. Among others, the Fit and Proper Standards considers whether a person has been a director of, or directly involved in the management of, any company or institution: a. which had its licence revoked; b. or is being or has been wound up by a court of competent jurisdiction or other authority competent to do so within or outside Ghana; c. has gone into receivership, insolvency or involuntary liquidation DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Tags: BoG Corporate Governance Fit and Proper Test RFIs SDIs DISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited. Related to this story Cedi rally cools off; one dollar going for GH¢11.95 at forex bureaus Leading a central bank has never been for the faint-hearted – Dr. Asiama tells colleagues Economic stability is real but still young – Dr Johnson Asiama BoG, Bank of England host African Central Bank Governors in Accra on banking regulation Access Bank, BoG ladies join forces to empower women, fight breast cancer Inflation to fall to 6.5% in November 2025 – Report Cedi to weaken slightly in quarter 4, but to end 2025 appreciating against dollar – Fitch Solutions Banks perceived risks to moderate over next year – BoG Exporters face 10-year jail term over forex repatriation failures BoG engages over 250 pupils in currency education to mark Cedi@60 celebration Most Popular News Latest Stories Trump asks Supreme Court to overturn E Jean Carroll verdict 46 minutes China needs its youth to spend but they are embracing frugality 57 minutes British prime minister Starmer will fight attempts to replace him, allies say 1 hour EdTech for special needs: Inclusive education for all 5 hours HeFRA shuts down Tamale Technical University Hospital over safety violations 5 hours Abu Jinapor raises serious issues about the Ewoyaa lithium mining lease agreement between the Government of Ghana and Barari DV Ltd 5 hours Increase budget to agriculture sector to at least 10% of GDP – Chamber of Agribusiness to government 5 hours Ghana loses $200m annually to disasters – NADMO 5 hours Bank of Ghana announces new foreign exchange operations framework 5 hours Father and son convicted to a fine for stealing and assault 5 hours Refuse collector jailed 10 years for attempting to rob US diplomat 6 hours BBC must fight to restore trust, Nandy tells MPs 6 hours GTEC directs NaCCA Deputy Director-General to cease using invalid SMC ‘Dr’ title 6 hours COP 30: Climate finance remains Africa’s top priority 6 hours MTN Ghana highlights SME support at 2025 SMEGA Awards 6 hours"
  },
  {
    "url": "https://www.moneycontrol.com/news/opinion/financial-fault-lines-the-villain-is-the-same-but-the-movies-are-different-12765621.html",
    "url_mobile": "https://www.moneycontrol.com/news/opinion/financial-fault-lines-the-villain-is-the-same-but-the-movies-are-different-12765621.html/amp",
    "title": "Financial Fault Lines : The villain is the same , but the movies are different",
    "seendate": "20240710T041500Z",
    "socialimage": "https://images.moneycontrol.com/static-mcnews/2024/07/20240710013217_Stock-Market-New-3.jpg",
    "domain": "moneycontrol.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "In November 11 edition of Moneycontrol Pro Panorama: Amid EC’s second phase of SIR legal challenges intensify, the US is wooing ..."
  },
  {
    "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1205488",
    "url_mobile": "",
    "title": "Pak macroeconomic environment was challenging in 2023 : Central bank",
    "seendate": "20240706T120000Z",
    "socialimage": "",
    "domain": "daijiworld.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Islamabad, Jul 6 (IANS): Pakistan's macroeconomic environment in the calendar year 2023 remained challenging amid rising inflation, weak foreign exchange inflows, pressures on external account and local currency, and low business confidence, particularly in the first half, the State Bank of Pakistan (SBP) said. However, the policy measures and regulatory interventions that were taken to address growing imbalances coupled with securing a nine-month stand-by agreement from the International Monetary Fund (IMF) helped improve the macroeconomic conditions in the second half of 2023, the SBP said in its financial stability review for 2023, Xinhua news agency reported. Inflation started falling, economic growth recovered, and the exchange rate stabilised towards the year-end, the central bank said in the report. Against this backdrop, the financial sector exhibited strong growth and performance, and maintained financial soundness and operational resilience, it added. The asset base of the financial sector expanded by 27 per cent in 2023, mainly driven by the banking sector, according to the report. Follow Daijiworld News Network on Top Stories"
  },
  {
    "url": "https://www.app.com.pk/business/financial-system-shows-steady-performance-soundness-in-2023-sbp-review/",
    "url_mobile": "",
    "title": "Financial system shows steady performance , soundness in 2023 : SBP Review",
    "seendate": "20240705T194500Z",
    "socialimage": "https://www.app.com.pk/wp-content/uploads/2023/09/SBP-e1694504754383.jpg",
    "domain": "app.com.pk",
    "language": "English",
    "sourcecountry": "Pakistan",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Home Business Financial system shows steady performance, soundness in 2023: SBP Review Business Financial system shows steady performance, soundness in 2023: SBP Review 595 - Advertisement - KARACHI, Jul 05 (APP):State Bank of Pakistan (SBP), Friday said that the financial sector exhibited strong growth maintaining its financial soundness and operational resilience due to policy measures, regulatory interventions and assistance by multilateral organizations and consequent economic recovery and declining inflation. The central bank, in its media statement on ‘Financial Stability Review 2023’, mentioned that financial sector grew by 29.5%, its asset base expanded by 27.0%, banking sector’s CAR improved to 19.7% and loan provisioning coverage surged to 92.7% by end December 2023. Assessing the overall risks to financial stability as manageable the SBP stressed on policy continuity and termed structural reforms critical for sustained improvement in country’s macroeconomic fundamentals and the resilience and performance of the financial sector. The Financial Stability Review (FSR) for CY2023, prepared and published as a statuary requirement, presents performance and risk assessment of various segments of the financial sector and also assesses the financial soundness of major user of credit and financial services. During the calendar year 2023, E-banking transactions continued to drive growth while SBP moved to implement the third phase of Raast’s person-to-merchant (P2M) mode to facilitate digital payment acceptance for merchants and businesses. The FSR highlighted healthy performance of non-bank financial sector during CY2023 with strong expansion in asset base of Development Finance Institutions (DFIs) and Non-Bank Financial Institutions (NBFIs) while the insurance sector witnessed growth in assets and gross premium. Despite challenges to macroeconomic environment in the first half of 2023, the policy measures and regulatory interventions taken to address growing imbalances coupled with securing of 9-month Stand-by-Agreement (SBA) from IMF helped in improving the macroeconomic conditions in second half of CY2023, the SFR observed. Inflation started falling, economic growth recovered, and exchange rate stabilized towards the year’s end, the Review stated adding that, in this backdrop, the financial sector exhibited strong growth and performance and maintained its financial soundness and operational resilience. The asset base of the financial sector expanded by 27.0 percent in CY2023, which was mainly driven by the banking sector. “The growth in assets was primarily driven by investments in government securities while private sector advances contracted in the backdrop of stressed macro-financial conditions,” the Review noted adding that expansion of the banks’ balance sheet was mainly funded by deposits, which posted a 20-year high growth in a high return environment. During the period, non-performing loans (NPLs) to loans ratio marginally increased to 7.6 % by end December 2023 from 7.3% in December 2022, and the provisioning coverage further improved to 92.7%, it added. Healthy earnings of the banking sector on the back of high rates and expansion in earning assets supported the solvency position and capital adequacy ratio (CAR) improved to 19.7% by end December 2023 well above the minimum regulatory requirement. The Islamic banking institutions continued to maintain growth momentum in CY2023 and its resilience further improved with strong earnings and comfortable asset quality indicators, the Review states adding, however microfinance banks (MFBs) sector continued to experience stress in CY2023. The Review found overall position of the non-financial corporate sector encouraging as solvency indicators and repayment capacity remained satisfactory. It stated that the large borrowers of banking sector had exhibited stable repayment capacity and there were no significant delinquencies. The FSR also highlighted the operational resilience of Financial Market Infrastructures (FMIs) during CY2023 where E-banking transactions continued to drive growth in retail payments and SBP moved to the third phase of Raast (P2M) mode. The SBP said that overall risks to financial stability appear to be manageable due to anticipated moderation of macroeconomic stress and strong buffers and risk management capabilities of the banking sector. The latest stress test results suggest that the banking sector has adequate resilience to withstand the severe but plausible macro-financial shocks in the medium term, the FSR assessed adding “However, policy continuity on structural reforms remains critical for both sustained improvement in country’s macroeconomic fundamentals and the resilience and performance of the financial sector.” RELATED ARTICLES Business Punjab taking strides in digital transformation: Minister Mujtaba Tue, 11 Nov 2025, 11:32 PM Business Customs foils attempt to smuggle silver via IMO Karachi Tue, 11 Nov 2025, 10:50 PM Business FCCI, NIC-UAF to strengthen collaboration for youth entrepreneurship, skills development Tue, 11 Nov 2025, 9:48 PM Most Popular UN chief slams suicide attack in Islamabad, extends condolences to victims’ families Wed, 12 Nov 2025, 12:05 AM Pakistan beat Sri Lanka by six runs in first ODI Tue, 11 Nov 2025, 11:58 PM UN chief slams suicide attack in Islamabad, extends condolences to victims’ families Tue, 11 Nov 2025, 11:37 PM Punjab taking strides in digital transformation: Minister Mujtaba Tue, 11 Nov 2025, 11:32 PM"
  },
  {
    "url": "https://dailypost.ng/2024/07/05/connectivity-key-to-advancing-financial-sector-ncc-boss-maida/",
    "url_mobile": "",
    "title": "Connectivity key to advancing financial sector NCC boss , Maida",
    "seendate": "20240705T123000Z",
    "socialimage": "https://dailypost.ng/wp-content/uploads/2023/11/Aminu-Maida.jpg",
    "domain": "dailypost.ng",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "The Nigerian Communications Commission, NCC, has said telecoms network connectivity remains the major structure needed to power growth in the financial sector of the economy. The Executive Vice Chairman of NCC, Aminu Maida, stated this while addressing the FINTECH Association of Nigeria, led by its President Mr. Ade Bajomo. The association was on a courtesy visit at the EVC’s office when he made it clear that the pivotal role of connectivity in advancing the financial sector and other economic areas remains sacrosanct. He reassured the FINTECH association of the NCC’s commitment to expanding connectivity to unserved and underserved regions, aiming to eliminate access barriers. Maida emphasised the Commission’s efforts to ensure the industry’s sustainability by addressing challenges that hinder service delivery. Earlier in his speech, the leader of the delegation, Mr Bajomo outlined the group’s ambitious vision to position Nigeria as the fintech hub of Africa and potentially, the world. He emphasised the need for collaboration with the NCC to achieve this goal, highlighting the importance of robust connectivity in driving financial innovation and inclusion. Up Next Alleged Invasion: Court adjourns case against military, CDS, others, awards N50,000 fine Don't Miss Ogun Customs generates N12.8b revenue in six months You may like Nigeria risks being left hehind in global digital race – NCC boss, Maida warns NCC boss, Maida reiterates commission’s commitment to presidential order on telecom infrastructure NCC committed to fostering fair, transparent, consumer-centric telecom landscape – EVC Maida assures Nigerians All stakeholders must work closely together to achieve digital inclusion – NCC boss, Maida NCC vows to improve on its 2024 achievements in 2025 NCC boss, Maida highlights importance of A2P, reveals challenges"
  },
  {
    "url": "http://africa.chinadaily.com.cn/a/202407/05/WS6687469da31095c51c50c780.html",
    "url_mobile": "",
    "title": "Digital revamp boosting financial development",
    "seendate": "20240705T061500Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202407/05/6687469da31095c551b4a11c.jpeg",
    "domain": "africa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Business Macro Companies Industries Technology Motoring China Data Finance Top 10 Home / Business / Finance Home Business Finance Digital revamp boosting financial development By LIU YUKUN | China Daily | Updated: 2024-07-05 09:04 Share Share - WeChat CLOSE A foreign student pays bills using Alipay at a dessert shop in Hangzhou, Zhejiang province, in April. XINHUA Further efforts are expected to drive the digital transformation of the financial sector, in order to ride the global digitalization wave and better support the development of real sectors like manufacturing, officials and business executives said. Future trends in digital finance include increased use of mobile banking, digital employees, AI-driven risk control, edge computing in the internet of things and green finance. This transformation will require multiskilled professionals with both financial knowledge and digital skills to convert socioeconomic needs into financial products, they said. Liu Weiliang, deputy director of the Beijing Municipal Bureau of Economy and Information Technology, said: \"Digital technology is reshaping the financial sector's service patterns, operational models, and industry paradigms. Digital finance can boost the real economy by lowering service costs, reducing information asymmetry and enhancing service efficiency.\" \"While many institutions still rely on branch networks and professional employees for customer acquisition and service, future competitiveness will depend on the scale of financial databases and computing power, rather than asset size, numbers of regional branches or workforce,\" Liu said at the Digital Finance Forum, an event during the ongoing Global Digital Economy Conference. Wu Lianfeng, vice-president at International Data Corporation's China branch, also shared his views on the future characteristics of digital transformation in the financial sector. \"We will see more use of mobile banking, where a smartphone functions as a fully equipped mini-bank, handling over 90 percent of work. Digital employees will manage 90 percent of customer service and financial asset management tasks. Artificial intelligence-driven risk control is crucial, with 90 percent of banks adopting AI for effective risk management.\" \"Edge IoT will revolutionize microfinance, making financial services more inclusive and supporting the real economy. Additionally, green finance will also see substantial growth. By 2025, 25 percent of loans from leading global banks will be linked to sustainability,\" he said. Edge IoT refers to the practice of processing data near the source of data generation, rather than sending it to a centralized cloud or data center, to improve real-time decision-making. Experts also called for further efforts to leverage leading industries, enterprises and megacities to drive the digital transformation in the financial sector. Song Xiaojun, vice-chair of a research institute that is part of China Construction Bank, noted that digital technologies like AI began to be applied in the financial sector over a decade ago. Banks, as a major force within the financial sector, have made significant strides in digital transformation, utilizing digital tools for information management, precise customer need analysis, risk prevention and control, and differentiated interest rates on different industries and clients. \"China has the largest user base globally and significant fintech hardware investments. However, there is a shortage of multiskilled professionals who understand finance, relevant industries and internet technologies, capable of converting socioeconomic needs into financial products,\" Song said. \"China's digital economy is worth 40 trillion yuan ($5.5 trillion), yet the financing amount of data asset mortgage is only 169 million yuan, indicating substantial growth potential and a need for data asset support,\" he added. Talking about the role of megacities in leading digital transformation of the financial sector, Xu Xinchao, deputy secretary-general of the Beijing municipal government, said the city is piloting numerous supportive policies and measures, and building data infrastructure, promoting data aggregation and application in key industries, and ensuring the efficient realization of data asset value. Li Xin, government head of Shijingshan district of Beijing, said the district is advancing a digital renminbi pilot zone. It has also set up an innovation center for data asset circulation and an intelligent computing power center. The district has signed partnership agreements with 10 institutes and businesses to incubate a batch of digital finance projects at the just-concluded Digital Finance Forum. Photo China Post strives to ensure package delivery for 'Double Eleven' online shopping festival Wuzhen's Internet museum reopens with new highlights CIIE Culture Night celebrates fusion of global arts and culture beyond trade 2025 WIC Light of Internet Expo kicks off in Wuzhen Global participation surges at 8th CIIE as exhibits hit record highs CIIE 2025 breaks records as global participation surges Most Viewed in 24 Hours State Council News China’s public holidays for 2026 Policies concerning expats, foreign enterprises in October 2025 Top 10 Top 10 countries attracting Chinese tourists Business focus Silk Road e-commerce Dewu rides wave of Chinese consumption China Data A look at China's economic data from Jan-Sept SOEs Fund for SOEs in place to spur innovation Special fund to support strategic emerging industries launched in Beijing Special Scholar calls for a collaborative and secure AI future in Wuzhen WIC Wuzhen Summit Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US CLOSE"
  },
  {
    "url": "http://english.anhuinews.com/newscenter/b/202407/t20240705_7670381.html",
    "url_mobile": "",
    "title": "Digital revamp boosting financial development",
    "seendate": "20240705T040000Z",
    "socialimage": "",
    "domain": "english.anhuinews.com",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "E-mail lunthesis@163.com Phone 0551-65179860-203 Home Page Photos Hui Culture Travel Guide Audio & Video Sci-tech Service Publications Digital revamp boosting financial development Pub Date: 2024-07-05 09:38 Source: China Daily Further efforts are expected to drive the digital transformation of the financial sector, in order to ride the global digitalization wave and better support the development of real sectors like manufacturing, officials and business executives said. Future trends in digital finance include increased use of mobile banking, digital employees, AI-driven risk control, edge computing in the internet of things and green finance. This transformation will require multiskilled professionals with both financial knowledge and digital skills to convert socioeconomic needs into financial products, they said. Liu Weiliang, deputy director of the Beijing Municipal Bureau of Economy and Information Technology, said: \"Digital technology is reshaping the financial sector's service patterns, operational models, and industry paradigms. Digital finance can boost the real economy by lowering service costs, reducing information asymmetry and enhancing service efficiency.\" \"While many institutions still rely on branch networks and professional employees for customer acquisition and service, future competitiveness will depend on the scale of financial databases and computing power, rather than asset size, numbers of regional branches or workforce,\" Liu said at the Digital Finance Forum, an event during the ongoing Global Digital Economy Conference. Wu Lianfeng, vice-president at International Data Corporation's China branch, also shared his views on the future characteristics of digital transformation in the financial sector. \"We will see more use of mobile banking, where a smartphone functions as a fully equipped mini-bank, handling over 90 percent of work. Digital employees will manage 90 percent of customer service and financial asset management tasks. Artificial intelligence-driven risk control is crucial, with 90 percent of banks adopting AI for effective risk management.\" \"Edge IoT will revolutionize microfinance, making financial services more inclusive and supporting the real economy. Additionally, green finance will also see substantial growth. By 2025, 25 percent of loans from leading global banks will be linked to sustainability,\" he said. Edge IoT refers to the practice of processing data near the source of data generation, rather than sending it to a centralized cloud or data center, to improve real-time decision-making. Experts also called for further efforts to leverage leading industries, enterprises and megacities to drive the digital transformation in the financial sector. Song Xiaojun, vice-chair of a research institute that is part of China Construction Bank, noted that digital technologies like AI began to be applied in the financial sector over a decade ago. Banks, as a major force within the financial sector, have made significant strides in digital transformation, utilizing digital tools for information management, precise customer need analysis, risk prevention and control, and differentiated interest rates on different industries and clients. \"China has the largest user base globally and significant fintech hardware investments. However, there is a shortage of multiskilled professionals who understand finance, relevant industries and internet technologies, capable of converting socioeconomic needs into financial products,\" Song said. \"China's digital economy is worth 40 trillion yuan ($5.5 trillion), yet the financing amount of data asset mortgage is only 169 million yuan, indicating substantial growth potential and a need for data asset support,\" he added. Talking about the role of megacities in leading digital transformation of the financial sector, Xu Xinchao, deputy secretary-general of the Beijing municipal government, said the city is piloting numerous supportive policies and measures, and building data infrastructure, promoting data aggregation and application in key industries, and ensuring the efficient realization of data asset value. Li Xin, government head of Shijingshan district of Beijing, said the district is advancing a digital renminbi pilot zone. It has also set up an innovation center for data asset circulation and an intelligent computing power center. The district has signed partnership agreements with 10 institutes and businesses to incubate a batch of digital finance projects at the just-concluded Digital Finance Forum. Editor:Zheng Chen Related News - More Chinese tourists favor taking trips to Central Asia 2024-07-05 09:38 - Economic Watch: Lower transaction fees set to boost inter... 2024-07-04 10:00 - Chinese car model tops car sales in Israel in H1 2024-07-03 09:35 - PepsiCo retains full confidence in Chinese market 2024-07-01 09:57 photo >> Wuhu, Anhui: 100,000 mu of canola flowers blossoming Guest countries of honor attract visitors at 6th CIIE Video >> Anhui Perfectly Integrates Culture and Technology into Its Development Global Influencers at iFLYTEK 1024 Global Developer Festival: Why Chinese AI Shocks the World？ People >> Hebei rolls out red carpet for talent Transnational couple revives ancient dwelling in east China Travel >> 出发 世界屋脊 八廓街 City Walk Contact Us Copyright ©2000-2021 anhuinews.com All rights reserved. Reproduction in whole or in part without permission is prohibited. 皖B2-20080023-7 Digital revamp boosting financial development 28662 Business38006003000000000 新闻 38031 961 2024-07-05 0"
  },
  {
    "url": "http://usa.chinadaily.com.cn/a/202407/05/WS6687469da31095c51c50c780.html",
    "url_mobile": "",
    "title": "Digital revamp boosting financial development",
    "seendate": "20240705T033000Z",
    "socialimage": "http://img2.chinadaily.com.cn/images/202407/05/6687469da31095c551b4a11c.jpeg",
    "domain": "usa.chinadaily.com.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Search HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER MOBILE Global Edition ASIA 中文 双语 Français HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Business Macro Companies Industries Technology Motoring China Data Finance Top 10 Home / Business / Finance Home Business Finance Digital revamp boosting financial development By LIU YUKUN | China Daily | Updated: 2024-07-05 09:04 Share Share - WeChat CLOSE A foreign student pays bills using Alipay at a dessert shop in Hangzhou, Zhejiang province, in April. XINHUA Further efforts are expected to drive the digital transformation of the financial sector, in order to ride the global digitalization wave and better support the development of real sectors like manufacturing, officials and business executives said. Future trends in digital finance include increased use of mobile banking, digital employees, AI-driven risk control, edge computing in the internet of things and green finance. This transformation will require multiskilled professionals with both financial knowledge and digital skills to convert socioeconomic needs into financial products, they said. Liu Weiliang, deputy director of the Beijing Municipal Bureau of Economy and Information Technology, said: \"Digital technology is reshaping the financial sector's service patterns, operational models, and industry paradigms. Digital finance can boost the real economy by lowering service costs, reducing information asymmetry and enhancing service efficiency.\" \"While many institutions still rely on branch networks and professional employees for customer acquisition and service, future competitiveness will depend on the scale of financial databases and computing power, rather than asset size, numbers of regional branches or workforce,\" Liu said at the Digital Finance Forum, an event during the ongoing Global Digital Economy Conference. Wu Lianfeng, vice-president at International Data Corporation's China branch, also shared his views on the future characteristics of digital transformation in the financial sector. \"We will see more use of mobile banking, where a smartphone functions as a fully equipped mini-bank, handling over 90 percent of work. Digital employees will manage 90 percent of customer service and financial asset management tasks. Artificial intelligence-driven risk control is crucial, with 90 percent of banks adopting AI for effective risk management.\" \"Edge IoT will revolutionize microfinance, making financial services more inclusive and supporting the real economy. Additionally, green finance will also see substantial growth. By 2025, 25 percent of loans from leading global banks will be linked to sustainability,\" he said. Edge IoT refers to the practice of processing data near the source of data generation, rather than sending it to a centralized cloud or data center, to improve real-time decision-making. Experts also called for further efforts to leverage leading industries, enterprises and megacities to drive the digital transformation in the financial sector. Song Xiaojun, vice-chair of a research institute that is part of China Construction Bank, noted that digital technologies like AI began to be applied in the financial sector over a decade ago. Banks, as a major force within the financial sector, have made significant strides in digital transformation, utilizing digital tools for information management, precise customer need analysis, risk prevention and control, and differentiated interest rates on different industries and clients. \"China has the largest user base globally and significant fintech hardware investments. However, there is a shortage of multiskilled professionals who understand finance, relevant industries and internet technologies, capable of converting socioeconomic needs into financial products,\" Song said. \"China's digital economy is worth 40 trillion yuan ($5.5 trillion), yet the financing amount of data asset mortgage is only 169 million yuan, indicating substantial growth potential and a need for data asset support,\" he added. Talking about the role of megacities in leading digital transformation of the financial sector, Xu Xinchao, deputy secretary-general of the Beijing municipal government, said the city is piloting numerous supportive policies and measures, and building data infrastructure, promoting data aggregation and application in key industries, and ensuring the efficient realization of data asset value. Li Xin, government head of Shijingshan district of Beijing, said the district is advancing a digital renminbi pilot zone. It has also set up an innovation center for data asset circulation and an intelligent computing power center. The district has signed partnership agreements with 10 institutes and businesses to incubate a batch of digital finance projects at the just-concluded Digital Finance Forum. Photo China Post strives to ensure package delivery for 'Double Eleven' online shopping festival Wuzhen's Internet museum reopens with new highlights CIIE Culture Night celebrates fusion of global arts and culture beyond trade 2025 WIC Light of Internet Expo kicks off in Wuzhen Global participation surges at 8th CIIE as exhibits hit record highs CIIE 2025 breaks records as global participation surges Most Viewed in 24 Hours State Council News China’s public holidays for 2026 Policies concerning expats, foreign enterprises in October 2025 Top 10 Top 10 countries attracting Chinese tourists Business focus Silk Road e-commerce Dewu rides wave of Chinese consumption China Data A look at China's economic data from Jan-Sept SOEs Fund for SOEs in place to spur innovation Special fund to support strategic emerging industries launched in Beijing Special Scholar calls for a collaborative and secure AI future in Wuzhen WIC Wuzhen Summit Top BACK TO THE TOP English 中文 HOME CHINA WORLD BUSINESS LIFESTYLE CULTURE TRAVEL VIDEO SPORTS OPINION REGIONAL NEWSPAPER China Daily PDF China Daily E-paper MOBILE Copyright 1995 - . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263 Registration Number: 130349 About China Daily Advertise on Site Contact Us Job Offer Expat Employment FOLLOW US CLOSE"
  },
  {
    "url": "http://www.ecns.cn/news/economy/2024-07-05/detail-ihecxmxh6565659.shtml",
    "url_mobile": "",
    "title": "Digital revamp boosting financial development",
    "seendate": "20240705T030000Z",
    "socialimage": "https://image.chinanews.com/batch-admin/2024/07-05/a715f35c-8137-43ba-b012-fcff57e0db6a.JPG",
    "domain": "ecns.cn",
    "language": "English",
    "sourcecountry": "China",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Further efforts are expected to drive the digital transformation of the financial sector, in order to ride the global digitalization wave and better support the development of real sectors like manufacturing, officials and business executives said. Future trends in digital finance include increased use of mobile banking, digital employees, AI-driven risk control, edge computing in the internet of things and green finance. This transformation will require multiskilled professionals with both financial knowledge and digital skills to convert socioeconomic needs into financial products, they said. Liu Weiliang, deputy director of the Beijing Municipal Bureau of Economy and Information Technology, said: \"Digital technology is reshaping the financial sector's service patterns, operational models, and industry paradigms. Digital finance can boost the real economy by lowering service costs, reducing information asymmetry and enhancing service efficiency.\" \"While many institutions still rely on branch networks and professional employees for customer acquisition and service, future competitiveness will depend on the scale of financial databases and computing power, rather than asset size, numbers of regional branches or workforce,\" Liu said at the Digital Finance Forum, an event during the ongoing Global Digital Economy Conference. Wu Lianfeng, vice-president at International Data Corporation's China branch, also shared his views on the future characteristics of digital transformation in the financial sector. \"We will see more use of mobile banking, where a smartphone functions as a fully equipped mini-bank, handling over 90 percent of work. Digital employees will manage 90 percent of customer service and financial asset management tasks. Artificial intelligence-driven risk control is crucial, with 90 percent of banks adopting AI for effective risk management.\" \"Edge IoT will revolutionize microfinance, making financial services more inclusive and supporting the real economy. Additionally, green finance will also see substantial growth. By 2025, 25 percent of loans from leading global banks will be linked to sustainability,\" he said. Edge IoT refers to the practice of processing data near the source of data generation, rather than sending it to a centralized cloud or data center, to improve real-time decision-making. Experts also called for further efforts to leverage leading industries, enterprises and megacities to drive the digital transformation in the financial sector. Song Xiaojun, vice-chair of a research institute that is part of China Construction Bank, noted that digital technologies like AI began to be applied in the financial sector over a decade ago. Banks, as a major force within the financial sector, have made significant strides in digital transformation, utilizing digital tools for information management, precise customer need analysis, risk prevention and control, and differentiated interest rates on different industries and clients. \"China has the largest user base globally and significant fintech hardware investments. However, there is a shortage of multiskilled professionals who understand finance, relevant industries and internet technologies, capable of converting socioeconomic needs into financial products,\" Song said. \"China's digital economy is worth 40 trillion yuan ($5.5 trillion), yet the financing amount of data asset mortgage is only 169 million yuan, indicating substantial growth potential and a need for data asset support,\" he added. Talking about the role of megacities in leading digital transformation of the financial sector, Xu Xinchao, deputy secretary-general of the Beijing municipal government, said the city is piloting numerous supportive policies and measures, and building data infrastructure, promoting data aggregation and application in key industries, and ensuring the efficient realization of data asset value. Li Xin, government head of Shijingshan district of Beijing, said the district is advancing a digital renminbi pilot zone. It has also set up an innovation center for data asset circulation and an intelligent computing power center. The district has signed partnership agreements with 10 institutes and businesses to incubate a batch of digital finance projects at the just-concluded Digital Finance Forum."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Economic-rebound-will-spur-financial-sector-growth-ADB-MD-1938759",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Economic-rebound-will-spur-financial-sector-growth-ADB-MD-1938759",
    "title": "Economic rebound will spur financial sector growth",
    "seendate": "20240704T184500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/288/28899656.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 07 04 → Article 1938759 Business News of Thursday, 4 July 2024 Source: www.ghanaweb.com 2024-07-04 Economic rebound will spur financial sector growth - ADB MD « Prev Next » Comments (0) Listen to Article Share: Managing Director of the Agricultural Development Bank (ADB), Alhaji Alhassan Yakubu-Tali The Managing Director of the Agricultural Development Bank (ADB) PLC, Alhaji Alhassan Yakubu-Tali, has expressed confidence that the ongoing economic rebound will spur and sustain growth within the financial sector. This optimism follows the International Monetary Fund 's (IMF) approval of the second review under its US$3 billion Extended Credit Facility (ECF) arrangement and the implementation of key structural reforms by the Bank of Ghana , the Ministry of Finance, and other stakeholders. Alhaji Yakubu-Tali highlighted that these developments are expected to result in a decline in inflation, creating a ripple effect throughout the financial sector and the broader economy. He anticipates that this will lead to lower loan interest rates, higher Treasury bill (T-Bill) rates, stabilization of the cedi against the dollar, and improved gross international reserves. The ADB Managing Director commended the efforts of the Bank of Ghana (BoG) on the ongoing fiscal consolidation, tightening monetary policy, and achieving relative stability in the exchange rate and declining inflation. \"I am optimistic that the economic rebound will restore confidence in the financial sector, as customers will be able to access more loans at lower interest rates,\" Alhaji Yakubu-Tali emphasized. “This renewed confidence is expected to drive increased borrowing and lending activities, further fueling economic growth and stability,” he added. Alhaji Yakubu-Tali also referred to the Bank of Ghana address titled “Maintaining structural reform momentum…”, which indicates positive signs of recovery in the first quarter of 2024, with overall Real GDP growth for Q1 2024 at 4.7 percent, the highest since Q1 2022, compared to 3.1 percent growth recorded in the same period of 2023. GSS data also shows that industry grew the most at 6.8 percent, followed by Agriculture at 4.1 percent and Services at 3.3 percent. These, he said, reveal signs of a resilient economy. He pointed out that implementing key structural reforms is crucial in bolstering the overall economic recovery effort of the country. \"The ongoing structural reforms will not only stabilize the macroeconomic environment but also provide a solid foundation for sustainable growth and development in the financial sector,\" Alhaji Yakubu-Tali said. The ADB MD expressed confidence that the financial sector will benefit immensely from these positive economic indicators. He believes that with the right policies and continuous efforts towards maintaining fiscal discipline and monetary stability, the financial sector will experience robust growth, leading to a stronger and more resilient economy. Alhaji Yakubu-Tali reiterated ADB's commitment to supporting the economic recovery process by providing accessible and affordable financial services to its customers and the general public. \"ADB remains dedicated to playing a pivotal role in fostering economic growth and financial inclusion across Ghana,\" he stated. The Agricultural Development Bank PLC is at the final phase of its additional capital injection process. The Bank has also opened its 89th network location in Ejisu, next to the Ejisu Divisional Police Office in the Ashanti. The old ADB branch (now Ejisu Market Agency) will also continue to operate after its renovation, to complement the new branch. Comments: This article has no comments yet, be the first to comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Prosecute-shareholders-implicated-in-banking-sector-clean-up-Dr-Addison-tells-government-1938323",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Prosecute-shareholders-implicated-in-banking-sector-clean-up-Dr-Addison-tells-government-1938323",
    "title": "Prosecute shareholders implicated in banking sector clean - up – Dr . Addison tells government",
    "seendate": "20240702T141500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/465/46520149.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 07 02 → Article 1938323 Business News of Tuesday, 2 July 2024 Source: www.ghanaweb.com 2024-07-02 Prosecute shareholders implicated in banking sector clean-up – Dr. Addison tells government « Prev Next » Comments (13) Listen to Article Share: Dr. Ernest Addison, Bank of Ghana Governor The Governor of the Bank of Ghana , Dr. Ernest Addison , has urged the government to prosecute shareholders of banks and financial institutions implicated in the financial sector clean-up that took place in 2017. Dr. Addison argues that there is a need for accountability in light of the rationale for the clean-up exercise. Therefore, individuals responsible for the insolvency of banks and financial institutions must face legal consequences. Speaking during a joint IMF/ Bank of Ghana /Finance Ministry press briefing on July 1, 2024, the BoG Governor expressed concern about the slow pace of the government in bringing the perpetrators to justice. “It is taking a really long time to really bring all of these matters to a close. However, it is important that the state needs to persevere and pursue these shareholders who have misappropriated depositors’ funds,\" the BoG Governor said. “The large amounts of monies that we claim were used to clean up the financial sector, some of these monies are being held in assets by the shareholders and I think that the law needs to be allowed to do its work,” he added. As part of efforts to strengthen the banking sector, the Bank of Ghana conducted a clean-up exercise in 2017 to ensure stability in the financial sector and bolster the position of banks in the country as part of its mandate. The exercise, which took place from mid-2017 to January 2020, resulted in a reduction in the number of banks from 34 to 23. Additionally, 347 microfinance institutions, 15 savings and loans, and eight finance houses had their licenses revoked for various breaches, according to the Central Bank. MA Watch the latest edition of BizTech below: Ghana’s leading digital news platform, GhanaWeb, in conjunction with the Korle-Bu Teaching Hospital, is embarking on an aggressive campaign which is geared towards ensuring that parliament passes comprehensive legislation to guide organ harvesting, organ donation, and organ transplantation in the country. Click here to follow the GhanaWeb Business WhatsApp channel Related Articles: Non-interest banking to preserve secular identity and market neutrality - Professor Gatsi GIABA flags trade-based money laundering as rising threat BoG cracks down on unlicensed digital lenders Sam George disowns GH¢6.7 million Smart Infraco payment BoG Governor touts stability, aims for productivity-led growth Read all related articles Comments: This article has 13 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  }
]