[
  {
    "url": "https://telecom.economictimes.indiatimes.com/news/internet/cert-in-finds-multiple-bugs-in-microsoft-edge-advises-users-to-update/111237627",
    "url_mobile": "https://telecom.economictimes.indiatimes.com/amp/news/internet/cert-in-finds-multiple-bugs-in-microsoft-edge-advises-users-to-update/111237627",
    "title": "CERT - In finds multiple bugs in Microsoft Edge , advises users to update , ET Telecom",
    "seendate": "20240624T164500Z",
    "socialimage": "https://etimg.etb2bimg.com/thumb/msid-111237627,imgsize-116212,width-1200,height=765,overlay-ettelecom/internet/cert-in-finds-multiple-bugs-in-microsoft-edge-advises-users-to-update.jpg",
    "domain": "telecom.economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Internet 1 min read CERT-In finds multiple bugs in Microsoft Edge, advises users to update \"Multiple vulnerabilities have been reported in Microsoft Edge (Chromium-based) which could allow an attacker to compromise the targeted system,\" said the CERT-In advisory. IANS Updated On Jun 24, 2024 at 09:26 PM IST Copy Link Share on WhatsApp Share on Linkedin Share on X Share on Telegram Share on Facebook New Delhi: The Indian Computer Emergency Response Team ( CERT-In ), which comes under the Ministry of Electronics & Information Technology, on Monday, warned users of multiple vulnerabilities in Microsoft Edge (Chromium-based) which could allow an attacker to compromise the targeted system. The affected software includes Microsoft Edge Stable versions prior to 126.0.2592.68. \"Multiple vulnerabilities have been reported in Microsoft Edge (Chromium-based) which could allow an attacker to compromise the targeted system,\" said the CERT-In advisory. According to the cyber agency, these vulnerabilities exist in Microsoft Edge (Chromium-based) due to \"type confusion in V8, inappropriate implementation in WebAssembly, out of bounds memory access in dawn and use after free in dawn\". Advt An attacker could exploit these vulnerabilities by persuading a victim to visit a specially crafted webpage, the agency mentioned. CERT-In advised users to apply appropriate security updates as mentioned by the company. Meanwhile, CERT-In has joined hands with financial giant Mastercard to promote cooperation and information sharing in the area of cybersecurity related to the financial sector. The two entities will leverage their shared expertise regarding the financial sector in the fields of cybersecurity incident response, capacity building, sharing cyber threat intelligence specific to the financial sector and advanced malware analysis. IANS Published On Jun 24, 2024 at 09:24 PM IST See more on: Microsoft Edge , Cert-In , Microsoft , Microsoft Edge bugs , technology news Telegram Facebook Copy Link Comments What are your thoughts? Comment Now Read Comment (1) All Comments By commenting, you agree to the Prohibited Content Policy Post By commenting, you agree to the Prohibited Content Policy Post Find this Comment Offensive? Choose your reason below and click on the submit button. This will alert our moderators to take actions REASONS FOR REPORTING Foul Language Defamatory Inciting hatred against a certain community Out of Context / Spam Others Report Join the community of 2M+ industry professionals. Subscribe to Newsletter to get latest insights & analysis in your inbox. All about ETTelecom industry right on your smartphone! Download the ETTelecom App and get the Realtime updates and Save your favourite articles."
  },
  {
    "url": "https://bdnews24.com/economy/faf6187ec43d",
    "url_mobile": "",
    "title": "$900m WB financing to increase resilience",
    "seendate": "20240622T181500Z",
    "socialimage": "https://cdn.bdnews24.com/bdnews24/media/english/imgAll/2024June/PLATE/world-bank-reuters-220624-1719065504.jpg",
    "domain": "bdnews24.com",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Economy World Bank approves $900m financing for Bangladesh resilience The funding aims to bolster Bangladesh's economic resilience and enhance urban infrastructure to foster sustainable growth amid climate challenges News Desk bdnews24.com Published : 22 Jun 2024, 10:15 PM Updated : 22 Jun 2024, 10:15 PM The World Bank has approved financing for two projects totaling $900 million to bolster Bangladesh's economic resilience and enhance urban infrastructure to foster sustainable growth amid climate challenges. The first project – Second Recovery and Resilience Development Policy – with a credit worth $500 million, focuses on advancing fiscal and financial sector reforms crucial for sustained growth and resilience against future shocks, including climate change, the World Bank said in a statement. This initiative supports the transition from trade to consumption and income taxes, enhances banking sector oversight, and improves management of National Savings Certificates. Additionally, it aims to streamline public procurement through the e-GP system, reducing procurement lead times and strengthening social protection programmes. Citing Bernard Haven, World Bank senior economist, the statement said: “A well-functioning financial sector is critical for Bangladesh to increase investment and improve access to finance for those left out of formal banking systems.” The second project – Resilient Urban and Territorial Development Project – allocates $400 million to enhance climate-resilient urban infrastructure and management capacities in seven city clusters along Bangladesh's economic corridor. Spanning over 950 kilometers from Cox’s Bazar to Panchagarh, this initiative addresses urbanisation challenges exacerbated by rapid population growth and industrial expansion in Dhaka. Kwabena Amankwah-Ayeh, World Bank senior urban development specialist, said in the statement: \"This project marks the beginning of a series focused on climate resilience and economic opportunities in secondary cities, crucial for Bangladesh's sustainable development.\" The two projects aim to create jobs, improve rural-urban linkages, strengthen food supply chains, and enhance connectivity and economic opportunities in targeted areas. They also prioritise gender-responsive infrastructure and green building features to support sustainable urban development. “Decisive reforms will help Bangladesh sustain growth and strengthen resilience to climate change and other shocks,” said Abdoulaye Seck, World Bank country director for Bangladesh and Bhutan. “These new financing operations will help Bangladesh in two critical areas – the financial sector and urban management — to achieve its vision of upper middle-income status.” Follow bdnews24.com on Google News Related Stories Gold, stocks upbeat as US shutdown deal clears Senate Read More US House returns to Washington for vote to end shutdown Devotion lights up Rakher Upobash London councillors’ Bangladesh run leaves UK minister ‘appalled’ CMP chief orders ‘burst fire’ on armed criminals Read More Opinion Julian Francis Remembering the great Bhola cyclone Anatul Fateh The Defection Biswadip Das 19 and counting: The price of independence in Bangladesh’s media Syed Badrul Ahsan The media are keepers of public conscience Read More"
  },
  {
    "url": "https://menafn.com/1108359907/Bangladesh-To-Receive-900-Mn-World-Bank-Financing-For-Sustainable-Growth",
    "url_mobile": "",
    "title": "Bangladesh To Receive $900 Mn World Bank Financing For Sustainable Growth",
    "seendate": "20240622T121500Z",
    "socialimage": "https://menafn.com/updates/pr/2024-06/22/I_f39c0image_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "http://www.uniindia.com/bangladesh-to-receive-900-mln-usd-world-bank-financing/world/news/3225407.html",
    "url_mobile": "",
    "title": "Bangladesh to receive 900 mln USD World Bank financing",
    "seendate": "20240622T103000Z",
    "socialimage": "",
    "domain": "uniindia.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "World Posted at: Jun 22 2024 2:32PM Bangladesh to receive 900 mln USD World Bank financing Dhaka, June 22 (UNI) The World Bank's Board of Executive Directors has approved two projects totaling 900 million U.S. dollars to help Bangladesh strengthen fiscal and financial sector policies and improve urban infrastructure and management to ensure sustainable and climate-resilient growth. \"Decisive reforms will help Bangladesh sustain growth and strengthen resilience to climate change and other shocks,\" Abdoulaye Seck, World Bank country director for Bangladesh and Bhutan, was quoted as saying in a statement received here on Saturday. \"These new financing operations will help Bangladesh in two critical areas -- the financial sector and urban management -- to achieve its vision of upper middle-income status,\" he added. Please log in to get detailed story. Tags: #Bangladesh to receive 900 mln USD World Bank financing"
  },
  {
    "url": "https://finance.yahoo.com/news/half-uk-consumers-already-using-224511430.html",
    "url_mobile": "",
    "title": "Half of united kingdom consumers are already using Open Banking without realising it",
    "seendate": "20240621T001500Z",
    "socialimage": "https://media.zenfs.com/en/retail_banker_international_407/092c753acb11f29589afceb41cfc1f0c",
    "domain": "finance.yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Half of UK consumers are already using Open Banking without realising it Robert Prendergast June 20, 2024 2 min read There is strong market potential for merchants who prioritise the adoption of Open Banking payments early in their payment strategies. That is according to research released by emerchantpay. The survey of UK consumers found that one in two people are unknowingly using Open Banking during checkout, 51% of the UK population being unfamiliar with the term Open Banking. Once consumers were informed about what Open Banking is, 45% of respondents that had not heard of the term claimed they had in fact used Open Banking for purchases. This suggests that the term is not widely recognised, but Open Banking payments are actively being used by consumers. Of those who had heard of it, usage increased significantly to 58%, indicating that, once understood, consumers are eager to use Open Banking solutions. The outlook for Open Banking is also positive, 19% of respondents saying that they will use Open Banking more frequently in 5 years’ time. This compares to 14% saying the same for Buy Now Pay Later (BNPL) and 7% for crypto. Merchants in many sectors can leverage the opportunities of Open Banking, with 44% of respondents saying they would use it for online retail, 36% for utility bills, 34% for hotels, 30% for airline tickets, and 25% for online subscriptions. \"It's evident that there's a lack of awareness of Open Banking as a term\" Younger consumers demonstrated more awareness of Open Banking, with 25–34-year-olds most likely to have heard of it at 45%. There is also an anticipated 32% surge in the use of Open Banking payments among 25–34-year-olds over the next five years. Jon Horddal, Chief Product Officer at emerchantpay said: “The opportunities Open Banking offers to merchants are boundless, with it providing many features that consumers are currently seeking and demanding at the checkout. However, it's evident that there's a lack of awareness of Open Banking as a term. “To create a win-win situation for consumers and merchants, there needs to be more education as to what it means and what its benefits are, from both the merchants themselves, but also from banks. Many of the key features consumers want are available via Open Banking, but merchants need to be better equipped to demonstrate these benefits to consumers. “To reap the rewards that Open banking has to offer, merchants need to start including Open Banking payments at the checkout, alongside an explanation, to see the sort of consumer adoption we’ve experienced in the past with new payment methods, such as BNPL and eWallets.” \"Half of UK consumers are already using Open Banking without realising it\" was originally created and published by Retail Banker International , a GlobalData owned brand. Story continues The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site. View comments Terms and Privacy Policy Privacy Dashboard More Info"
  },
  {
    "url": "https://www.siliconindia.com/news/general/mastercard-and-certin-partner-to-boost-financial-sectors-cybersecurity-nid-230288-cid-1.html",
    "url_mobile": "",
    "title": "Mastercard and CERT - In Partner to Boost Financial Sector Cybersecurity",
    "seendate": "20240620T050000Z",
    "socialimage": "https://www.siliconindia.com/news/newsimages/CW40SrLK.jpg",
    "domain": "siliconindia.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Magazine : Technology Industry Healthcare Services Enterprise Services Finance Human Resource Marketing Education Consultant Startup Realestate Special Middle East Lifestyle Travel News Mastercard and CERT-In Partner to Boost Financial Sector's Cybersecurity By siliconindia | Thursday, 20 June 2024, 08:51:42 AM IST The Indian Computer Emergency Response Team (CERT-In) has partnered with Mastercard to enhance collaboration and information sharing in cybersecurity within the financial sector. They have signed a Memorandum of Understanding (MoU) to utilize their combined expertise in areas such as cybersecurity incident response, capacity building, sharing cyber threat intelligence specific to the financial sector , and advanced malware analysis. For those who may not know, CERT-In is India's central cybersecurity agency under the Ministry of Electronics and Information Technology. It has been appointed as the national agency for incident response in accordance with Section 70B of the Information Technology Act, 2000. Under the MoU, Mastercard and CERT-In will conduct training programs and workshops focused on cyber capacity building, current market trends, and best practices to improve the cybersecurity of financial sector organizations. They will also exchange relevant cyber threat trends, technical information, threat intelligence, and vulnerability reports to bolster the information security of India's financial sector. “Cybersecurity is the need of the hour and Prime Minister Shri Narendra Modi government is committed to ensuring that people on digital platforms are secure, as this warfare is not on the ground but in cyberspace. I am confident that this is an important milestone that will benefit not only both entities but also the public at large”, said Jitin Prasada, Minister of State in the Ministry of Commerce & lndustry; and Electronics and Information Technology. “Mastercard’s comprehensive approach to security gives its partners and customers deeper visibility into cyber risk and greater adaptability and resilience, protecting their systems through the latest AI technology. The company is delighted to collaborate with CERT-In to fortify India’s financial digital ecosystem , which has powered unprecedented growth in the country”, said Gautam Aggarwal, Division President, South Asia at Mastercard. Read More News : Indian Oil Forms Biofuel Joint Venture with GPS Renewables Green electron' and AI Data Centres to Herald New Infra Push: Gautam Adani ON THE DECK November Special – 2025 Enhancing Health & Vitality Through Advanced... Havish M Consulting : Transforming Data... ❮ ❯ Related Articles Chhattisgarh-Gujarat Pact Seals Rs 33,321 Crore Deals, Creates 14,900 Jobs Unleashing the Boundless Horizons of Knowledge on National Education Day 2025 Sensex and Nifty Climb as Key Stocks Lead the Rally OLX India Appoints Apoorv Pandey as Chief Marketing Officer to Drive Brand Growth SBI, PNB Prepare Joint Playbook To Capture Rs 1.2 Lakh-Crore M&A"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/mastercard-and-cert-in-join-hands-to-strengthen-cybersecurity-for-financial-sector/articleshow/111121150.cms",
    "url_mobile": "https://timesofindia.indiatimes.com/technology/tech-news/mastercard-and-cert-in-join-hands-to-strengthen-cybersecurity-for-financial-sector/amp_articleshow/111121150.cms",
    "title": "Mastercard and CERT - In join hands to strengthen cybersecurity for financial sector",
    "seendate": "20240619T201500Z",
    "socialimage": "https://static.toiimg.com/thumb/msid-111121145,width-1070,height-580,imgsize-146730,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "domain": "timesofindia.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Edition IN IN US Sign In TOI Today's ePaper News Technology News Tech News Mastercard and CERT-In join hands to strengthen cybersecurity for financial sector Trending NYT Connections Hints Garena Free Fire Max Codes Mini Crossword Clues NYT Strands Wordle Today Clues ChatGPT CEO Samsung Galaxy S Series Update Prices Deepseek Housing 3d AR and VR Sony New Games fo PS Plus NYT Connections Hints Garena Free Fire Max Codes Mini Crossword Clues NYT Strands Wordle Today Clues ChatGPT CEO Samsung Galaxy S Series Update Prices Deepseek Housing 3d AR and VR Sony New Games fo PS Plus NYT Connections Hints Garena Free Fire Max Codes Mini Crossword Clues NYT Strands Wordle Today Clues ChatGPT CEO Samsung Galaxy S Series Update Prices Deepseek Housing 3d AR and VR Sony New Games fo PS Plus This story is from June 20, 2024 Mastercard and CERT-In join hands to strengthen cybersecurity for financial sector TOI Tech Desk / TIMESOFINDIA.COM / Jun 20, 2024, 00:55 IST Share AA + Text Size Small Medium Large CERT-In and Mastercard have signed an MoU to enhance cybersecurity in the financial sector through cooperation and information sharing. REUTERS/Thomas White/Illustration/File Photo Indian Computer Emergency Response Team CERT-In has joined hands with Mastercard to promote cooperation and information sharing in the area of Cyber security related to the financial sector. The two have signed a Memorandum of Understanding ( MoU ) under which they will leverage their shared expertise with regards to financial sector in the fields of cybersecurity incident response, capacity building, sharing cyber threat intelligence specific to financial sector and advanced malware analysis. For those unaware, CERT-In is the country's nodal cyber security agency under the Ministry of Electronics and Information Technology. CERT-In has been designated to serve as National agency for incident response under Section 70B of the Information Technology Act, 2000. As part of MoU signed, Mastercard and CERT-In will hold training programs and workshops for cyber capacity building, latest market trends and best practices to enhance cyber security of financial sector organizations. The two entities will also share relevant cyber threat trends, technical information, threat intelligence, and vulnerability reports to strengthen the financial sector information security of India. “Cybersecurity is the need of the hour and Prime Minister Shri Narendra Modi government is committed to ensuring that people on digital platforms are secure, as this warfare is not on the ground but in cyberspace. I am confident that this is an important milestone that will benefit not only both entities but also the public at large,” said Jitin Prasada , Minister of State in the Ministry of Commerce & lndustry; and Electronics and Information Technology. “Mastercard’s comprehensive approach to security gives its partners and customers deeper visibility into cyber risk and greater adaptability and resilience, protecting their systems through the latest AI technology. The company is delighted to collaborate with CERT-In to fortify India’s financial digital ecosystem, which has powered unprecedented growth in the country,” said Gautam Aggarwal, Division President, South Asia at Mastercard. GN Awards 2024: Vote for your favorite Gadgets About the Author TOI Tech Desk The TOI Tech Desk is a dedicated team of journalists committed to delivering the latest and most relevant news from the world of technology to readers of The Times of India. TOI Tech Desk’s news coverage spans a wide spectrum across gadget launches, gadget reviews, trends, in-depth analysis, exclusive reports and breaking stories that impact technology and the digital universe. Be it how-tos or the latest happenings in AI, cybersecurity, personal gadgets, platforms like WhatsApp, Instagram, Facebook and more; TOI Tech Desk brings the news with accuracy and authenticity. Read More End of Article Latest Mobiles View All Previous Itel Zeno 10 ₹5,999 View Specs Itel A80 ₹6,999 View Specs Poco X7 5G ₹21,999 View Specs Poco X8 5G ₹29,990 View Specs Infinix Smart 9 HD ₹6,699 View Specs Motorola Moto G05 ₹6,999 View Specs Vivo Y29 5G ₹13,999 View Specs Poco X7 Pro 5G ₹27,999 View Specs Realme 14 Pro 5G ₹24,999 View Specs Realme 14 Pro Plus 5G ₹29,999 View Specs Next 1 2 3 4 5 6 FOLLOW US ON SOCIAL MEDIA Photostories National parks in India that are perfect to visit with friends ​5 yoga asanas that can stimulate hair growth​ 5 common desi foods that can silently increase sugar levels Charu Asopa on being a single mother to Ziana and handling things on her own: Sometimes I feel lonely and directionless From Ankita Lokande not charging fees for Manikarnika to Vicky Jain revealing the number of cars he owns; Elvish Yadav asks candid questions to the Laughter Chefs 2's duo From selling vegetables and doing odd jobs to getting slapped in a running show; Laughter Chefs 2's Sudesh Lehri gets candid about his struggling days 5 fruits that can help in hair growth 7 habits to help create long-lasting love and relationships From reports of Mahira Sharma and cricketer Mohammed Siraj dating to Archana Puram Singh getting brutally injured: Top TV news 5 everyday morning habits to detox kidney and liver 10 alternatives to butter that are healthy and do not increase cholesterol 5 reasons relationships fall apart even with deep love, as per psychology 1 2 3 Hot Picks Joginder Gyong Market Crash Today Parliament Session Delhi Elections Nirmala Sitharaman Income Tax Calculator Today stock recommendations TOP TRENDING Dak Prescott Fiance Budget News Taylor Swift Luka Doncic Father Nirmala Sitharaman Terror Kingpin Joginder Gyong Delhi Election 2025 USAID Shut down DeepSeek AI Virat Kohli IPL Career Tired of too many ads? go ad free now Trending Stories In Section Entire Website Gol roti banana bhi ek art hai: This app to tell you how good/bad you are Apple Watch Series 10 available for Rs 22,380 on Amazon; check exchange deal and bank offer Keep your heads down and …: Microsoft CFO Amy Hood to employees in internal memo UK's former PM Rishi Sunak watches India-England match in Mumbai with Infosys founder Narayana Murthy: Pleasure to ... Bollywood composer reveals using Chinese AI tool DeepSeek for music in Salman Khan’s Sikander and Supriya’s Retro Amazon's 'leaked memo' to AWS sales managers: Demote managers and … Samsung Chief Jay Y. Lee cleared of charges in 2015 merger case by Seoul court Elon Musk to Dell founder Michael Dell: Yay! Thanks for your support, Michael. This will ... Pakistani TikToker Imsha Rehman after alleged obscene video leak: I am getting a lot of death threats Swara Bhasker gives 'More Drama' update about her Twitter account 'Falsehood, lies': Jaishankar slams Rahul's 'Trump invitation' remarks against PM Modi 'Halwa kisko khilaya?': Rahul on govt not releasing budget ceremony photo Will tax sops for middle class tip Delhi polls in favour of BJP? 'Water most contaminated in Maha Kumbh right now': Jaya Bachchan 'China inside Indian territory because...': Rahul's big claim in Lok Sabha Bihar horror: Woman strangles stepdaughter, burns body, hides it in gunny bag India will soon have the world’s 2nd largest metro network Elon Musk to Dell founder: 'Yay! Thanks for your support, Michael. This will ...' 'Jaishankar went to US to get Trump invitation for PM', claims Rahul As PCB scrambles to get ready for Champions Trophy, ICC makes exception Tired of too many ads? go ad free now Explore Every Corner Across The Globe CBSE Admit Card 2025 Elon Musk Rebecca Lobach Pete Alonso Donald Trump Dak Prescott DC Plane Crash DTE Karnataka Diploma Result Tom Brady Scott Boras Phyllis Fong NBA Trade Rumor Parliament Budget Session Budget Tax Rules for NRI Kerala KMAT 2025 Registration Delhi Election Fox Reporter Erin Andrew Royal Rumble 2025 Winners List New Tax Regime vs Old Tax Regime ISRO Satellite Mumbai Rape Microsoft Layoff Stock Market Today Matthew Stafford Wife Kerala Women Suicide I Meaning in Apple Products Michael Jordan Son Andy Jassy ICC Champions Trophy 2025 Schedule Bank Holidays 2025 About us Create Your Own Ad Terms of Use and Grievance Redressal Policy Privacy policy Advertise with us RSS Newsletter Feedback ePaper Sitemap Archives FOLLOW US ON Other Times Group News Sites The Economic Times Hindi Economic Times Navbharat Times Maharashtra Times Vijaya Karnataka Telugu Samayam Tamil Samayam Malayalam Samayam I am Gujarat TimesPoints Indiatimes Brand Capital Education Times Times Food Mumbai Mirror Bangalore Mirror IndiaTimes Bangla Hindi Podcast Popular Categories Headlines Sports News Business News India News World News Bollywood News Health+ Tips Indian TV Shows Celebrity Photos Technology News Hot on the Web Sky Force Box Office Collection Ashneer Grover Govind Namdev Pushpa 2 Box Office Collection Grammy AwardsWinner List Mamta Kulkarni Karoline Leavitts Walking Benefits Pumpkin Seeds Prince Harry Top Trends CBSE Admit Card D Gukesh Jasprit Bumrah Payton Manning Champions Trophy India Match Tickets Blackhawk Pilot United Airlines Plane Fire Dak Prescott Fiance Budget 2025 NRI Tax Rules Mitchell Marsh Elon Musk Budget NRI Tax Rules Matthew Stafford Jos Buttler WWE PPV 2025 Schedule Karnataka Sexual Assault Income Tax Slabs 2025-26 Live Cricket Score Trending Topics Grammy Awards 2025 Live Update Emergency Box Office Collection Salman Khan Keerthy Suresh Beetroot Chickpea Kebabs Valentines Day Week List Deva Box Office Collection Basan Panchami Wishes Union Budget 2025 Udit Narayan Kruger National Park February 2025 Health Predictions February 2025 Wealth Predictions February 2025 Career Predictions February 2025 Love Predictions Ibrahim Ali Khan Rohan Khaunte Gujarat School Rape Rajasthan High Court Harpreet Kaur Babla Living and entertainment ETimes Travel Destinations Cricbuzz.com TV Lifestyle Newspaper Subscription Food News Times Prime Whats Hot Services CouponDunia TechGig TimesJobs Bollywood News Times Mobile Gadgets Work with Us Colombia Latest News Toxic': Will Yash and leading ladies Nayanthara, Kiara Advani, Huma Qureshi, and Tara Sutaria starrer film hit screen in Late 2025? UK's biggest water company seeks court approval for emergency funding to prevent nationalization Gol roti banana bhi ek art hai: This app to tell you how good/bad you are India's Rs 20,000 Crore R&D Boost: Industry Calls for More to Lead Global Innovation No aid in USAID? What is the full form of USAID? What does USAID stand for? Woman, two sons drown in sump in Namakkal Watch: Airplane engine catches fire; this is what happened next! CEO Karishma Mehta freezes her eggs at 32: Here’s all about the procedure that many young women are following these days Why upskilling in cybersecurity is crucial for future-proofing your career Actress Ramya Balakrishna joins the cast of TV show Anna From Basant Panchami to Maha Shivratri: 4 Experts Decode What These Sacred Days Mean for MahaKumbh 2025 Parveen Kumar stars as Falcon Risers Hyderabad crush Srinagar by 9 wickets in ISPL Season 2 Union Budget 2025-26: 200 new Vande Bharat trains and more 'Pressure on seniors like Virat and Rohit after young brigade's top show' Joe Burrow’s changed behaviour at the NFL Pro Bowl Games shocks fans amid dating rumours with Olivia Ponton 7 quick and easy meals that can be made with leftover rice for lunch Government says 13 people arrested for hoax bomb threats to airlines in 2024 As PCB scrambles to get ready for Champions Trophy, ICC makes exception Copyright © 2025 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service Do Not Sell or Share My Personal Information"
  },
  {
    "url": "https://www.uneca.org/stories/despite-challenges,-southern-africa-has-improved-financial-inclusion-with-adoption-of",
    "url_mobile": "",
    "title": "Despite challenges , Southern Africa has improved financial inclusion with adoption of digital financial services",
    "seendate": "20240619T063000Z",
    "socialimage": "",
    "domain": "uneca.org",
    "language": "English",
    "sourcecountry": "Ethiopia",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "18 June, 2024 Share this: facebook twitter email print Johannesburg, South Africa, 18 June 2024 (ECA) - Countries in Southern Africa performed well on their financial inclusion, between 2011 and 2021, thanks to their rapid adoption of digital financial services including mobile money. This is according to financial experts at a webinar on the African Financial Sector in Southern Africa. Organized by the Economic Commission for Africa (ECA) in partnership with the Making Finance Work for Africa/AfDB, the webinar is part of a series themed, Regional Dialogues on the African Financial Sector - regional profiles. The aim of the regional profiles is to provide detailed information on the countries' financial sectors, documenting recent trends, progress, challenges, and opportunities for a deeper financial sector. In her opening remarks Eunice Kamwendo, ECA’s Director of the Subregional Office for Southern Africa noted the potential for growth, innovation and sustainable investments in the financial sector in Southern Africa. “Southern African region’s financial sector faces financial challenges that include liquidity issues, debt distress, limited access to financial services, high levels of informality and regulatory constraints; Despite these challenges, it is important to prioritize the development of the financial sector to create stability, mobilize domestic resources and foster a stable environment for investment,” said Ms. Kamwendo. Presenting a report on the demographic economic landscape of the Southern African region, Alain Kpassokro, consultant in development finance said the banking sector in Southern Africa has remained solvent with adequate capital; banking liquidity remained sufficient, with most banks seeing profitability between 2021 and 2023. “The challenge in the banking industry in the region is the strong interconnection between the banking system and non – banking financial institutions and foreign markets, which leads to the risk of contagion,” said Mr. Kpassokro. He proposed that governments should increase fiscal space by expanding government revenues through diversification of the tax base and simplification of tax systems to reduce the exposure of banks to sovereign risks. Punki Modise, Chief strategy and sustainability officer, ABSA Bank highlighted the varying levels of debt to GDP ratios across African countries and noted that some countries such as Kenya, Ghana, Kenya and Egypt have adopted unsustainable debt strategies. She also emphasized the importance of project preparation and bankability in the private sector. “Authorities should enhance competition in the banking systems through the promotion of new players especially those that help to improve financial inclusion,” she said. In addition, she said banks operating in Africa need to have a more end-to-end approach to risk management, considering bankability at all stages. On capital markets most countries in the Southern African region have a low market capitalization. The Johannesburg stock exchange, which is the leading stock exchange in Africa has a market capitalization of $1022.8 trillion representing 133% of GDP in 2023, against 51.9% of Mauritius and 18.6% of Namibia. A lack of liquidity characterizes the bulk of the South African stock market and the breadth of the stock market in the region remains limited. Furthermore, a small, listed number of companies and corporate bonds tend to dominate the fixed income market while the proportion of government bonds in the normal value is much higher. “A deeper pool of insurers is required for the acceleration of green bonds growth in the region especially among corporate borrowers,” said Mr. Kpassokro. According to the experts attending the meeting, the pension fund penetration remains low in most Southern African countries. However, the high pension penetration rate in South Africa, Namibia and Botswana were the result of good investment returns on the funds, based on a diversified investment strategy coupled with a strong asset allocation process, Bernard Yen, Actuary and managing director Aon Solutions Ltd, Mauritius highlighted the challenge of encouraging people in the formal sector to save and discussed the importance of structural changes to increase participation in pension funds. He suggested that structural changes such as tax incentives and simplified registration processes could drive participation. He also emphasized the need for a multi-faceted approach to increase pension fund participation in the region. “Countries should explore ways to increase participation of informal sector workers in multi-employer pension funds,” he added. On the question of tapping into southern African SMEs, participants noted that the majority are financially constrained and face a lack of skills in corporate governance, financial management and often contend with high collateral requirements. Mr. Bamugye noted the need to help SMEs develop bankable business plans and called for streamlining government support programs towards them. He emphasized the importance of blended finance structures to address the challenges faced by SMEs in the region including the need for risk capital and conditionality and use of unfunded guarantees to unlock local liquidity. He acknowledged the obstacle of bank credit access in the region particularly for SMEs and encouraged innovative and creative solutions to promote financial inclusion advising that countries should continue to explore innovative instruments and blended approaches to solve SME credit access problems. Issued by: Communications Section Economic Commission for Africa PO Box 3001 Addis Ababa Ethiopia Tel: +251 11 551 5826 E-mail: eca-info@un.org"
  },
  {
    "url": "https://aninews.in/news/business/indias-non-banking-financial-sector-grew-by-10-declined-globally-by-320240617132708/",
    "url_mobile": "/news/business/indias-non-banking-financial-sector-grew-by-10-declined-globally-by-320240617132708?amp=1",
    "title": "India non - banking financial sector grew by 10 %; declined globally by 3 % ",
    "seendate": "20240617T104500Z",
    "socialimage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20240617074807.png",
    "domain": "aninews.in",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "India's non-banking financial sector grew by 10%; declined globally by 3 % ANI | Updated: Jun 17, 2024 13:27 IST ANI News Join our Whatsapp channel New Delhi[India], June 17 (ANI): India's non-banking financial sector registered a growth of 10 per cent however globally the sector declined by 3 per cent, highlights a report by SBI . The non-banking financial institutions are typically those that do not possess a full banking license and thus, cannot accept public deposits. These entities usually focus on lending and financing activities. \"Globally, the size of the non-bank financial intermediation (NBFI) sector declined by 3 per cent in 2022, which is the first notable decrease since. However, Economic Function 2 (EF2) entities i.e., entities undertaking lending activities, which are akin to NBFC s in India, exhibited a growth of around 10 per cent which is the highest among all five economic categories of the NBFI sector\" said the report. The report highlighted India as the third-largest entities in the non-banking financial sector, following the United States and the United Kingdom. Over the past decade, the Indian banking system has demonstrated remarkable resilience, overcoming numerous challenges posed by both domestic and international economic environments. The report said that the improvement in asset quality and the strong macroeconomic fundamentals have played a crucial role in improving the Indian banking sector. It highlighted that the Indian government and regulatory bodies have focused on creating a level playing field for financial institutions. This has involved initiatives such as the creation of strong banks through mergers and capital infusion, improving governance practices, expanding the reach and quality of financial services, and enhancing the adoption of digital banking. During the pandemic, the government maintained the financial sector's stability through substantial capital and liquidity buffers. This resilience is credited to the proactive measures taken by the Reserve Bank of India (RBI). The report also highlighted RBI's efforts in strengthening the financial system included enforcing the regulatory measures that ensured the sector remained well-cushioned against economic shocks. These measures have not only helped in maintaining stability but also in fostering growth and innovation within the sector. Recently India's digital banking landscape has also seen significant advancements. The push towards digital banking has been a major contributor to the sector's growth. This transition to digital platforms has expanded access to financial services, making them more inclusive and efficient. Moreover, the report said that the government and regulatory bodies have prioritized customer protection, ensuring that the interests of the public are safeguarded amidst the digital transformation. (ANI)"
  },
  {
    "url": "https://news.webindia123.com/news/Articles/Business/20240617/4206472.html",
    "url_mobile": "",
    "title": "India non - banking financial sector grew by 10 %; declined globally by 3 % ",
    "seendate": "20240617T100000Z",
    "socialimage": "",
    "domain": "news.webindia123.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Wednesday, November 12, 2025 Advertise with us News SEARCH NEWS NEWS HOME » BUSINESS India's non-banking financial sector grew by 10%; declined globally by 3 % Share Tweet COMMENT New Delhi | June 17, 2024 1:41:27 PM IST India's non-banking financial sector registered a growth of 10 per cent however globally the sector declined by 3 per cent, highlights a report by SBI. The non-banking financial institutions are typically those that do not possess a full banking license and thus, cannot accept public deposits. These entities usually focus on lending and financing activities. \"Globally, the size of the non-bank financial intermediation (NBFI) sector declined by 3 per cent in 2022, which is the first notable decrease since. However, Economic Function 2 (EF2) entities i.e., entities undertaking lending activities, which are akin to NBFCs in India, exhibited a growth of around 10 per cent which is the highest among all five economic categories of the NBFI sector\" said the report. The report highlighted India as the third-largest entities in the non-banking financial sector, following the United States and the United Kingdom. Over the past decade, the Indian banking system has demonstrated remarkable resilience, overcoming numerous challenges posed by both domestic and international economic environments. The report said that the improvement in asset quality and the strong macroeconomic fundamentals have played a crucial role in improving the Indian banking sector. It highlighted that the Indian government and regulatory bodies have focused on creating a level playing field for financial institutions. This has involved initiatives such as the creation of strong banks through mergers and capital infusion, improving governance practices, expanding the reach and quality of financial services, and enhancing the adoption of digital banking. During the pandemic, the government maintained the financial sector's stability through substantial capital and liquidity buffers. This resilience is credited to the proactive measures taken by the Reserve Bank of India (RBI). The report also highlighted RBI's efforts in strengthening the financial system included enforcing the regulatory measures that ensured the sector remained well-cushioned against economic shocks. These measures have not only helped in maintaining stability but also in fostering growth and innovation within the sector. Recently India's digital banking landscape has also seen significant advancements. The push towards digital banking has been a major contributor to the sector's growth. This transition to digital platforms has expanded access to financial services, making them more inclusive and efficient. Moreover, the report said that the government and regulatory bodies have prioritized customer protection, ensuring that the interests of the public are safeguarded amidst the digital transformation. (ANI) LATEST COMMENTS (0) POST YOUR COMMENT Comments Not Available POST YOUR COMMENT TRENDING TOPICS Tariff , GST , Diwali , Iran , election , Zubeen , Trump , Mamdani , Bihar , sensex , Israel , Congress , BJP , Ladakh , Modi , pahalgam , Pakistan , cricket , Naxal , Budget CITY NEWS Delhi Mumbai Kolkata Chennai Bangalore Kochi MORE CITIES MORE BUSINESS NEWS Nykaaland 3.0 Welcomes 30,000+ Attendees... UST wins Indian CSR Awards 2025 for Wate... Press Industry calls for a balancing act... Vice President of India Calls for Nation... India's hiring intent rebounds to 11% fo... A Landmark Alliance for India's Built En... More... INDIA WORLD ASIA Delhi, J-K hold candlelight march in sol... Indian Army concludes 'Exercise Maru Jwa... 'Should be investigated properly': Congr... Rajasthan Deputy CM condemns Delhi car b... IIM Kozhikode to host 6th Globalising In... Exit polls pointing towards Mahagathband... More... Delhi Blast: Canada PM Carney, Guyanese ... 'Despite the Delhi blast, PM Modi consid... EAM Jaishankar meets German, French, Bra... 1020 MW Punatsangchuu-II Hydroelectric P... EAM Jaishankar meets UK Foreign Secretar... 'India unequivocally rejects the baseles... More... Asim Munir due for another promotion, li... HRCP slams Pakistan's border management ... Pakistan army turns guns on its own citi... Pakistan's energy future at risk amid un... Pakistan's forces accused of butchering ... Russia blasts Pakistani daily for spread... More... Top Stories EAM Jaishankar meets German, French... 1020 MW Punatsangchuu-II Hydroelect... \"Should be investigated properly\": ... PM Modi, Bhutan King hold discussio... Rajasthan Deputy CM condemns Delhi ... IIM Kozhikode to host 6th Globalisi... EAM Jaishankar meets UK Foreign Sec... Exit polls pointing towards Mahagat... Information About Us Advertise with us Enquiry Sitemap Terms & Conditions Privacy Policy Free Slot India Disclaimer Explore Webindia123 News and Press Releases Education And Career Video Shows Indian online bet Movie And Celebrity Events Deals And Discounts Yellow Pages/ Business Contacts Photo Gallery Classified/ Personal Ads Automobiles Realestate/ Properties for sale Copyright Suni Systems (P) Ltd, 2000 - 2025. All Rights Reserved"
  },
  {
    "url": "https://menafn.com/1108339100/QCB-Sustainability-Strategy-To-Create-Room-For-ESG-Bonds-Sukuk-Fitch",
    "url_mobile": "",
    "title": "QCB Sustainability Strategy To Create Room For ESG Bonds , Sukuk : Fitch",
    "seendate": "20240616T190000Z",
    "socialimage": "https://menafn.com/updates/pr/2024-06/16/GT_a317cimage_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.gulf-times.com/article/684941/business/qcb-sustainability-strategy-to-create-room-for-esg-bonds-sukuk-fitch",
    "url_mobile": "https://www.gulf-times.com/article/684941/business/qcb-sustainability-strategy-to-create-room-for-esg-bonds-sukuk-fitch/amp",
    "title": "QCB sustainability strategy to create room for ESG bonds , sukuk : Fitch",
    "seendate": "20240616T173000Z",
    "socialimage": "https://www.gulf-times.com/gulftimes/uploads/images/2024/06/16/thumbs/300x300/189444.jpg",
    "domain": "gulf-times.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "The Qatar Central Bank (QCB)'s environment, social and governance (ESG) and sustainability strategy could pave way for ESG bonds and sukuk and the inclusion of sukuk within the strategy is a notable development, according to Fitch, a global credit rating agency. \"The strategy's emphasis on sustainable finance aligns with the increasing focus on ESG factors within the banking sector, reflecting a trend where stakeholders demand that banks integrate ESG into their corporate strategy and financing instruments, such as bonds and sukuk,\" Fitch said. The second pillar 'Capital mobilisation towards sustainable finance', aims to enhance the financial sector's role in supporting national sustainability objectives and in mobilising capital for sustainable finance. The strategy is broadly based on three main pillars with the first pillar focusing on managing climate, environmental, and social risks in the financial sector; the second encouraging capital investments in sustainable finance and the third pillar aiming at incorporating ESG and sustainability practices into the QCB's internal operations. \"The inclusion of sukuk within the strategy is indeed a noteworthy development. Sukuk financing for environmentally friendly projects introduces a vital element to the sustainable finance sector in the region, appealing to investors who are looking for Shariah-compliant options that also fulfil ecological goals,\" Fitch said. This could support Qatar's aspiration to become a leading hub for sustainable finance innovation and capital mobilisation, in line with Qatar's National Vision 2030 and the Third Financial Sector Strategic Plan, according to the rating agency. \"Through these targeted initiatives, the QCB aims to position Qatar at the forefront of sustainable finance, making it an attractive destination for investors seeking opportunities that align with ESG,’’ Fitch said. \"We recognise the importance of integrating sustainability into our financial activities and we believe that sustainable development can only be achieved through effective partnerships between financial institutions and the society,\" QCB Governor HE Sheikh Bandar bin Mohamed bin Saud al-Thani had said in the strategy report. Calling for heightened transparency on the financial sector's contribution to national sustainability objectives, the QCB said to achieve this, the strategy includes the development of taxonomy of sustainable economic activities and guidelines for the issuance of sustainable products like loans, bonds, and sukuks. Outstanding ESG sukuk grew significantly reaching $40bn at the end of first quarter (Q1) of 2024 (all currencies). Fitch expects the ESG sukuk market to cross 7.5% of global outstanding sukuk in the coming years (at end of Q1-24: 4.6%), with growth likely to be supported by issuers’ funding diversification plans, to satisfy international ESG investors’ mandates, and by government sustainability initiatives."
  },
  {
    "url": "https://menafn.com/1108337147/Tajikistan-Swiss-SECO-Discuss-Co-Op-In-Banking-Sector",
    "url_mobile": "",
    "title": "Tajikistan , Swiss SECO Discuss Co - Op In Banking Sector",
    "seendate": "20240615T101500Z",
    "socialimage": "https://menafn.com/updates/pr/2024-06/15/TNA_498cfimage_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.prnewswire.com/news-releases/first-financial-bankshares-names-dan-summerford-evp-director-of-middle-market-banking-302172225.html",
    "url_mobile": "",
    "title": "First Financial Bankshares Names Dan Summerford EVP , Director of Middle Market Banking",
    "seendate": "20240613T164500Z",
    "socialimage": "https://mma.prnewswire.com/media/2438116/Dan_Summerford_Resized.jpg?p=facebook",
    "domain": "prnewswire.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "ABILENE, Texas , June 13, 2024 /PRNewswire/ -- First Financial Bankshares, Inc. (NASDAQ: FFIN ) has named Dan Summerford as Executive Vice President, Director of Middle Market Banking. This bank wide position brings in a seasoned veteran from the corporate banking sector to provide further guidance and leadership for the Bank's commercial banking division. Continue Reading Mr. Dan Summerford \"We are excited to welcome Dan to our company as he brings a wealth of expertise that will greatly enhance our existing commercial banking team. His years of leadership with previous institutions will be invaluable as we look to strengthen our corporate banking efforts, which continues to bring in long-lasting profitable relationships to the Bank.\" said David Bailey , Chief Banking Officer of First Financial. Summerford joins the Bank after most recently serving as Managing Director, Head of Houston Commercial Banking for East West Bank. He began his banking career in 1994 with Wells Fargo Bank and over the past 30 years, has held several senior and executive management positions over corporate and middle market banking with various financial institutions, primarily in the Southeast Texas market. In addition to his contributions to banking, Dan has also been an active member of the community, most recently serving on the Board of Trustees of the Cypress Fairbanks Educational Foundation and as a board member of the Katy ( West Houston ) Area Economic Development Council. He holds a bachelor's degree from Texas Tech University and is a graduate of the Western States School of Banking at the University of New Mexico . About First Financial Bankshares, Inc. Headquartered in Abilene, Texas , First Financial Bankshares, Inc. is a financial holding company that through its wholly-owned subsidiary, First Financial Bank, operates multiple banking regions with 79 locations in Texas , including Abilene , Acton , Albany , Aledo , Alvarado , Beaumont , Boyd , Bridgeport , Brock , Bryan , Burleson , College Station , Cisco, Cleburne , Clyde , Conroe , Cut and Shoot, Decatur , Eastland , El Campo , Fort Worth , Franklin , Fulshear , Glen Rose , Granbury , Grapevine , Hereford , Huntsville , Lumberton , Keller , Kingwood , Magnolia , Mauriceville , Merkel , Midlothian , Mineral Wells , Montgomery , Moran , New Waverly , Newton , Odessa , Orange , Palacios , Port Arthur , Ranger , Rising Star , Roby , San Angelo , Southlake , Spring , Stephenville , Sweetwater , Tomball , Trent , Trophy Club , Vidor , Waxahachie , Weatherford , Willis , and Willow Park . The Company also operates First Financial Trust and Asset Management Company, with nine locations and First Technology Services, Inc., a technology operating company. The Company is listed on The NASDAQ Global Select Market under the trading symbol FFIN. For more information about First Financial, please visit our website at http://www.ffin.com. SOURCE First Financial Bankshares, Inc. 21 % more press release views with Request a Demo × Modal title"
  },
  {
    "url": "https://www.khaleejtimes.com/business/economy/uae-economic-growth-projected-at-3-9-this-year",
    "url_mobile": "https://www.khaleejtimes.com/business/economy/uae-economic-growth-projected-at-3-9-this-year?amp=1",
    "title": "UAE economic growth projected at 3 . 9 % this year",
    "seendate": "20240613T153000Z",
    "socialimage": "https://image.khaleejtimes.com?uuid=3e7041b8-40a4-4be5-bdb7-01c2af013a3a&function=cropresize&type=preview&source=false&q=75&crop_w=0.82222&crop_h=0.99999&x=0.08889&y=0&.jpg",
    "domain": "khaleejtimes.com",
    "language": "English",
    "sourcecountry": "United Arab Emirates",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Dutch legend in Dubai: Gullit gives verdict on GOAT debate"
  },
  {
    "url": "https://finance.yahoo.com/news/canadians-bank-canadian-bankers-association-015505203.html",
    "url_mobile": "",
    "title": "How Canadians bank : Canadian Bankers Association highlights that digital banking has become the norm",
    "seendate": "20240613T041500Z",
    "socialimage": "https://media.zenfs.com/en/retail_banker_international_407/31a97d29c12e38a9eb0be5dce33a6fdc",
    "domain": "finance.yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "How Canadians bank: Canadian Bankers Association highlights that digital banking has become the norm Douglas Blakey June 12, 2024 4 min read The introduction and rapid adoption of digital banking alternatives has transformed the way that Canadians conduct their banking. Digital banking has become the norm in terms of how people do most of their banking. More than 4 in 10 Canadians say their use of apps and online banking has been increasing in recent years. 87% have banked online in the last year, but online banking behaviours appear to be migrating towards more app-based banking over time. 70% have used an app to do their banking, up from 65% in 2021. On average, the number of reported uses of mobile app per month is 7.4 times. Young adults (age 18-29) are more likely to be app-centric while older adults (age 70+) do more online banking. Phone banking has been declining. Roughly a quarter of consumers use in-person services according to the Canadian Bankers Association report. The average number of reported bank branch visits per month dropped from 1.8 in 2021 to 1.3 in 2024. ATMs are still in use, but frequency of use may be declining. Reported withdrawals from ATMs are, on average, 2.7 times per month in 2023. This is up from the pre-pandemic level of 2.4 times per month in 2018. Canadians are highly satisfied with banking services Exceptionally large numbers of Canadians are satisfied with the banking services they access from banks in Canada. 97% say that they are satisfied with online banking. 96% say that they are happy with app-based banking. Meantime, 95% are satisfied with ABM banking. Satisfaction with these types of banking have all improved in recent years. The use of e-transfer has almost doubled in 6 years, to an average of 4 times per month in 2023. Other key findings 40% said they will increase the use of e-transfer over the next 5 years; Almost everyone expects to be using credit and debit cards 5 years from now; Close to a third expect to be using some form of digital or crypto currency, down 4% from 2021, and 70% believe they will no longer be using cheques, up from 62% in 2018. Canadian channel preferences Banking app use has seen the biggest increase, from 9% in 2014 to 30% in 2023. Only 41% of consumers say their use of online banking has increased in recent years, compared with 46% in 2021. 48% of consumers say they have increased their use of an app in the last few years. This compares to 37% in 2021. The reported frequency of use of tap and pay with credit and debit cards remains strong, with apparent rise in the use of debit cards from 2021. The average Canadian reports using Tap & Pay 10 times a month. Credit card and debit cards are used 8.7 times and 9.6 times a month, respectively. The use of e-transfer has increased to 4 times a month from 2.9 times in 2021. Story Continues Online banking continues its leading position as the most common form of banking for most Canadians. But some consumers are shifting towards primarily using an app. Online banking is the go-to channel for Canadians aged 60 and older (59% for consumers aged 60-69 and 66% for those over 70). For those over 70, only 9% said they use an app to conduct their banking transactions. For the age group of 18-29, 39% use an app to conduct the majority of their banking transactions. This is followed by 37% for people aged between 30 and 44. In 2024, 70% said that they have used an app to conduct banking. Some 30% say they use an app for the majority of their banking, up from 23% in 2018. The branch remains an important banking channel 61% of Canadians used in-branch banking in 2024, up from 57% in 2021. However, the level has not gone back to pre-pandemic levels of 67% in 2018. It is likely that it will not go back to that level. Only 12% of customers do most of their banking at the branch. 27% plan to decrease their bank branch visits over the next five years. Use and interest in digital currencies is down The use of digital currencies has not advanced much in the last few years. 9% say they use cryptocurrency now, compared to 13% in 2021. 32% say that they will use alternative currency five years from now, down from 36% in 2021. 10% say they will use cryptocurrency in the future, compared to 14% in 2021. Half say they will never use cryptocurrency, up from 43% in 2021. \"How Canadians bank: Canadian Bankers Association highlights that digital banking has become the norm\" was originally created and published by Retail Banker International , a GlobalData owned brand. The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site. View Comments Terms and Privacy Policy Privacy Dashboard More Info"
  },
  {
    "url": "https://www.benzinga.com/markets/cryptocurrency/24/06/39250508/financial-sector-dominates-q1-crypto-funding-with-323m-inflows",
    "url_mobile": "https://www.benzinga.com/amp/content/39250508",
    "title": "Financial Sector Dominates Q1 Crypto Funding With $323M Inflows",
    "seendate": "20240610T144500Z",
    "socialimage": "https://cdn.benzinga.com/files/images/story/2024/06/10/Business-Concept-Of-Venture-Capital-Fund.jpeg?&fit=crop",
    "domain": "benzinga.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "España Italia 대한민국 日本 Français My Account Benzinga Edge Benzinga Research Benzinga Pro Login Get Benzinga Pro Data & APIs Events Premarket Advertise Contribute España Italia 대한민국 日本 Français Login Register Premium Services Financial News Latest Earnings Guidance Dividends M&A Buybacks Interviews Management Offerings IPOs Insider Trades Biotech/FDA Politics Healthcare Small-Cap Markets Pre-Market After Hours Movers ETFs Options Cryptocurrency Commodities Bonds Futures Mining Real Estate Volatility Ratings Analyst Color Downgrades Upgrades Initiations Price Target Investing Ideas Trade Ideas Long Ideas Short Ideas Technicals Analyst Ratings Analyst Color Latest Rumors Whisper Index Stock of the Day Best Stocks & ETFs Best Penny Stocks Best S&P 500 ETFs Best Swing Trade Stocks Best Blue Chip Stocks Best High-Volume Penny Stocks Best Small Cap ETFs Best Stocks to Day Trade Best REITs Money Investing Cryptocurrency Mortgage Insurance Yield Personal Finance Forex Startup Investing Real Estate Investing Prop Trading Credit Cards Stock Brokers Markets Pre-Market After Hours Movers ETFs Options Cryptocurrency Commodities Bonds Futures Mining Real Estate Volatility Ratings Analyst Color Downgrades Upgrades Initiations Price Target Investing Ideas Trade Ideas Long Ideas Short Ideas Technicals Analyst Ratings Analyst Color Latest Rumors Whisper Index Stock of the Day Best Stocks & ETFs Best Penny Stocks Best S&P 500 ETFs Best Swing Trade Stocks Best Blue Chip Stocks Best High-Volume Penny Stocks Best Small Cap ETFs Best Stocks to Day Trade Best REITs Money Investing Cryptocurrency Mortgage Insurance Yield Personal Finance Forex Startup Investing Real Estate Investing Prop Trading Credit Cards Stock Brokers Research My Stocks Tools Free Benzinga Pro Trial Calendars Analyst Ratings Calendar Conference Call Calendar Dividend Calendar Earnings Calendar Economic Calendar FDA Calendar Guidance Calendar IPO Calendar M&A Calendar Unusual Options Activity Calendar SPAC Calendar Stock Split Calendar Trade Ideas Free Stock Reports Insider Trades Trade Idea Feed Analyst Ratings Unusual Options Activity Heatmaps Free Newsletter Government Trades Perfect Stock Portfolio Easy Income Portfolio Short Interest Most Shorted Largest Increase Largest Decrease Calculators Margin Calculator Forex Profit Calculator 100x Options Profit Calculator Screeners Stock Screener Top Momentum Stocks Top Quality Stocks Top Value Stocks Top Growth Stocks Compare Best Stocks Best Momentum Stocks Best Quality Stocks Best Value Stocks Best Growth Stocks Recent Markets June 10, 2024 9:19 AM 2 min read Financial Sector Dominates Q1 Crypto Funding With $323M Inflows by Murtuza J Merchant Benzinga Staff Writer Follow Beat the Market With Our Free Pre-Market Newsletter Enter your email to get Benzinga's ultimate morning update: The PreMarket Activity Newsletter Crypto venture capital funding in the first quarter saw the financial sector rake in the most investments . What Happened : Tom Dunleavy , Managing Partner at MV Capital , quoted figures from blockchain analytics firm Messari , revealing that deal volume decreased by 8.8% month-over-month (MoM) to $1.28 billion. The number of deals saw a slight increase of 0.7%, sustaining near yearly high levels with a total of 303 deals. The financial sector emerged as the most active, accounting for 25.2% of the total fundraising volume, with $323 million secured. This sector’s robust performance underscores its pivotal role in the evolving crypto ecosystem. Notable deals include Securitize , which raised $47 million, reflecting significant investor confidence in financial technologies within the crypto space. Surge In Consumer Sector Deals Interestingly, the consumer sector experienced an explosive growth in deal volume, surging by 248.4% MoM to $246 million. This dramatic increase was primarily driven by Farcaster ‘s $150 million raise. Such significant investments highlight the growing interest and potential within the consumer-facing crypto projects. Also Read: Bitcoin Peak of $120,000 By Late 2024, Major Alt Season To Follow: Bitfinex Key Deals And Investments Among the most notable deals in Q1 were Farcaster ($150 million), Polymarket ($70 million), Babylon ($70 million), and Humanity Protocol ($30 million). These investments reflect a diverse range of interests and innovations within the crypto sector, from decentralized social networks to prediction markets and identity verification protocols. The sustained high levels of deal activity, despite a decrease in overall funding volume, suggest a robust and resilient investment environment. The financial sector’s leading role indicates a continued focus on enhancing and expanding financial technologies within the crypto industry. These trends and their broader implications for the digital asset market will be key topics at the upcoming Benzinga Future of Digital Assets event on Nov. 19. Read Next: Can Bitcoin Reach $83,000? Key Factors Needed For A Breakout: 10x Research Image: Shutterstock Market News and Data brought to you by Benzinga APIs © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. Add Comment | 1 Posted In: Cryptocurrency News Top Stories Comments Close menu Loading... Connect With Us About Benzinga About Us Careers Advertise Contact Us Market Resources Advanced Stock Screener Tools Options Trading Chain Analysis Comprehensive Earnings Calendar Dividend Investor Calendar and Alerts Economic Calendar and Market Events IPO Calendar and New Listings Market Outlook and Analysis Wall Street Analyst Ratings and Targets Trading Tools & Education Benzinga Pro Trading Platform Options Trading Strategies and News Stock Market Trading Ideas and Analysis Technical Analysis Charts and Indicators Fundamental Analysis and Valuation Day Trading Guides and Strategies Live Investors Events Pre market Stock Analysis and News Cryptocurrency Market Analysis and News Ring the Bell A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. Subscribe Terms & Conditions Do Not Sell My Personal Data/Privacy Policy Disclaimer Service Status Sitemap © 2025 Benzinga | All Rights Reserved"
  },
  {
    "url": "https://www.yahoo.com/news/petro-calls-colombian-banks-boost-025928864.html",
    "url_mobile": "",
    "title": "Petro Calls on Colombian Banks to Boost Growth With Cheap Credit",
    "seendate": "20240608T040000Z",
    "socialimage": "https://s.yimg.com/ny/api/res/1.2/IZuB9UBKNyVdpjFKCqrFXg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_politics_602/e29c56544dbf13f82e5d21b3f68c1d7a",
    "domain": "yahoo.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "(Bloomberg) -- Colombian President Gustavo Petro called on a room of the nation’s top bankers to help reactivate the nation’s economy by doling out low-interest loans. Most Read from Bloomberg Russia Is Sending Young Africans to Die in Its War Against Ukraine Macron and Scholz Get Trounced by Far Right in EU Elections Putin Is Running Out of Time to Achieve Breakthrough in Ukraine Scholz’s SPD Suffers Record Rout in Germany’s EU Vote There’s Still a Way to Snag a 3% Mortgage Rate Advertisement Advertisement Advertisement Advertisement Speaking at the nation’s biggest banking conference in Cartagena on Friday, Petro said the economy was “cornered” by “a perfect storm” of high interest rates, reduced tax revenue and public spending cuts. “By assigning resources you can help change this nation’s economic model,” Petro said. “You can do it freely or the state can accompany you with forced investments, which we are evaluating.” Petro’s message came at the end of a three-day conference that gathered the heads of the nation’s biggest banks, as well as central bank officials and cabinet ministers. Colombia’s administration is weighing a package of bills to boost economic growth and force the financial sector to provide cheap financing to housing, agriculture and tourism. Advertisement Advertisement Advertisement Advertisement Earlier on Friday, Finance Minister Ricardo Bonilla said the government would reduce public spending by about 20 trillion pesos ($5 billion) this year after overestimating tax revenue. “If we cut spending and growth is stagnant, what can we do?,” Petro said. “The financial sector can be part of the solution.” Most Read from Bloomberg Businessweek Legacy Airlines Are Thriving With Ultracheap Fares, Crushing Budget Carriers Sam Altman Was Bending the World to His Will Long Before OpenAI David Sacks Tried the 2024 Alternatives. Now He’s All-In on Trump Is There Room for Common Ground on Congestion Pricing? Startup Brings New Hope to the Pursuit of Reviving Frozen Bodies ©2024 Bloomberg L.P. About Our Ads"
  },
  {
    "url": "https://www.computerweekly.com/news/366588192/Rapid-AI-development-poses-supervisory-challenges-in-the-Netherlands",
    "url_mobile": "",
    "title": "Rapid AI development poses supervisory challenges in the Netherlands",
    "seendate": "20240607T141500Z",
    "socialimage": "https://cdn.ttgtmedia.com/visuals/ComputerWeekly/HeroImages/AI-artificial-intelligence-cube-Shuo-adobe.jpg",
    "domain": "computerweekly.com",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Shuo - stock.adobe.com By Kim Loohuis Published: 07 Jun 2024 14:26 The Dutch Authority for the Financial Markets (AFM) and the monetary authority, De Nederlandsche Bank (DNB), are in the midst of a profound supervisory transformation fuelled by the rapid development of artificial intelligence (AI) . While technological advances are driving a wave of innovation in the financial and security industries, these supervisory bodies face significant challenges in keeping up with the complexity and pace of these changes. To shape the monitoring of AI, the two organisations have jointly released a report with starting points and concerns. The report aims to engage the bodies in dialogue with the industry, demonstrating their commitment to transparency and collaboration. AI in finance The growing influence of AI in the Dutch financial world is not just a matter of technological advancement, but also raises profound questions about the risks involved . Banks and insurers increasingly make decisions on lending and policy premiums using AI. This development has not gone unnoticed by the citizens, who are increasingly concerned about how this could affect their financial well-being. Research shows that only a quarter of Dutch respondents are optimistic about the use of AI by financial institutions, but more than six in 10 believe strict supervisory measures could help. These concerns are not to be taken lightly. In response, De Nederlandsche Bank sees a vital role for itself as a strict watchdog, looking out for both the risks and opportunities of AI use in the financial sector. DNB board member Steven Maijoor said in an interview with Dutch news site AD: “AI is here to stay. It is happening now and will become more and more important. Then we’d better regulate it properly.” This statement underscores the gravity of the situation and the need for responsible regulation. Ensuring individuals’ privacy and preventing data misuse are essential aspects of adequate supervision in the age of AI Pursuing a balanced approach to AI in the financial sector aligns with the insights of the report by De Nederlandsche Bank and the Financial Markets Authority. The report, The impact of AI on the financial sector and supervision , provides an in-depth insight into this shift and highlights the crucial role of AI in modernising financial services. The supervisory bodies have closely analysed the impact of AI on the financial sector, and they stress the importance of supervising the responsible use of AI by financial institutions. With the emergence of AI in the decision-making process of banks and insurers, it becomes crucial to adequately supervise and ensure that AI systems are transparent and respect consumers’ fundamental rights. DNB and AFM will, therefore, work to assess the risks of AI in the financial sector and take appropriate measures to protect consumers from potential dangers, reinforcing the audience’s sense of security. “When it comes to digitisation, [financial] entrepreneurs and organisations look mainly at the security risks to their own business and much less at the societal consequences. This is worrying,” said Jan Matto, partner for IT audit and advisory at Mazars Nederland . “As an entrepreneur, you must report on the systemic risks you may face with digital personal data, for example. Think of discrimination, exclusion, illegal arms trade, the undermining of democratic processes, the spread of fake news – which, for example, is harmful to the health or well-being of individuals – and the failure to respect the rights of children in particular,” he added. “It is strange that we require every company to be responsible but demand so few guarantees when it comes to digitisation.” One of the primary challenges arising from the accretion of AI is the complexity of algorithms used in financial processes and security operations. Traditional oversight mechanisms may not be adequately equipped to understand and evaluate the deep workings of these complex algorithms. Therefore, the AFM and the BND need to invest in advanced analytical capabilities and specialist expertise to monitor and control these algorithms effectively. Another crucial aspect highlighted in the report is the need for transparency and accountability in the use of AI in the financial and security sectors. This requires the AFM and the BND to ensure an adequate data protection and privacy framework, as AI systems often rely on large amounts of sensitive data. Ensuring individuals’ privacy and preventing data misuse are essential aspects of adequate supervision in the age of AI. Ethical AI governance Moreover, the rise of AI brings new risks, such as the possibility of unintentional discrimination or bias in automated decision-making systems. AFM and BND acknowledge that these risks call for proactive measures to ensure that AI applications are fair and equitable and meet the highest ethical standards. Developing guidelines and standards for the ethical use of AI will play a crucial role in ensuring integrity and trust in financial and security processes. It is strange that we require every company to be responsible but demand so few guarantees when it comes to digitisation Jan Matto, Mazars Nederland Another key challenge is strengthening staff capabilities and training them in AI-related skills. The AFM and the BND need continuous training and professional development to ensure that their teams remain up to date with the latest developments in AI technologies and methodologies. In addition, collaboration with academic institutions and private sector partners is essential to access specialised knowledge and expertise in AI. Finally, the report stated that the AFM and the BND need to be aware of the geopolitical implications of AI, especially in the areas of cyber security and information security. The increasing use of AI in cyber attacks and espionage operations requires a more resilient and coherent approach to cyber security, where international cooperation and information sharing are crucial. The report concludes that the rise of artificial intelligence represents a paradigm shift for regulatory bodies such as the AFM and the BND. To remain effective in an ever-changing environment, the Dutch regulatory bodies must adapt to the complexity and speed of technological change while integrating AI’s ethical, legal and societal implications into their supervisory practices. Therefore, the AFM and BND will intensify their efforts to monitor and control financial institutions’ complex algorithms and decision-making systems. They will also invest in advanced analytical capabilities and specialist expertise to ensure the transparency and accountability of AI systems. Through close cooperation with international partners and continuous evaluation of best practices, the AFM and BND will strive for a robust and adaptive supervisory regime that promotes the integrity and stability of the financial sector while fostering innovation and competition within an ethical framework. Read more on IT for financial services Reserve Bank of India proposes framework for AI adoption in India’s finance sector Companies House goes live with One Login ID verification By: Lis Evenstad What is SCADA (supervisory control and data acquisition)? By: Rahul Awati How Indian fintechs can address compliance issues"
  },
  {
    "url": "https://home.treasury.gov/news/press-releases/jy2393",
    "url_mobile": "",
    "title": "U . S . Department of Treasury Releases Request for Information on Uses , Opportunities , and Risks of Artificial Intelligence in the Financial Services Sector",
    "seendate": "20240606T193000Z",
    "socialimage": "https://home.treasury.gov/system/files/291/treasury-preview-1900x950.jpg",
    "domain": "home.treasury.gov",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "June 6, 2024 WASHINGTON – Today, the U.S. Department of the Treasury (Treasury) released a request for information on the Uses, Opportunities, and Risks of Artificial Intelligence (AI) in the Financial Services Sector. Building on Treasury’s recent work on cybersecurity and fraud in AI and recent initiatives by other federal agencies, Treasury is seeking public comment on the uses of AI in the financial services sector and the opportunities and risks presented by developments and applications of AI within the sector. “Treasury is proud to be playing a key role in spurring responsible innovation, especially in relation to AI and financial institutions. Our ongoing stakeholder engagement allows us to improve our understanding of AI in financial services,” said Under Secretary for Domestic Finance Nellie Liang. “The Biden Administration is committed to fostering innovation in the financial sector while ensuring that we protect consumers, investors, and our financial system from risks that new technologies pose.” Through this RFI, Treasury seeks to increase its understanding of how AI is being used within the financial services sector and the opportunities and risks presented by developments and applications of AI within the sector, including potential obstacles for facilitating responsible use of AI within financial institutions, the extent of impact on consumers, investors, financial institutions, businesses, regulators, end-users, and any other entity impacted by financial institutions’ use of AI, and recommendations for enhancements to legislative, regulatory, and supervisory frameworks applicable to AI in financial services. Treasury is seeking a broad range of perspectives on this topic and is particularly interested in understanding how AI innovations can help promote a financial system that delivers inclusive and equitable access to financial services. Members of the public are encouraged to submit comments within 60 days. Comments responding to this request for information will be publicly viewable here . ### Use featured image Off"
  },
  {
    "url": "http://thepeninsulaqatar.com/article/03/06/2024/meeza-hosts-roundtable-on-cloud-computing-and-financial-sector",
    "url_mobile": "",
    "title": "MEEZA hosts roundtable on cloud computing and financial sector",
    "seendate": "20240603T073000Z",
    "socialimage": "http://thepeninsulaqatar.com/get/maximage/20240603_1717397994-870.jpg",
    "domain": "thepeninsulaqatar.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Cycling from Everest to Antarctica to raise climate awareness"
  },
  {
    "url": "https://dailytimes.com.pk/1197131/meethaq-islamic-banking-elevates-its-services-in-collaboration-with-temenos-systems-limited/",
    "url_mobile": "https://dailytimes.com.pk/1197131/meethaq-islamic-banking-elevates-its-services-in-collaboration-with-temenos-systems-limited/amp/",
    "title": "Meethaq Islamic Banking Elevates its Services in Collaboration with Temenos & Systems Limited",
    "seendate": "20240601T141500Z",
    "socialimage": "",
    "domain": "dailytimes.com.pk",
    "language": "English",
    "sourcecountry": "Pakistan",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Meethaq Islamic banking, from Bank Muscat-the leadingIslamic banking institution in the Sultanate of Oman, has achieved a groundbreaking digital transformation by seamlessly migrating from a legacy Core banking system to Temenos Corefor Retail and Corporate banking, with the support of Systems Limited, a global system integrator. Meethaq stands as the largest Islamic Banking window in Oman, offering a full suite of Shari’a compliant Islamic banking products and services, including deposit products, consumer financing, credit cards, corporate banking, internet banking, mobile banking and 24X7 Contact Center for valued customers and corporate clients. Meethaq provides Shari’a compliant financial solutions to its partner companies, supporting the economy of Sultanate of Oman. The strategic partnership between Bank Muscat, Temenos, and Systems Limited spans over 15 years, showcasing Bank Muscat’s commitment to technological innovation and trust in the capabilities of Systems Limited and Temenos. The project’s size and scope were substantial, involving several Islamic Module implementations on Temenos Core for Retail and Corporate banking , retrofitting of conventional to Islamic banking, end-to-end data migration, customization of I nterfaces and functionalities, development of Islamic consumer financing and liability products on AA module, front-end mobile banking implementation, and the establishment of a Centre of Excellence by Systems Limited. The implementation of Temenos Core for Retail and Corporate banking empowers Meethaq to offer exceptional Islamic banking services without downtime on the customer layer, significantly reducing operational costs by 20-30% and enhancing time-to-market capabilities. This achievement sets the stage for Meethaq’s expansion plans, with the scalable system supporting the establishment of 30+ branches and further solidifying their presence in the Islamic banking landscape. “Meethaq ’s transformation is a monumental leap towards redefining the landscape of Islamic banking in Oman. This strategic shift to the latest Temenos Core banking platform , orchestrated with the unwavering support of Systems Limited, marks a significant milestone in our journey and aligns perfectly with our long-term objectives. Our vision for Meethaq goes beyond traditional banking; we aspire to be the beacon of Shari’a-compliant financial services, setting industry benchmarks and fostering economic growth in Oman. We are confident that the scalability of the system will support our ambitious expansion plans, enhance our portfolio of Islamic banking offerings , and further solidify our presence in the Islamic banking landscape.” Shamzani Mohammed Hussain , General Manager, Meethaq Islamic Banking Group, Bank Muscat “Th is successful implementation is a testament to the strong and enduring relationship we share with the Bank . Our collaboration has contributed to enhancing their banking services and strengthen ing their position as leaders in the Islamic banking sector . This achievement highlights the dedication and expertise of our teams and solidifies our position in the Middle East region, making Systems Limited the partner of choice for innovative and impactful banking technology services.” Ammara Masood Global industry GM Banking and Financial Services, Systems Limited “Bank Muscat is a long-term core banking Temenos customer for conventional banking and we are proud they put their trust in us when they decided to source a new core banking system for Meethaq. Following the smooth and successful implementation , Meethaq is well-positioned to meet the evolving needs of its customers and contribute to the growth of the Islamic banking sector in Oman.” Lee Allcorn, Managing Director – Middle East & Africa, Temenos"
  },
  {
    "url": "https://article.wn.com/view/2024/05/31/World_Bank_approves_250_mln_USD_loan_to_support_Ghanas_finan/",
    "url_mobile": "",
    "title": "World Bank approves 250 mln USD loan to support Ghana financial stability",
    "seendate": "20240531T204500Z",
    "socialimage": "",
    "domain": "article.wn.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "system Top Stories Live World N.America & Canada Central America South America Africa Asia Oceania Europe Middle East Journalism Review Julian Assange Assange Videos Chris Hedges UK Column Rebel News John Pilger War on Terror - Articles War on Terror - Videos Business FIAT Currencies Crypto Currencies Markets Commodities Stocks Rates & Bonds Futures Blockchain Science & Technology AI Cybercrime Fuel Cells & Batteries Gaming Medical Instruments Mobiles & Wifi Robotics & Drones Space Sport Basketball American Football Tennis Golf Football Environment Renewable Energy Plastic Microplastic Climate change Waste Disposal Recycling Ocean Acidification Ice Loss Biodiversity Deforestation Ozone Layer Depletion Global Warming Arts & Culture Music Comedy Film Fashion Education Books Health GM Food Dangers GMO Corporate News Animal Farming Diet Yoga Mental Wellbeing Coronaviruses More Open Minds Weather Local World Bank approves 250 mln USD loan to support Ghana's financial stability Posted 2024-05-31, China.dot.org Headlines ACCRA, May 31 (Xinhua) -- The World Bank Group has approved a 250-million-U.S. dollar loan to support Ghana's financial sector stability program over the next five years, according to a press release issued here on Friday. The release said the loan would help strengthen Ghana's financial sector after the government's ... read full story \" Through the GFSF, this project will contribute to Ghana's financial stability by providing solvency support to banks and SDIs impacted by the DDEP, \" Ask about this article Answer for your question of the article will be displayed here ... Interpret EXPLORE WN.com Advanced Search Education Cities.com Dubai.com TravelAgents.com Weather World Photos Cheese.com Broadcasts.com Metas.com Students.com Emissions.com Population.com Domaines.com Wages.com © 2025 All Rights Reserved, World News Inc.| About WN | Sitemap | Privacy Policy | Contact | Jobs | Feedback | Newsletter"
  },
  {
    "url": "https://www.graphic.com.gh/business/business-news/world-bank-approves-250million-loan-to-bolster-ghanas-financial-sector.html",
    "url_mobile": "",
    "title": "World Bank approves $250million loan to bolster Ghana financial sector",
    "seendate": "20240531T170000Z",
    "socialimage": "https://www.graphic.com.gh/images/2024/july/10/banker.jpg#joomlaImage://local-images/2024/july/10/banker.jpg",
    "domain": "graphic.com.gh",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "World Bank approves $250million loan to bolster Ghana's financial sector World Bank approves $250million loan to bolster Ghana's financial sector Graphic Online Business News May - 31 - 2024 , 15:21 The World Bank has pledged $250 million to support Ghana's financial sector stability through a five-year project. In a statement, the World Bank said the loan, approved on May 30, 2024, will be provided by the International Development Association (IDA), a World Bank arm dedicated to assisting low-income countries. This project aligns with Ghana's Financial Sector Strengthening Strategy (FSSS) and aims to address the impact of the country's Domestic Debt Exchange Programme (DDEP) on banks and financial institutions. The project will support the FSSS by contributing to financial stability through the recapitalization of viable Banks and Specialized Deposit-taking Institutions (SDIs) impacted by the DDEP. \"The financial system is the lifeblood of Ghana's economy,\" said Robert R. Taliercio, World Bank Country Director for Ghana, Liberia, and Sierra Leone. \"This project will strengthen financial stability by providing solvency support to banks and institutions affected by the DDEP, ensuring continued access to essential financial services for Ghanaians.\" The funds will be channelled through the Ghana Financial Sector Stability Fund (GFSF), established by the government to support struggling institutions. This project prioritizes immediate assistance to eligible undercapitalized banks and financial institutions, with provisions for future support if needed. \"The World Bank's support aims to mitigate short-term shocks and promote long-term resilience in Ghana's financial sector,\" explained Carlos Leonardo Vicente, Senior Financial Specialist and Team Lead for the project. \"Financial stability is crucial for protecting Ghanaians and preserving jobs.\" This initiative complements other World Bank programs in Ghana, including the Development Policy Financing series and the IMF's Extended Credit Facility. These programmes focus on broader economic reforms and enabling financial institutions to operate profitably. The World Bank also supports projects focused on economic recovery and job creation, such as the Ghana Development Financing Project. The World Bank's International Development Association (IDA) has a long history of assisting low-income countries. Since its inception in 1960, IDA has provided financial assistance to 114 countries, with a particular focus on Africa. Read the entire World Bank statement below; World Bank Supports Ghana to Strengthen its Financial Sector WASHINGTON, May 30th, 2024 – The World Bank today approved a $250 million International Development Association (IDA)* credit for a five-year Ghana Financial Stability Project. The project will support Ghana’s Financial Sector Strengthening Strategy (FSSS) by contributing to financial stability through the recapitalization of viable Banks and Specialized Deposit-taking Institutions (SDIs) impacted by Ghana’s Domestic Debt Exchange Program (DDEP). The financial system is critical to the functioning of the Ghanaian economy, providing critical services to households, firms, government, and supporting economic growth. To address the severe impact of the DDEP on financial institutions, the Government established the Ghana Financial Sector Stability Fund (GFSF) to provide solvency support to banks, pension funds, insurance companies fund managers and collective investment schemes. “This project will contribute to Ghana’s financial stability, by providing solvency support to banks and SDIs impacted by the DDEP through the GFSF.” said Robert R. Taliercio, World Bank Country Director for Ghana, Liberia, and Sierra Leone. “Through direct support to banks and SDIs, the project will benefit Ghana’s financial sector and the economy by supporting the access of depositors and other financial consumers to savings, payments, and other core financial services provided by adequately capitalized banks and SDIs.“ The Ghana Financial Stability project is expected to immediately benefit eligible undercapitalized but viable banks and SDIs and become accessible to other banks and SDIs that may need support in the future due to potential new losses and providing a backstop against unexpected losses. “The World Bank Group’s support aims to help address short-term shocks to improve prospects for long-term sustainable development and long-term resilience against future shocks. The project promotes financial stability, a key requirement to protect people and preserve jobs,” said Carlos Leonardo Vicente, Senior Financial Specialist and Team Lead. The project complements the World Bank’s Development Program Financing series and the IMF-Extended Credit Facility, which support reforms to improve the macroeconomic environment and enable financial institutions to operate profitably and generate internal capital. It also complements other World Bank funded projects aimed at economic recovery and job creation in Ghana, such as the Ghana Development Financing Project which supported the establishment of the Development Bank of Ghana and provides long-term financing to small and medium enterprises and small corporates. *The World Bank’s International Development Association (IDA), established in 1960, helps the world’s poorest countries by providing grants and low to zero-interest credits for projects and programs that boost economic growth, reduce poverty, and improve poor people’s lives. IDA is one of the largest sources of assistance for the world’s 74 poorest countries, 39 of which are in Africa. Resources from IDA bring positive change to the 1.3 billion people who live in IDA countries. Since 1960, IDA has provided $458 billion to 114 countries. Annual commitments have averaged about $29 billion over the last three years (FY19-FY21), with about 70 percent going to Africa. Learn more online: IDA.worldbank.org. #IDAworks. From Around The Web © 2005 - 2025 Graphic Online | Graphic Communications Group Ltd."
  },
  {
    "url": "https://www.indiainfoline.com/company/state-bank-of-india-share-price/1375",
    "url_mobile": "https://www.indiainfoline.com/company-amp/state-bank-of-india-share-price/1375",
    "title": "St Bk of India Share Price : Live State Bank of India Stock Price on 24 - 05 - 2024",
    "seendate": "20240524T041500Z",
    "socialimage": "",
    "domain": "indiainfoline.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Investor Relations | ESG Profile | Login Login To Trade Login To DP Login To MF St Bk of India Overview Futures Options Chain Peer Comparison News & Events Share Holding Pattern Corporate Actions Historical Data State Bank of India Share Price Live NSE BSE ₹ 953.3 ( 0.23 %) Nov 11, 2025 | 12:00:00 AM Trade Invest wise with Expert advice Get Started By continuing, I accept the T&C and agree to receive communication on Whatsapp Equities Futures Option 1D 1W 1M 1Y 5Y All Open ₹ 953.6 Day's High ₹ 954.95 52 Wk High ₹ 971.4 Prev. Close ₹ 951.15 Day's Low ₹ 945.05 52 Wk Low ₹ 680 Turnover (lac) 82,450.12 P/E 12.33 Face Value ₹ 1 Book Value ₹ 517.98 EPS 77.31 Mkt. Cap (Cr.) ₹ 8,79,954.77 Div. Yield 1.61 View All Historical Data Loading... Open ₹ 955 Day's High ₹ 958.7 Spot ₹ 953.3 Prev. Close ₹ 954.7 Day's Low ₹ 947.9 View Short Covering Market Lot 750 OI(Chg %) -9,70,500 (-1.35%) Roll Over% 0.63 Roll Cost 1.35 Traded Vol. 1,04,82,000 (-4.51%) View More Futures Loading... State Bank of India KEY RATIOS Sector Banks Open ₹ 953.6 Prev. Close ₹ 951.15 Turnover(Lac.) ₹ 82,450.12 Day's High ₹ 954.95 Day's Low ₹ 945.05 52 Week's High ₹ 971.4 52 Week's Low ₹ 680 Book Value ₹ 517.98 Face Value ₹ 1 Mkt Cap (₹ Cr.) 8,79,954.77 P/E 12.33 EPS 77.31 Divi. Yield 1.61 State Bank of India Corporate Action All 3 May 2025 12:00 AM BookCloser 6 May 2025 12:00 AM AGM Announcement Date: 06 May, 2025 3 May 2025 12:00 AM Dividend Dividend Amount: 15.9 Record Date: 16 May, 2025 18 Oct 2025 12:00 AM Board Meeting Agenda : Audited Result 8 May 2025 12:00 AM EGM View All Event Calendar State Bank of India NEWS AND UPDATE SBI enters $100-Billion market cap club post Q2 results Copy Link The milestone also coincides with the public-sector bank surpassing the ₹100 Trillion total business milestone. 6 Nov 2025 | 02:06 PM Read More SBI shares zoom ~3% on completing YES Bank stake sale Copy Link The company said that it has sold off 13.18% stake in Yes Bank to Japanese giant Sumitomo Mitsui Banking Corporation (SMBC). 17 Sep 2025 | 02:51 PM Read More UPI Daily Transactions Hit ₹90,446 Crore, SBI Tops 5.2 Billion Transfers Copy Link The monthly average UPI transaction value stood at ₹24,554 billion, while the monthly average CIC growth was ₹193 billion between April and July 2025. 18 Aug 2025 | 04:09 PM Read More Top Stocks for Today - 17th July 2025 Copy Link Here are some of the stocks that may see significant price movement today: Tech Mahindra, L&T Technology, Maruti Suzuki, etc. 17 Jul 2025 | 06:22 AM Read More SBI board approves $3 Billion overseas fundraise for FY26 Copy Link The issue may be done through public offers or private placements. This subject to market conditions, and regulatory approvals, stated the public lender. 21 May 2025 | 11:06 AM Read More Read More Invest wise with Expert advice Get Started By continuing, I accept the T&C and agree to receive communication on Whatsapp Knowledge Center Demat Account View More What is Demat Account? Aims and Objectives of Demat Account How Does Demat Account Work? Demat Account Opening Charges How to open a Demat Account? Documents Required to open a Demat Account Difference Between Demat and Trading Account Dematerialization & It's Process Trading Account View More What is Trading Account How to Open a Trading Account ? Trading Account Opening Fees and Charges Difference between NRE, NRI and NRO Account State Bank of India SHAREHOLDING SNAPSHOT 12 Nov, 2025 | 08:51 AM Sep-2025 Jul-2025 Jun-2025 Mar-2025 Foreign Promoter Indian Promoter Institutions Non Institutions Custodies Promoter- 55.03 % Foreign: 0.00 % Indian: 55.03 % Non-Promoter- 37.06 % Institutions: 37.05 % Non-Institutions: 7.07 % Custodian: 0.84 % Read More State Bank of India FINANCIALS Balance Sheet Profit & Loss Cash Flow Ratios Results Consolidated Standalone Graph Table Y/e 31 Mar( In .Cr) Mar-2025 Mar-2024 Mar-2023 Mar-2022 Equity Capital 892.46 892.46 892.46 892.46 Preference Capital 0 0 0 0 Reserves 4,40,269.66 3,76,354.07 3,26,715.99 2,79,195.6 Net Worth 4,41,162.12 3,77,246.53 3,27,608.45 2,80,088.06 Minority Interest View Balance Sheet Consolidated Standalone Graph Table Y/e 31 Mar( In .Cr) Mar-2017 Mar-2016 Mar-2015 Mar-2014 Revenue 0 0 0 0 yoy growth (%) 0 0 0 0 Raw materials 0 0 0 0 As % of sales 0 0 0 0 Employee costs 0 0 0 0 View Profit & Loss Consolidated Standalone Graph Table Y/e 31 Mar( In .Cr) Mar-2017 Mar-2016 Mar-2015 Mar-2014 Profit before tax 0 0 0 0 Depreciation 0 0 0 0 Tax paid 0 0 0 0 Working capital 19,931.77 29,557.83 39,225.57 14,093.21 Other operating items View Cash Flow Consolidated Standalone Graph Table Y/e 31 Mar Mar-2017 Mar-2016 Mar-2015 Mar-2014 Growth matrix (%) Revenue growth 0 0 0 0 Op profit growth 0 0 0 0 EBIT growth 0 0 0 0 Net profit growth 0 0 0 0 View Ratios Consolidated Standalone Select Period Annually Particulars (Rupees in Crores.) Mar-2025 Mar-2024 Mar-2023 Mar-2022 Mar-2021 Gross Sales - - - - - Excise Duty - - - - - Net Sales - - - - - Other Operating Income - - - - - Other Income - - - - - State Bank of India Peer Comparison Company Name LTP (₹) P/E (%) Mkt.Cap (₹Cr.) NP Qtr (₹Cr.) Div.Yield (%) Sales Qtr (₹.Cr) Book Value (₹) HDFC Bank Ltd HDFCBANK 991.7 21.43 15,24,906.7 18,641.28 1.1 76,690.7 337.02 ICICI Bank Ltd ICICIBANK 1,358.3 19.59 9,70,727.19 12,358.89 0.81 41,757.95 427.34 State Bank of India SBIN 953.3 12.33 8,79,954.77 20,159.67 1.61 1,19,653.93 531.6 Kotak Mahindra Bank Ltd KOTAKBANK 2,086.9 31 4,15,096.71 3,253.33 0.12 13,649.41 629.36 Axis Bank Ltd AXISBANK 1,222.5 15.6 3,79,260.18 5,089.64 0.08 30,970.23 612.07 Figures of Market Capital(Mar Cap), Quarterly Net Profit(NP Qtr) and Quarterly Sales(Sales Qtr) are in ₹ Cr. View All Peer Comparision MORE ABOUT State Bank of India Management Register Office Registrar Office Chairman & Managing Director Challa Sreenivasulu Setty Non Executive & Independent Director Ketan S Vikamsey Non Executive & Independent Director Mrugank M Paranjape Managing Director Ashwini Kumar Tewari Company Sec. & Compli. Officer Aruna Nitin Dak. Managing Director VINAY MURALLDHAR TONSE Non Executive & Independent Director Rajesh Kumar Dubey Non Executive & Independent Director Dharmendra Singh Shekhawat Non Executive & Independent Director Swati Gupta Nominee (RBI) Ajay Kumar Non Executive Director Nagaraju Maddirala Managing Director Rama Mohan Rao Amara Managing Director Rana Ashutosh Kumar Singh Registered Office State Bank Bhavan 14th Floor , Madame Cama Road Nariman Point , Maharashtra - 400021 Tel: 91-22-22740841/42/43/44/45/46/47/48 Website: http://www.sbi.co.in Email: investor.complaints@sbi.co.in; gm.snb@sbi.co.in Registrar Office Karvy Selenium Tow-B , 31&32 Financial Dist , Nanakramguda , Hyderabad-500032 Tel: 91-40-67162222 Website: www.kfintech.com Email: einward.ris@kfintech.com Summary State Bank of India was incorporated on 01 July, 1955. The Government of India nationalized the Imperial Bank of India in 1955, with Reserve Bank of India taking a 60% stake, and the name changed to S ... Read More Reports by State Bank of India Annual Report Auditors Reports Management Discussion Directors Report Company FAQs What is the State Bank of India share price today? The State Bank of India shares price on NATIONAL STOCK EXCHANGE (NSE) is ₹953.3 today. What is the Market Cap of State Bank of India? Market capitalization, short for market cap, is the market value of a publicly traded company's outstanding shares. The market cap of State Bank of India is ₹879954.77 Cr. as of 11 Nov ‘25 What is the PE and PB ratio of State Bank of India? The PE and PB ratios of State Bank of India is 12.33 and 1.79 as of 11 Nov ‘25 What is the 52 Week High and Low of State Bank of India? The 52-week high/low is the highest and lowest price at which a State Bank of India stock has traded during that given time period (similar to 1 year) and is considered as a technical indicator. The 52 week high and low of State Bank of India is ₹680 and ₹971.4 as of 11 Nov ‘25 What is the CAGR of State Bank of India? State Bank of India's CAGR for 5 Years at 32.41%, 3 Years at 16.60%, 1 Year at 12.46%, 6 Month at 18.92%, 3 Month at 15.77% and 1 Month at 7.97%. What is the shareholding pattern of State Bank of India? The shareholding pattern of State Bank of India is as follows: Promoters - 55.03 % Institutions - 37.05 % Public - 7.07 % QUICKLINKS FOR State Bank of India Information Share Price Futures Price Option Chain Historical Data Financials Profit & Loss Balance Sheet Cash Flow Key Ratios Results Quarterly Result Half Yearly Result Nine Monthly Result Annual Result News Company Market Share Market Equities Market Map Top Losers Top Gainers BSE NSE Hot Stocks Commodity Global Investing Global Indices Gift Nifty NASDAQ DAX Dow Jones Hang Seng S&P 500 Taiwan Weighted CAC 40 FTSE 100 Nikkei 225 S&P ASX 200 Shanghai Composite US 30 Indian Indices (1-11) Nifty 50 Sensex Nifty small cap 100 Nifty Midcap Select Nifty Smallcap 50 SP BSE Largecap Nifty Smallcap 250 Nifty 100 Liquid 15 Nifty Midcap 50 Nifty50 Value 20 Nifty Financial Services Indian Indices (11-22) Nifty Infrastructure Nifty Energy Nifty IT Nifty Consumption Sp BSE Sensex 50 Index Sp BSE Teck Sp BSE Midcap Select Nifty Private Bank Nifty Healthcare Index Nifty Consumer Durables Nifty 500 Derivatives 1-9 F&O Overview Todays Strategy Roll Over Options Chain Futures Position Build Up Trending F&O Most Active Put-Call Ratio IPO 1-7 IPO Overview IPO FPO Issues Current IPOs Basis Of Allotment Draft Prospectus Recently Listed IPOs Upcoming IPOs Mutual Funds 1-9 Overview Equity Fund Debt Fund Balanced Fund ELSS Fund NFO Updates ETF Fund Houses Dividend Tracker Calculators 1-5 EMI Calculator SIP Calculator PPF Calculator Home Loan EMI Calculator Compound Interest Calculator 6-11 Gratuity Calculator FD Calculator Car Loan EMI Calculator NPS Calculator Personal Loan EMI Calculator RD Calculator 12-16 GST Calculator HRA Calculator Salary Calculator Home Loan Eligibility Calculator EPF Calculator 17-21 Mutual Fund Returns Calculator NSC Calculator Inflation Calculator Retirement Calculator Education Loan EMI Calculator 22-26 Credit Card EMI Calculator Atal Pension Yojana Calculator Online (APY) Calculator Elss Calculator Loan Against Property EMI Calculator Flat Vs Reducing Rate Calculator Nifty 50 1-8 Asian Paints Ltd Britannia Industries Ltd Cipla Ltd Eicher Motors Ltd Nestle India Ltd Grasim Industries Ltd Hero MotoCorp Ltd Hindalco Industries Ltd 9-16 Hindustan Unilever Ltd ITC Ltd Larsen & Toubro Ltd Mahindra & Mahindra Ltd Reliance Industries Ltd Tata Consumer Products Ltd Tata Motors Ltd Tata Steel Ltd 17-23 Wipro Ltd Dr Reddys Laboratories Ltd Titan Company Ltd State Bank of India Bharat Petroleum Corporation Ltd Kotak Mahindra Bank Ltd UPL Ltd 24-31 Infosys Ltd Bajaj Finance Ltd Adani Enterprises Ltd Sun Pharmaceuticals Industries Ltd JSW Steel Ltd HDFC Bank Ltd Tata Consultancy Services Ltd ICICI Bank Ltd 32-39 Power Grid Corporation of India Ltd Maruti Suzuki India Ltd IndusInd Bank Ltd Axis Bank Ltd HCL Technologies Ltd Oil & Natural Gas Corpn Ltd NTPC Ltd Coal India Ltd 40-49 Bharti Airtel Ltd Tech Mahindra Ltd LTIMindtree Ltd Divis Laboratories Ltd Adani Ports & Special Economic Zone Ltd HDFC Life Insurance Company Ltd SBI Life Insurance Company Ltd UltraTech Cement Ltd Bajaj Auto Ltd Bajaj Finserv Ltd Company 1-8 Bank of Baroda Canara Bank Indian Bank Bank of India SBI Cards Union Bank Yes Bank IDFC First Bank 9-16 Delhivery Federal Bank Bandhan Bank Ashok Leyland ICICI Lombard Muthoot Finance Vodafone Idea Dr Lal Pathlabs 17-24 Mankind Pharma Shriram Finance Vedanta Siemens NMDC Torrent Power HDFC AMC Bosch 25-32 Apollo Tyres Adani Power DLF Lupin GAIL MRF Tata Elxsi ICICI Pru Life 33-40 Adani Wilmar Berger Paints Tube Investments Aditya Birla Cap Voltas Indus Towers Bharat Electron Biocon 41-49 Life Insurance Corporation of India Mphasis REC Ltd Varun Beverages Coforge Gujarat Gas United Spirits ACC Jindal Steel Knowledge Center Demat Account What is a Demat Account? How To Open a Demat Account Different Types of Demat Account Know Your Demat Account Number What do DP Charges Mean? What is Tpin in a Demat Account What is Dematerialization and its process? How to Dematerialize Your Physical Share Certificates? How to Transfer Shares From One Demat Account to Another? Difference Between Demat Account and Trading Account Trading Account What is Trading? What is a Trading Account? How to Open a Trading Account Trading Account Opening Fees and Charges Difference Between NRE And NRO Account What is a Simple Moving Average Trading Strategy? 7 reasons why intraday traders lose money in the stock markets What are the benefits of investing in Equity Shares? How to reactivate Trading Account Pre-Market: Explained in Detail Share Market What is Share Market? What are Shares and Types of Shares? Share Market Investment Guide for Beginners How to Invest in the Share Market? Share Market Timings in India LTP in Share Market Difference Between NSDL and CDSL What do Sensex, BSE, NSE, and Nifty Mean? Bank Nifty Options Tips and Strategies How to Buy shares Online in India? Online Share Trading What is Option Trading What is Scalp Trading? What is Swing Trading? Understanding, Advantages and Effective Tactics What Kind of Stocks to Choose for Intraday Trading? What is MTM? What is Derivative Trading? How Does Intraday Trading Works Top 10 Stock Trading Terms You Must Know What is the Timing for Intraday Trading? Eight Rules for Selecting Stocks for Intraday Trading Futures & Options What are Derivatives? What are the different types of Derivatives? What is the Difference Between Call and Put Option? A complete guide to understanding Nifty Option Chain What is F&O Ban List? Options: What is ATM, ITM, OTM? How to Trade in Futures and Options? What are Swaps? Difference Between Forward And Futures Contract What is Max Pain? News Top News Banks Budget Business Companies Currency Earnings Economy Editor's Choice FMCG Gold Inflation Watch International Invest Right IPO Market Merger & Acquisitions Mutual Funds Startups Leader's Speak IIFL Customer Care Number (Gold/NCD/NBFC/Insurance/NPS) 1860-267-3000 / 7039-050-000 IIFL Capital Services Support WhatsApp Number +91 9892691696 Download The App Now Loading... Follow us on 2025 , IIFL Capital Services Ltd. All Rights Reserved About IIFL Capital Locate Us Contact Us IIFL Group IIFL Finance IIFL Home Finance Products & Services Open Demat Account Become a Partner PMS (Portfolio Management Services) AIF (Alternative Investment Funds) Trading Documentation Login to Trade Download TT Download Forms Document & Info Investor Charter for Stock Broker Investor Charter for Depository Participant Information contained in links to the Investor Charter SCORES SCORES 2.0 Process Flow Smart ODR Useful Links Budget Glossary KARVY Customer Podcast Webinars Mandatory Display of Information Public Notice of Non-Association & Awareness Statement on Sanjiv Bhasin Sitemap For Investors NSDL eVoting CSDL eVoting Client Collateral Details (NSE) Investor Education | BSE Client Collateral Details (NCDEX) Client Collateral Details (MCX) SEBI Investor Collateral Placed with IIFL Capital (BSE Plus) Centralized mechanism for reporting the demise of an investor through KRAs (SOP) Disclaimer | Research Disclaimer | Twitter Disclaimer | Advertisement Disclaimer | Terms & Conditions | Privacy Policy | CSR Policy | Mutual Fund Disclaimer ATTENTION INVESTORS RISK DISCLOSURE ON DERIVATIVES Copyright © IIFL Capital Services Limited (Formerly known as IIFL Securities Ltd). All rights Reserved. IIFL Capital Services Limited - Stock Broker SEBI Regn. No: INZ000164132, PMS SEBI Regn. No: INP000002213,IA SEBI Regn. No: INA000000623, SEBI RA Regn. No: INH000000248, DP SEBI Reg. No. IN-DP-185-2016, BSE Enlistment Number (RA): 5016 ARN NO : 47791 (AMFI Registered Mutual Fund Distributor) We are ISO 27001:2013 Certified. This Certificate Demonstrates That IIFL As An Organization Has Defined And Put In Place Best-Practice Information Security Processes."
  },
  {
    "url": "https://www.pymnts.com/news/international/2024/city-of-london-seeks-boost-competitiveness-foreign-investment/",
    "url_mobile": "",
    "title": "London Seeks to Boost Competitiveness , Foreign Investment",
    "seendate": "20240522T220000Z",
    "socialimage": "https://www.pymnts.com/wp-content/uploads/2024/05/London-UK.jpg",
    "domain": "pymnts.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "City of London Seeks to Boost Competitiveness, Foreign Investment By PYMNTS | May 22, 2024 | The City of London , the administrator of the financial district of the United Kingdom, is reportedly grappling with concerns about the district’s competitiveness and the need for foreign investment. Get the Full Story Complete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required. yes Subscribe to our daily newsletter, PYMNTS Today. By completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions . Δ The city’s policy leader, Chris Hayward , emphasized the importance of attracting foreign investment to boost growth and enhance the financial sector’s global competitiveness while addressing the House of Lords ’ financial services regulation committee Wednesday (May 22), Reuters reported Wednesday. However, Hayward argued that the current regulatory mindset lacks the characteristics necessary to achieve these goals , according to the report . The financial sector has faced challenges since the U.K. departed from the European Union and has seen U.K. companies considering listing in New York instead , the report said . Hayward said the current regulatory mindset is hindering growth and the financial sector’s international competitiveness , per the report . He said regulators, particularly the Financial Conduct Authority (FCA), have not fully embraced risk-taking and growth promotion. To address this issue, Hayward suggested the establishment of a new public-private body that can actively attract foreign investment. Recognizing the need for change , the FCA and the Bank of England ’s Prudential Regulation Authority have been given a secondary objective of aiding growth and the financial sector’s international competitiveness when formulating rules, according to the report. However, skepticism remains about the effectiveness of this approach. Advertisement: Scroll to Continue Hayward emphasized that the new remit alone is insufficient to boost inward investment and growth. He advocated for the creation of a dedicated promotional body to enhance the U.K.’s competitiveness compared to countries like Ireland, the report said. Hayward asserted that parliamentary backing is essential to support regulators in accepting more risk, arguing that the fear of retribution when things go wrong often hinders regulators from taking necessary risks, per the report. The debate surrounding the FCA’s “naming and shaming” plans — under which the financial watchdog would publicly disclose companies under investigation — highlights the importance of clarity in regulators’ statutory duties, according to the report. Committee member Jonathan Hill suggested that regulators should distinguish between their obligations and discretionary actions that may impede growth and competitiveness , per the report . Recommended Juspay Offers Brazilian Merchants Plug-and-Play Integration of Mastercard’s Click to Pay Hackers Use AI to Supercharge Social Engineering Attacks Crypto.com Seeks National Trust Bank Charter to Support Its Custody Services 14,000 Open Banking Rule Comments Highlight Deep Divides Over Privacy and Access See More In: City of London , Financial Conduct Authority , Government , international , london , News , PYMNTS News , regulations , uk , What's Hot"
  },
  {
    "url": "https://www.marketscreener.com/news/latest/YELLEN-ACTIONS-BY-GLOBAL-FINANCIAL-SECTOR-ARE-HELPING-TO-FRUSTR--46780457/",
    "url_mobile": "",
    "title": "Yellen : Actions By Global Financial Sector Are Helping To Frustr … ",
    "seendate": "20240521T071500Z",
    "socialimage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
    "domain": "marketscreener.com",
    "language": "English",
    "sourcecountry": "",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Yellen: Actions By Global Financial Sector Are Helping To Frustr… Published on 05/21/2024 at 02:33 am EDT Reuters Share YELLEN: ACTIONS BY GLOBAL FINANCIAL SECTOR ARE HELPING TO FRUSTRATE RUSSIA'S ABILITY TO PROCURE BATTLEFIELD GOODS © Reuters - 2024 Share"
  },
  {
    "url": "https://www.cnbc.com/2024/05/20/investor-bill-nygren-likes-financials-here-are-his-largest-positions.html",
    "url_mobile": "",
    "title": "Value investor Bill Nygren thinks financials are cheap . These are his top holdings",
    "seendate": "20240520T104500Z",
    "socialimage": "https://image.cnbcfm.com/api/v1/image/107263660-1696877081450-bill2.jpg?v=1696877110",
    "domain": "cnbc.com",
    "language": "English",
    "sourcecountry": "United States",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Skip Navigation Markets Business Investing Tech Politics Video Watchlist Investing Club PRO Livestream Menu Don't overlook the financial sector as the stock market trends higher, according to Oakmark Funds portfolio manager and noted value investor Bill Nygren. The Dow Jones Industrial Average closed above 40,000 for the first time on Friday, while both the Nasdaq Composite and S & P 500 entered Monday after four-week-long rallies. After a dreary April, all three indexes are now higher in the second quarter. Despite the financial sector outperforming the broader market, banking and consumer finance stocks are cheaper compared to all S & P 500 companies, according to Nygren. The Financial Select Sector SPDR Fund (XLF) , which tracks the S & P 500 financials index, has returned 12.6% in 2024, including reinvested dividends, while the S & P 500 has returned less than 11.8%. \"[W]e have just under 20% of our portfolio in banks and consumer finance companies, and they average about eight and a half times estimated earnings next year, relative to 20 something for the S & P,\" Nygren told CNBC's \" Squawk on the Street \" on Friday. \"I still think that's really, really cheap.\" His portfolio's top holdings include some of the country's largest banks, such as Citigroup and Wells Fargo , as well as regional banks including First Citizens . Here is a list of Nygren's top holdings by portfolio weight. \"[I]n the regulatory environment they're in now, [banks] are holding significantly more capital that brings down [returns on equity] a little bit and investors have severely punished them for that,\" Nygren said. \"But we think what they haven't done is offset that by saying these banks aren't as risky as they used to be because they have so much capital.\" AI stocks have been hit recently. Why this investor suggests buying the dip on Alphabet and other hyperscalers Pia Singh Defense spending isn't going away any time soon. This stock on our list has a pristine chart Josh Brown Jim Chanos unwinds Strategy short as stock’s bitcoin premium collapses after 50% sell-off Yun Li Read More"
  },
  {
    "url": "https://mumbrella.com.au/the-dubs-agency-strengthens-asia-presence-with-gm-appointment-for-singapore-office-831707",
    "url_mobile": "https://mumbrella.com.au/the-dubs-agency-strengthens-asia-presence-with-gm-appointment-for-singapore-office-831707/amp",
    "title": "The Dubs Agency strengthens Asia presence with GM appointment for Singapore office",
    "seendate": "20240515T021500Z",
    "socialimage": "https://mumbrella.com.au/wp-content/uploads/2024/05/JackieT-profile-1-e1715737190314.jpg",
    "domain": "mumbrella.com.au",
    "language": "English",
    "sourcecountry": "Australia",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Australian-based agency The Dubs Agency is growing in the Asian market, having appointed a general manager – Jackie They – for its Singapore office. The announcement: Be a member to keep reading Join Mumbrella Pro to access the Mumbrella archive and read our premium analysis of everything under the media and marketing umbrella. Become a member Topics Jackie They Josh Frith The Dubs Agency Latest Menulog shuts down Australian operation 8 Things We Learned From Buzzfeed's Disastrous Financial Results ARN prepares investors for 27% earnings plummet Federal Group makes marketing exec redundant while on maternity leave TEG appoints iProspect as media agency after eight-year run with Zenith"
  },
  {
    "url": "https://www.gulf-times.com/article/682247/business/commercial-bank-wins-best-mobile-banking-app-best-remittance-service-awards-in-middle-east",
    "url_mobile": "https://www.gulf-times.com/article/682247/business/commercial-bank-wins-best-mobile-banking-app-best-remittance-service-awards-in-middle-east/amp",
    "title": "Commercial Bank wins  Best Mobile Banking App ,  Best Remittance Service  awards in Middle East",
    "seendate": "20240511T181500Z",
    "socialimage": "https://www.gulf-times.com/gulftimes/uploads/images/2024/05/11/thumbs/300x300/174334.jpg",
    "domain": "gulf-times.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "Commercial Bank, a leader in innovative digital banking solutions in Qatar, has announced achieving two prestigious MEED – Mena Banking Awards 2024 in the Middle East. The bank was recognised on a regional level in two categories: ‘Best Mobile Banking App’ and ‘Best Remittance Service’. Senior executives from Commercial Bank attended the Mena Banking Awarding ceremony held at Kempinski the Boulevard, Dubai, recently accepting these esteemed accolades. The MEED – Mena Banking Awards 2024 recognises excellence and innovation across the Middle East and North Africa region, making Commercial Bank's dual achievement a testament to its unrivalled performance and groundbreaking contributions to the regional banking landscape. Commercial Bank's success in both categories underscores its steadfast commitment to pioneering digital solutions and delivering unmatched customer experiences. The \"reimagined\" CBQ Mobile App has redefined mobile banking, establishing new benchmarks by providing customers with a seamless, secure, and user-friendly platform to manage their finances effortlessly. Moreover, the accolade for the ‘Best Remittance Service' recognises the Bank's innovative 60-second remittance proposition, which has revolutionised the industry with its remarkable speed and efficiency. This prestigious recognition reaffirms the bank's unwavering dedication to reshaping the remittance landscape and delivering unparalleled service excellence. Joseph Abraham, Group CEO, Commercial Bank, said, “We are pleased to receive these prestigious MEED – Mena Banking Awards, which reaffirm Commercial Bank's commitment to delivering cutting-edge digital banking solutions. This recognition underscores our dedication to providing our customers with innovative and convenient banking experiences.\" Expressing delight at the awards, Shahnawaz Rashid, Commercial Bank’s executive general manager and head (Retail Banking), reaffirmed the bank's commitment to enhancing its services to provide an outstanding customer experience saying, \"Being recognized for Best Mobile Banking App and Best Remittance Service at the MEED – Mena Banking Awards is a testament to the hard work and innovation of our team. These awards reflect our relentless focus on enhancing customer experience and delivering market-leading digital banking solutions, setting new standards of excellence.\""
  },
  {
    "url": "https://www.nyasatimes.com/super-innovative-fdh-bank-launches-islamic-sharia-law-banking-facility-for-muslim-customers/",
    "url_mobile": "",
    "title": "Super Innovative ! FDH Bank launches Islamic Sharia Law banking facility for Muslim customers",
    "seendate": "20240502T200000Z",
    "socialimage": "https://www.nyasatimes.com/wp-content/uploads/FB_IMG_1714557655929.jpg",
    "domain": "nyasatimes.com",
    "language": "English",
    "sourcecountry": "Malawi",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "banking",
    "article_text": "FDH Bank has launched an Islamic Sharia Law banking facility to cater for Muslim customers called FDH Salama Banking solution. FDH Bank becomes the first bank to introduce the banking facility in the country. The Salama Banking solution was launched on Tuesday in Blantyre. Operating under the principles of Sharia law, Islamic banking emphasizes profit and loss sharing while prohibiting interest payments. FDH Bank managing director Noel Mkulichi emphasized that the launch of FDH Salama Banking is a crucial step in their strategic growth plans citing the initiative aims to cater to a previously underserved community within the local banking sector. Mkulichi highlighted that FDH Salama Banking is designed not only for Muslims but for anyone seeking an alternative banking experience. On his part, Sheikh Ibrahim Lethome Asmani, chairman of the Sharia Advisory Council of FDH Salama Banking, emphasized the importance of maintaining compliance with Sharia laws. Meanwhile, the initial transactions the bank is processing include deposit accounts, with plans to expand the portfolio. FDH Salama Banking will operate in Limbe, City Center in Lilongwe, and Mangochi in the eastern region, establishing itself as a Sharia-compliant bank. Follow and Subscribe Nyasa TV :"
  },
  {
    "url": "https://www.thedailystar.net/opinion/editorial/news/perplexing-decision-bangladesh-bank-3597306",
    "url_mobile": "https://www.thedailystar.net/opinion/editorial/news/perplexing-decision-bangladesh-bank-3597306?amp",
    "title": "A perplexing decision by Bangladesh Bank",
    "seendate": "20240428T120000Z",
    "socialimage": "",
    "domain": "thedailystar.net",
    "language": "English",
    "sourcecountry": "Bangladesh",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Editorial Editorial A perplexing decision by Bangladesh Bank Sun Apr 28, 2024 03:30 PM Last update on: Sun Apr 28, 2024 03:30 PM Who will gain from its restrictions on media access? Sun Apr 28, 2024 03:30 PM Last update on: Sun Apr 28, 2024 03:30 PM VISUAL: STAR The recent restrictions placed on journalists' access to the Bangladesh Bank (BB) have evoked understandable criticism from the journalist community as well as from Transparency International Bangladesh (TIB). It is quite a perplexing decision coming from a public institution which, by definition, is supposed to serve public interests. The media, too, is morally mandated to serve public interests. This it does by disclosing finance and banking related information, including any irregularities allegedly taking place in the sector. Access into Bangladesh Bank is thus crucial for any journalist covering the sector. We are, therefore, quite alarmed that the BB could take such a restrictive measure. The central bank has reportedly instructed its security management and other departments not to allow journalists to enter its offices. The unprecedented restriction means that journalists covering the economy and finance will not be able to properly cover issues related to the economy. This is a disservice to the public but also to the government, which needs an honest appraisal of what is happening at the BB to make proper and timely interventions. Such reporting is all the more necessary at a time when the financial sector is facing severe challenges, including various irregularities, high inflation, and a dollar crisis that has affected many businesses and consumers. For all latest news, follow The Daily Star's Google News channel. Read more How tough can Bangladesh Bank be with wilful defaulters? Thus, journalists covering the economy and financial sector need full and unrestricted access to the Bangladesh Bank in order to get correct and verified information. Bangladesh Bank itself should also want to be accessible so that there is minimal risk of misinformation or rumours being circulated. All this makes its aforementioned decision rather difficult to understand. The message emanating from such restrictions is not the kind that a democratic government would want to send to the people. It gives off the impression that this is being done to protect the interests of certain powerful quarters that have been playing a major role in the irregularities of the financial sector. We, therefore, urge Bangladesh Bank authorities to remove these restrictions so that journalists can have free access to the central bank as they did before. By exposing anomalies in the financial sector, journalists are upholding the people's right to know and helping the government by providing insights into this crucial sector so that problems are identified and solutions can be developed and applied. Surely this is a win-win system for all parties. Related topic: Bangladesh Bank media restrictions corruption in public sector press freedom in bangladesh investigative journalism Click to comment Comments Comments Policy"
  },
  {
    "url": "https://www.thejakartapost.com/opinion/2024/04/26/the-benefit-of-public-private-partnership-financial-sector-cybersecurity.html",
    "url_mobile": "",
    "title": "The benefit of public - private partnership : Financial sector cybersecurity - Academia",
    "seendate": "20240426T014500Z",
    "socialimage": "https://img.jakpost.net/c/2023/05/21/2023_05_21_138585_1684678692._large.jpg",
    "domain": "thejakartapost.com",
    "language": "English",
    "sourcecountry": "Indonesia",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "TheJakartaPost Please Update your browser Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below. Just click on the icons to get to the download page. press enter to search LOG IN / REGISTER Multimedia Index Video Photo Travel Index News Destinations Jakpost Guide to Sports Newsletter New Mobile Apps Images Affiliated Organizations Tenggara Strategics B/NDL Studios Magdalene Subscribe LOGIN Search Close Popular Reads Agriculture at the heart of security The world hails Bandung, but Indonesia forgets Limited options for pushing GDP ‘Betraying reformasi’: Survivors of human rights cases oppose plan to name Soeharto hero Toyota, Pertamina to build $155m bioethanol plant in Lampung: Ministry Top Results No results found. Please check your search term and try again Can't find what you're looking for? View all search results LOGIN LOG IN / REGISTER Subscribe Home NEWS PULSE MULTIMEDIA Indonesia Index Politics Jakarta Society Archipelago Business Index Economy Tech Companies Regulations Markets World Index Asia & Pacific Americas Europe Middle East & Africa OPINION Index Editorial Commentary Insight Analysis The Brief Academia Interview Podcast CULTURE Index Lifestyle Entertainment Arts & Culture Technology People Health Parenting Food Books Environment Work it Right DEEPDIVE Front Row Index Quick Dispatch Longform Biz New The Weekender E-Post more Multimedia Index Video Photo Travel Index News Destinations Jakpost Guide to Sports Newsletter Mobile Apps Images Affiliated Organizations Tenggara Strategics B/NDL Studios Magdalene Search Close Popular Reads Agriculture at the heart of security The world hails Bandung, but Indonesia forgets Limited options for pushing GDP ‘Betraying reformasi’: Survivors of human rights cases oppose plan to name Soeharto hero Toyota, Pertamina to build $155m bioethanol plant in Lampung: Ministry Top Results No results found. Please check your search term and try again Can't find what you're looking for? View all search results Opinion Academia The benefit of public-private partnership: Financial sector cybersecurity The Indonesian cybersecurity index scored 63.64, placing it 48th, below the average value of the world cybersecurity index. Calvin Lucky Krisnadi (The Jakarta Post) Premium Jakarta Fri, April 26, 2024 Published on Apr. 22, 2024 Published on 2024-04-22T21:07:53+07:00 Share this article Facebook WhatApp X LinkedIn Telegram Email http://www.thejakartapost.com/opinion/2024/04/26/the-benefit-of-public-private-partnership-financial-sector-cybersecurity.html Copy Link Gift Full Article Change text size A A A Gift Full Article Gift Premium Articles to Anyone Share the best of The Jakarta Post with friends, family, or colleagues. As a subscriber, you can gift 3 to 5 articles each month that anyone can read—no subscription needed! Log in Subscribe Cashing in: A customer of Bank Syariah Indonesia (BSI) withdraws cash at an ATM in Meulaboh, West Aceh regency, Aceh, on May 14, 2023. The bank’s president director Hery Gunardi said the bank’s services had resumed after a series of cyberattacks from May 8 to May 11. (Antara/Syifa Yulinnas) C ybersecurity has become a major concern for the global financial sector, especially for the banking and payment system industries. Based on data from Checkpoint Research in 2022, there were 1,131 cyberattacks targeting the banking and financial sector globally, with estimated losses amounting to around US$100 billion. According to the National Cyber and Crypto Agency (BSSN), in 2023 there were 361 million cyberattacks in Indonesia, with Rp 14.5 trillion ($906 million) recorded as financial losses from such activities. Financial loss is not the only consequence of those cyberattacks; data leaks and disruption of key business services also have a major impact. Indonesia is currently laying the groundwork for the digital economy transformation and needs to foster collaboration between the government and the private sector to support the acceleration in building cybersecurity infrastructure capability. The government, through the issuance of Presidential Regulation No. 38/2015, has introduced the public-private partnership (PPP) legal framework, to provide high quality, effective and efficient infrastructure and also create a better investment environment that will be a win-win solution for the government, private sector and people. Based on the regulation, information technology (IT) infrastructure is one of the types of infrastructure that could be part of a PPP scheme. The Financial Services Authority (OJK) has also issued two regulations regarding cybersecurity in the financial sector. The first is OJK Circular Letter No. 29/2022, and the second is OJK Regulation No. 22/2023, which regulates that all banks and non-bank institutions should maintain and enhance their cybersecurity capabilities to ensure the implementation of cybersecurity principles. Viewpoint Every Thursday Whether you're looking to broaden your horizons or stay informed on the latest developments, \"Viewpoint\" is the perfect source for anyone seeking to engage with the issues that matter most. View More Newsletter By registering, you agree with The Jakarta Post 's Privacy Policy Sign Up Thank You for signing up our newsletter! Please check your email for your newsletter subscription. View More Newsletter Bank Indonesia (BI) as the regulator for payment systems and the macroprudential industry also stipulates the same obligations in BI Regulation No. 22/2020, which requires all providers of payment service systems and the operators of the infrastructure of payment services to maintain and enhance their cybersecurity capabilities. Popular Agriculture at the heart of security The world hails Bandung, but Indonesia forgets Limited options for pushing GDP Related Articles Time to rethink what we mean by responsible investing China vows to raise household consumption 'significantly' OJK warns local banks to tighten risk controls amid govt injection As media trust crumbles, online buzz booms in Japan The IPO question: Fostering competition through regulatory reforms Related Article Time to rethink what we mean by responsible investing China vows to raise household consumption 'significantly' OJK warns local banks to tighten risk controls amid govt injection As media trust crumbles, online buzz booms in Japan The IPO question: Fostering competition through regulatory reforms Popular Agriculture at the heart of security The world hails Bandung, but Indonesia forgets Limited options for pushing GDP More in Opinion View more Academia Why climate finance is not enough Academia ‘Nobody’s Girl’, sexual violence, Virginia Giuffre and ‘santriwati’ Academia Democracy doesn’t need heroes Highlight Regulations Investors hold back as Nusantara plans scaled down Editorial Lawmakers’ ethics crisis Politics Positive online sentiment greets Soeharto’s national hero title The Latest View more Academia Why climate finance is not enough Society Always on call: How firefighters won the public’s heart Archipelago Measles outbreaks kill one in Pekanbaru, 20 in Sumenep Politics Police reform team begins work amid skepticism Academia Democracy doesn’t need heroes Opinion Analysis: Prabowo's national car: Industrial renaissance or personal ambition? Politics Positive online sentiment greets Soeharto’s national hero title Society ‘Greenwashing’ concerns raised as Indonesia offers carbon trade at COP30 Get the latest news in your inbox News Business Politics World Indonesia Jakarta Opinion Academia Commentary Insight Analysis Interview Travel News Destinations Jakpost Guide To Multimedia Video Photo Deep Dive Podcast Culture Lifestyle Entertainment Art & Culture Technology People Health Parents Books More Today's Paper Jobs TJP Images Community Youth News Opinion Travel Multimedia Life Today's Paper Jobs TJP Images Community Southeast Asia Masthead Cyber Media Guidelines Contact Advertise Paper Subscription Privacy Policy Discussion Guideline Term of Use © 2016 - 2025 PT. Bina Media Tenggara to Read Full Story Subscribe Now Starting from IDR 70,000/month Unlimited access to our web and app content e-Post daily digital newspaper No advertisements, no interruptions Privileged access to our events and programs Subscription to our newsletters or Purchase access to this article for IDR 35,000 only We accept Register Already subscribed? Log in Redirecting you to payment page Pay per article The benefit of public-private partnership: Financial sector cybersecurity Rp 35,000 / article 1 Account Get started by logging in or creating your account Email Change Email Password Continue By proceeding, you consent to the revised Terms of Use , and Privacy Policy . Or continue login with Don't have an account? Register here Create your free account Name Email Password Continue By proceeding, you consent to the revised Terms of Use , and Privacy Policy . Already have an account? Login here 2 Shipping Address Street State Postal Code City Country (package only in indonesia) Phone Continue Palmerat Barat No. 142-143 Central Jakarta DKI Jakarta Indonesia 10270 +6283816779933 Change 2 Payment Methods QRIS / GoPay PayPal Credit Card BCA / Mandiri / BNI Virtual Account Total Rp 35,000 Pay Now Cancel Feedback Your Opinion Matters Share your experiences, suggestions, and any issues you've encountered on The Jakarta Post. We're here to listen. Let us know what you think: Enter at least 30 characters 0 / 30 Submit Thank You Thank you for sharing your thoughts. We appreciate your feedback. Ok Share options Quickly share this news with your network—keep everyone informed with just a single click! Copy Link Facebook WhatsApp Twitter LinkedIn Telegram Email Gift full article Change text size options Customize your reading experience by adjusting the text size to small, medium, or large—find what’s most comfortable for you. A Small A Medium A Large Gift Premium Articles to Anyone Share the best of The Jakarta Post with friends, family, or colleagues. As a subscriber, you can gift 3 to 5 articles each month that anyone can read—no subscription needed! Log in Subscribe Continue in the app Get the best experience—faster access, exclusive features, and a seamless way to stay updated. Stay on Web Open App"
  },
  {
    "url": "https://www.bizcommunity.com/article/sa-introduces-novel-bank-deposit-insurance-scheme-231037a",
    "url_mobile": "",
    "title": "SA introduces novel bank deposit insurance scheme",
    "seendate": "20240425T133000Z",
    "socialimage": "https://biz-file.com/c/2404/735374-1200x624.jpg?5",
    "domain": "bizcommunity.com",
    "language": "English",
    "sourcecountry": "South Africa",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "#Orchids&Onions: SAB drives a hard message home, KFC does ESG right Brendan Seery"
  },
  {
    "url": "https://menafn.com/1108134757/Qatar-Central-Bank-Issues-Digital-Insurer-Regulations",
    "url_mobile": "",
    "title": "Qatar Central Bank Issues Digital Insurer Regulations",
    "seendate": "20240424T194500Z",
    "socialimage": "https://menafn.com/updates/pr/2024-04/24/TP_085f5image_story.jpg",
    "domain": "menafn.com",
    "language": "English",
    "sourcecountry": "Qatar",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Severe Storm Cause Widespread Damage On Greece's Northeast Islands"
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Domestic-capital-market-still-a-viable-source-of-funding-Kobby-Bentsi-Enchill-1927251",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Domestic-capital-market-still-a-viable-source-of-funding-Kobby-Bentsi-Enchill-1927251",
    "title": "Domestic capital market still a viable source of funding – Kobby Bentsi - Enchill",
    "seendate": "20240422T224500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/865/86540815.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 04 22 → Article 1927251 Business News of Monday, 22 April 2024 Disclaimer Source: Stanbic Bank 2024-04-22 Domestic capital market still a viable source of funding – Kobby Bentsi-Enchill « Prev Next » Comments (0) Listen to Article Share: Kobby Bentsi-Enchill, Head, Investment Banking, Stanbic Bank Ghana The Head of Investment Banking at Stanbic Bank Ghana, Kobby Bentsi-Enchill, has emphasized the importance of the domestic capital market as a viable and sustainable source of funding for businesses. Mr. Bentsi-Enchill said this at the issuance of Letshego’s newly established and expanded GHS 500 million bond programme at the Ghana Stock Exchange. Speaking on the impressive performance of Letshego’s issuance, in which Stanbic Bank acted as joint arranger, Mr. Bentsi-Enchill stated “Despite the prevailing macroeconomic conditions prevailing at the time of issuance, characterized by a heightened interest rate environment, the offer garnered an impressive response from a diverse spectrum of investors. This resounding success reaffirms Letshego Ghana’s standing as a trusted and reliable corporate bond issuer within the Ghanaian debt capital markets. It also underscores the growing significance of domestic capital markets as a viable alternative funding avenue for corporate entities.” He added that “The competitive pricing achieved in both series at a time when interest rates on traditional commercial credit facilities hovered around an average of 35% is a further testament that the domestic capital markets remain a viable and sustainable funding avenue that businesses should critically explore in their pursuit of funding alternatives.” Mr. Bentsi-Enchill further underscored the importance of trust and integrity in building a robust financial sector in the country. According to him, “As financial sector players, let us reaffirm our commitment to upholding the values of trust, integrity, and excellence that underpin our industry. Together, we will continue to build a resilient and prosperous financial sector for the benefit of all and call on well-meaning giants of corporate Ghana to look to the capital markets to augment their funding needs including working capital requirements.” Letshego Ghana’s Dual Offer achieved tremendous success, which saw the Issuer raise a 2-year fixed rate note at a competitive pricing of 22 percent and a 4-year floating rate note at a 182-day treasury bill plus a premium of 1 percent. These two issuances represent the first and second series of notes issued under the newly established and expanded GHS 500 million Medium Term Notes Programme, marking Letshego Ghana’s return to the debt capital market for funding since 2021. Comments: This article has no comments yet, be the first to comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.ghanaweb.com/GhanaHomePage/business/Domestic-capital-market-still-a-viable-source-of-funding-Kobby-Bentsi-Enchill-1926870",
    "url_mobile": "https://mobile.ghanaweb.com/GhanaHomePage/business/Domestic-capital-market-still-a-viable-source-of-funding-Kobby-Bentsi-Enchill-1926870",
    "title": "Domestic capital market still a viable source of funding – Kobby Bentsi - Enchill",
    "seendate": "20240419T224500Z",
    "socialimage": "https://cdn.ghanaweb.com/imagelib/pics/709/70910891.jpg",
    "domain": "ghanaweb.com",
    "language": "English",
    "sourcecountry": "Ghana",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Welcome, Sign in to continue x SIGN IN New here? Create an account Forgot password? Welcome, Sign in to continue x RESET PASSWORD Already have an account? Sign in Hello, Sign up to get started Terms and conditions The following terms and conditions apply if you want to submit content (articles, photos, adverts, etc.) to GhanaWeb: You are only allowed to submit content which you have created yourself. You are not allowed to upload photos from another person pretending it is you. No nudity, pornography and any unlawful content is permitted. You grant GhanaWeb the right to publish and use your content. You allow GhanaWeb to communicate with you using the info you provide. GhanaWeb reserves the right to reject/remove your content without explanation. x REGISTER Already have an account? Sign in Surname Other names Email Phone Select your date of birth Gender Select Option Male Female Do you accept the terms? No, I reject the terms for becoming a GhanaWeb member. Yes, I accept the terms for becoming a GhanaWeb member. By continuing, you agree to the Terms & Privacy Policy Self Service Advert Sitemap Partners About Us Sign up Login Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoons Say It Loud Country Home - Business Business Archive Business | TV Year In Review Business Headlines Business Blogs BizTech | TV Business Directory More Bank Of Ghana Ghana Stock Exchange Budget - Archive Tax Trade Exchange Rate Stock Exchange (GSE) Business You are here: Home → Business → 2024 04 19 → Article 1926870 Business News of Friday, 19 April 2024 Disclaimer Source: Stanbic Bank 2024-04-19 Domestic capital market still a viable source of funding – Kobby Bentsi-Enchill « Prev Next » Comments (1) Listen to Article Share: Stanbic Bank Ghana The Head of Investment Banking at Stanbic Bank Ghana, Kobby Bentsi-Enchill, has emphasized the importance of the domestic capital market as a viable and sustainable source of funding for businesses. Mr. Bentsi-Enchill said this at the issuance of Letshego’s newly established and expanded GHS 500 million bond programme at the Ghana Stock Exchange. Speaking on the impressive performance of Letshego’s issuance, in which Stanbic Bank acted as joint arranger, Mr. Bentsi-Enchill stated “Despite the prevailing macroeconomic conditions prevailing at the time of issuance, characterized by a heightened interest rate environment, the offer garnered an impressive response from a diverse spectrum of investors. This resounding success reaffirms Letshego Ghana’s standing as a trusted and reliable corporate bond issuer within the Ghanaian debt capital markets. It also underscores the growing significance of domestic capital markets as a viable alternative funding avenue for corporate entities.” He added “The competitive pricing achieved in both series at a time when interest rates on traditional commercial credit facilities hovered around an average of 35% is a further testament that the domestic capital markets remain a viable and sustainable funding avenue that businesses should critically explore in their pursuit of funding alternatives.” Mr. Bentsi-Enchill further underscored the importance of trust and integrity in building a robust financial sector in the country. According to him, “As financial sector players, let us reaffirm our commitment to upholding the values of trust, integrity, and excellence that underpin our industry. Together, we will continue to build a resilient and prosperous financial sector for the benefit of all and call on well-meaning giants of corporate Ghana to look to the capital markets to augment their funding needs including working capital requirements.” Letshego Ghana’s Dual Offer achieved tremendous success, which saw the Issuer raise a 2-year fixed rate note at competitive pricing of 22 percent and a 4-year floating rate note at an 182-day treasury bill plus a premium of 1 percent. These two issuances represent the first and second series of notes issued under the newly established and expanded GHS 500 million Medium Term Notes Programme, marking Letshego Ghana’s return to the debt capital market for funding since 2021. Comments: This article has 1 comment(s) , give your comment News Martin Amidur accuses OSP of being 'pathologically dishonest' and unfit for office Sports African World Cup 2026 qualifiers playoffs: Squads, teams and start time Entertainment Squid Game star acquitted of sexual misconduct Africa Ghana's Asante king welcomes return of artefacts from the UK and South Africa Opinions Encroachment threatens emergency access road in Darkuman Navigation Links Home News Sports Business Entertainment Africa GhanaWeb TV Opinions Cartoon Say It loud Useful links About Us Advertising FAQ Sitemap Privacy Policy Download Our App Copyright © 1994 - 2025 GhanaWeb. All rights reserved."
  },
  {
    "url": "https://www.crowdfundinsider.com/2024/04/223826-cyberattacks-have-more-than-doubled-since-start-of-covid-19-outbreak-research-report/",
    "url_mobile": "",
    "title": "Cyberattacks Have More Than Doubled Since Start Of COVID - 19 Outbreak - Research Report",
    "seendate": "20240415T044500Z",
    "socialimage": "https://www.crowdfundinsider.com/wp-content/uploads/2019/01/Dark-Web-Dark-Net-Danger-Beware-Money.jpg",
    "domain": "crowdfundinsider.com",
    "language": "English",
    "sourcecountry": "United Kingdom",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Cyberattacks have more than doubled since the pandemic, according to a recent update shared by the International Monetary Fund (IMF) . While companies have historically suffered relatively modest direct losses from cyberattacks, some have “experienced a much heavier toll,” the IMF report notes. US credit reporting agency Equifax, for example, paid “more than $1 billion in penalties after a major data breach in 2017 that affected about 150 million consumers.” As the IMF shows in a chapter of the April 2024 Global Financial Stability Report, the risk of extreme losses “from cyber incidents is increasing.” According to IMF’s blog post, such losses could potentially “cause funding problems for companies and even jeopardize their solvency.” The size of these extreme losses “has more than quadrupled since 2017 to $2.5 billion. And indirect losses like reputational damage or security upgrades are substantially higher.” The IMF report also mentioned that the financial sector “is uniquely exposed to cyber risk.” Financial firms—given the large amounts of sensitive data and transactions they handle—are often “targeted by criminals seeking to steal money or disrupt economic activity.” Attacks on financial firms “account for nearly one-fifth of the total, of which banks are the most exposed.” Incidents in the financial sector “could threaten financial and economic stability if they erode confidence in the financial system, disrupt critical services, or cause spillovers to other institutions.” For example, a severe incident “at a financial institution could undermine trust and, in extreme cases, lead to market selloffs or runs on banks.” Although no significant “cyber runs” have occurred thus far, IMF’s analysis “suggests modest and somewhat persistent deposit outflows have occurred at smaller US banks after a cyberattack.” Cyber incidents that disrupt critical services “like payment networks could also severely affect economic activity. For example, a December attack at the Central Bank of Lesotho disrupted the national payment system, preventing transactions by domestic banks.” Another consideration is that financial firms “increasingly rely on third-party IT service providers, and may do so even more with the emerging role of artificial intelligence.” Such external providers can “improve operational resilience, but also expose the financial industry to systemwide shocks.” For example, a 2023 ransomware attack on a cloud IT service provider “caused simultaneous outages at 60 US credit unions.” With the global financial system facing significant and growing cyber risks from increasing digitalization and geopolitical tensions, “as shown in the chapter, policies and governance frameworks at firms must keep pace.” Because private incentives may be insufficient “to address cyber risks—for example, firms may not fully account for the systemwide effects of incidents—public intervention may be necessary.” However, according to an IMF survey of central banks and supervisory authorities, cybersecurity policy frameworks, “especially in emerging market and developing economies, often remain insufficient.” For example, only about half of countries surveyed had “a national, financial sector-focused cybersecurity strategy or dedicated cybersecurity regulations.” To strengthen resilience in the financial sector, authorities “should develop an adequate national cybersecurity strategy accompanied by effective regulation and supervisory capacity that should encompass: Periodically assessing the cybersecurity landscape and identifying potential systemic risks from interconnectedness and concentrations, “including from third-party service providers.” Encouraging cyber “maturity” among financial sector firms, including board-level access to cybersecurity expertise, as “supported by the chapter’s analysis which suggests that better cyber-related governance may reduce cyber risk.” Improving cyber hygiene of firms—that is, “their online security and system health (such as antimalware and multifactor authentication)—and training and awareness.” Prioritizing data reporting and collection of cyber incidents, and “sharing information among financial sector participants to enhance their collective preparedness.” As attacks often emanate from outside “a financial firm’s home country and proceeds can be routed across borders, international cooperation is imperative to address cyber risk successfully.” While cyber incidents will occur, the financial sector “needs the capacity to deliver critical business services during these disruptions.” To this end, financial firms should “develop, and test, response and recovery procedures and national authorities should have effective response protocols and crisis management frameworks in place.” The IMF actively helps member countries “strengthen their cybersecurity frameworks through policy advice, for example as part of the Financial Sector Assessment Program, and through capacity-building activities.” Sponsored Links by DQ Promote X Facebook LinkedIn Truth Pinterest Reddit HackerNews Telegram Weibo Email Print Subscribe Like OpenAI icon ChatGPT Copy Link"
  },
  {
    "url": "https://www.firstpost.com/business/global-financial-institutions-face-rising-cyber-threats-in-a-digital-world-cyber-attacks-cybersecurity-imf-report-sounds-the-alarm-macro-finance-13759234.html",
    "url_mobile": "https://www.firstpost.com/business/global-financial-institutions-face-rising-cyber-threats-in-a-digital-world-cyber-attacks-cybersecurity-imf-report-sounds-the-alarm-macro-finance-13759234.html/amp",
    "title": "Financial institutions face rising cyber threats in a digital world : IMF report sounds the alarm",
    "seendate": "20240413T124500Z",
    "socialimage": "https://images.firstpost.com/uploads/2024/04/Cyber-Crime-Global-Finance-Unsplash-2024-04-93428d4161da844a05595b38e5d93ad5.jpg?im=FitAndFill=(1200,675)",
    "domain": "firstpost.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Trending: PM Modi in Manipur Charlie Kirk killer Sushila Karki IND vs PAK India-US ties New human organ Downton Abbey: The Grand Finale Movie Review Home Business Financial institutions face rising cyber threats in a digital world: IMF report sounds the alarm Financial institutions face rising cyber threats in a digital world: IMF report sounds the alarm Anmol Singla • April 13, 2024, 17:46:56 IST Whatsapp Facebook Twitter A recent IMF report has sounded the alarm on rising cyber threats which are posing serious concerns to financial stability amid digitalisation and heightened geopolitical tensions Advertisement Subscribe Join Us Add as a preferred source on Google Prefer Firstpost On Google An IMF report has revealed that cyberattacks across the globe have more than doubled since the pandemic | Source: Unsplash/Representative A groundbreaking report has revealed that cyber attacks have more than doubled since the pandemic, putting the digitally-transforming global financial sector in the spotlight. The International Monetary Fund (IMF) report titled “Cyber Risk: A Growing Concern for Macrofinancial Stability” paints a concerning picture of the increasing threats posed by cyber incidents to the financial sector. The report highlights how the rise of digitisation, evolving technologies, and growing geopolitical tensions are creating a breeding ground for cyberattacks, potentially jeopardising global financial stability. STORY CONTINUES BELOW THIS AD The report emphasises a surge in cyber incidents, particularly those with malicious intent, over the past two decades. This surge is significantly linked to the financial sector’s growing dependence on digital technologies. More from Business Hyundai India’s Rs 27,870 crore IPO oversubscribed by 2.28X, largely driven by institutional investors How Indian fintech startups are driving Malaysia’s UPI-like digital payments revolution NEW RELEASE: Chapter 3 of our Global Financial Stability Report looks at the increasing risks posed by cyber incidents and their impact on financial stability. Read “Cyber Risk: A Growing Concern for Macrofinancial Stability:” https://t.co/JRcZRDQ0Pg pic.twitter.com/L23jsfeRtF — IMF (@IMFNews) April 13, 2024 According to Major Vineet Kumar, Founder of CyberPeace, a Delhi-based think tank focused on policy-making around cybersecurity, the rise of financial technology (fintech) and digital banking services has significantly increased the attack surface for cybercriminals. While speaking to Firstpost , Kumar points to a recent Reserve Bank of India (RBI) report indicating a surge in card and internet fraud cases in the first quarter of FY24, with total damages reaching a staggering Rs. 630 crore. STORY CONTINUES BELOW THIS AD These digital vulnerabilities are being exploited by cybercriminals to steal sensitive financial information, leading to substantial financial losses. The report warns that severe incidents at major financial institutions could pose a systemic threat, causing a loss of confidence, disruption of critical services, and even spillovers to other institutions due to interconnectedness. The report finds that while cyber incidents have not yet been systemic, the risk of extreme losses for firms – estimated to be at least $2.5 billion – has grown considerably. Moreover, indirect losses tend to be substantially larger than reported direct losses, further amplifying the financial impact. The report also highlights that digitalisation and geopolitical tensions significantly heighten the risk of cyber incidents. Conversely, the analysis suggests that more developed cyber legislation and better cyber governance at firms can help mitigate such risks. International threats demand international cooperation The report underscores the importance of international cooperation in combating cyber threats in the financial sector. Financial crimes like cyberattacks often transcend national borders, making coordinated efforts crucial. STORY CONTINUES BELOW THIS AD A global risk management survey focused on India by financial services firm Aon found that the threat of cyber attacks and data breach were the top risks in the global financial market as well as in India (accounting for 18.3% of the losses incurred). They also found out that this was unlikely to change in the future. Industry experts like Advocate Siddharth Chandrashekhar, who is Standing Counsel for Income Tax at the Central Board of Direct Taxes at the Ministry of Finance, emphasise the need for information sharing, best practices, and resource collaboration to strengthen global cybersecurity defenses. “Coordinated responses to cyber incidents involving multiple countries enhance the effectiveness of mitigation efforts and contribute to the development of international norms and regulations governing cybersecurity,” Chandrashekhar told Firstpost . International cooperation can be particularly effective in responding to cyber incidents involving multiple countries. Collaborative efforts can enhance mitigation strategies and contribute to the development of international norms and regulations governing cybersecurity. STORY CONTINUES BELOW THIS AD India, for instance, participates in various forums like the Financial Stability Board (FSB) and the Asia-Pacific Economic Cooperation (APEC) to foster such collaboration. Countries remain largely unprepared Despite the growing threat, the report finds that many countries, especially emerging economies, are inadequately prepared to tackle cyber risks. The IMF survey of 51 countries revealed that many financial supervisors still lack robust cybersecurity regulations or resources for enforcement. A significant portion of these central banks and supervisory authorities lack: A national cyber strategy for the financial sector. Dedicated cybersecurity or technology risk management regulations. Specialised risk units within their supervision departments. Mandates for testing and exercising cybersecurity measures. Dedicated cyber incident reporting regimes. Cybercrime regulations. The report avers that many financial supervisors still need cyber security regulations or resources for enforcement. The report finds that of these central banks or supervisory authorities, 56% do not have a national cyber strategy for the financial sector, 42% do not have dedicated cyber security or technology risk management regulations, 68% lack a specialized risk unit as part of their supervision department, 64% do not mandate testing and exercising cyber security measures or provide further guidance, 54% lack a dedicated cyber incident reporting regime, and 48% do not have cybercrime regulations. These findings paint a concerning picture of the global financial sector’s overall preparedness for cyberattacks. STORY CONTINUES BELOW THIS AD India’s financial sector: A work in progress India’s financial sector, while experiencing rapid growth, faces significant challenges in dealing with cyber threats. Kumar acknowledges this, pointing out that smaller financial entities may lack the resources and expertise to effectively combat sophisticated cyberattacks. A December 2023 report by the RBI revealed that the Indian financial sector was confronted with more than 13 lakh cyber-attacks between January and October last year. “It is imperative that developing nations like India must establish a more robust mechanism for cyber security than is currently in place,” Kumar told Firstpost . The government, along with relevant agencies like the Ministry of Electronics and Information Technology (MeitY), Reserve Bank of India (RBI), National Payments Corporation of India (NPCI), and the Indian Cyber Crime Coordination Centre (I4C), have taken several measures, including: A meeting in November 2023 by the Department of Financial Services (DFS) under the Ministry of Finance to examine the rising threat of digital financial fraud, attended by representatives from public and private banking institutions. Bringing all financial institutions under the ambit of the Citizen Financial Cyber Fraud Reporting and Management System (CFCFRMS). Renewed focus on facilitating seamless coordination between law enforcement agencies and financial institutions for real-time tracking and blocking of defrauded money. Considering new legislation like the Banning of Unregulated Lending Activities (BULA) Act. India’s policy landscape: Emerging but evolving India’s policy framework to address cybersecurity challenges in the financial sector is gradually taking shape. Experts highlight initiatives like the Digital Personal Data Protection Act, 2023, and the RBI’s cybersecurity framework, which outlines requirements for banks and other financial institutions to establish robust cybersecurity practices. STORY CONTINUES BELOW THIS AD These practices include risk assessment, incident response, and information sharing mechanisms. Additionally, the RBI has introduced initiatives such as the Cyber Security Operations Center (C-SOC) and the Cyber Crisis Management Plan (CCMP) to enhance the resilience of the financial sector against cyber threats. While speaking to Firstpost , Chandrashekhar highlights the importance of the C-SOC as a centralised hub for monitoring and responding to cyber incidents. The CCMP provides a structured approach for managing cybersecurity crises and coordinating response efforts among stakeholders. “India’s financial sector, is still considered to be in its nascent stage as compared to its international counterparts,” added Chandrashekhar. However, the report also cautions that continual adaptation and enforcement of these policies are necessary to effectively mitigate cyber risks and ensure the security and stability of the country’s financial sector. Third-party IT service providers: Strengthening the chain The report emphasises the growing reliance of financial institutions on third-party IT service providers. These dependencies introduce additional vulnerabilities, as a cyberattack on a single service provider could potentially impact multiple financial institutions. The report recommends that third-party IT service providers prioritise robust cybersecurity measures. This includes implementing strong encryption protocols, conducting regular security audits, and adhering to best practices for data security. Financial institutions, in turn, should conduct thorough due diligence when selecting third-party vendors and ensure contractual obligations regarding cybersecurity are clearly defined and enforced. Report calls for global action The IMF report concludes with a call for global action to address the rising threat of cyberattacks on the financial sector. Here are some key recommendations highlighted in the report: Strengthening National Cybersecurity Frameworks: Countries need to develop robust national cybersecurity strategies specifically tailored to the financial sector. These strategies should include clear roles and responsibilities for government agencies, financial institutions, and other stakeholders. Enhancing Regulatory Frameworks: Regulatory frameworks for cybersecurity in the financial sector need to be strengthened and consistently enforced. This includes mandating minimum cybersecurity standards for financial institutions and service providers. Building a Capable Workforce: There’s a pressing need to invest in building a skilled cybersecurity workforce. This includes training and education programs to equip professionals with the necessary expertise to identify, prevent, and respond to cyber threats. Fostering International Cooperation: As highlighted earlier, international cooperation is crucial for effectively combating cyber threats. Countries should collaborate on information sharing, best practices, and joint investigations to disrupt cybercriminal activities. Promoting a Culture of Cybersecurity Awareness: A strong cybersecurity culture within financial institutions is essential. This involves raising awareness among employees about cyber threats and best practices for protecting sensitive information. The report serves as a stark reminder of the growing cyber threats facing the financial sector in an increasingly digital world. Tags cybersecurity Global economy End of Article Read More Written by Anmol Singla Email Anmol is a Senior Sub-Editor with Firstpost. He likes to cover stories that amuse him, generally revolving around international polity, Indian foreign policy, human interest, environment and even the politically-charged election cycles in India. He has far too many disparate interests with a constant itch for travel. Having visited fourteen states in the Indian subcontinent, he is always on the lookout for opportunities to add more to the list. He enjoys watching Football, Tennis and F1 purely as a sports enthusiast. see more Find us on YouTube Subscribe End of Article Impact Shorts Chennai Ranks #1 in Challan Checks: ACKO Insights for Smarter Car and Two Wheeler Insurance Decisions Chennai leads India in challan checks, with drivers checking their e-challans over 5 times a month on average. Helmet non-compliance is the most broken rule, accounting for 34.8% of all traffic offences in Chennai. Regular digital challan checks help drivers avoid hefty fines, promote safe driving, and improve insurance premiums. More Impact Shorts Top Stories Russian drones over Poland: Trump’s tepid reaction a wake-up call for Nato? As Russia pushes east, Ukraine faces mounting pressure to defend its heartland Why Mossad was not on board with Israel’s strike on Hamas in Qatar Turkey: Erdogan's police arrest opposition mayor Hasan Mutlu, dozens officials in corruption probe Russian drones over Poland: Trump’s tepid reaction a wake-up call for Nato? As Russia pushes east, Ukraine faces mounting pressure to defend its heartland Why Mossad was not on board with Israel’s strike on Hamas in Qatar Turkey: Erdogan's police arrest opposition mayor Hasan Mutlu, dozens officials in corruption probe Top Shows Home Video Shorts Live TV"
  },
  {
    "url": "https://www.thisdaylive.com:443/index.php/2024/04/11/imf-raises-concerns-over-threat-of-rising-cyber-attacks-on-global-financial-stability",
    "url_mobile": "https://www.thisdaylive.com/index.php/2024/04/11/imf-raises-concerns-over-threat-of-rising-cyber-attacks-on-global-financial-stability?amp=1",
    "title": "IMF Raises Concerns over Threat of Rising Cyber Attacks on Global Financial Stability",
    "seendate": "20240411T060000Z",
    "socialimage": "https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/IMF.jpg",
    "domain": "thisdaylive.com",
    "language": "English",
    "sourcecountry": "Nigeria",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "NCC Begins Review of Regulatory Guidelines on Licensing, Enforcement Processes, Internet Code of Practice"
  },
  {
    "url": "https://www.livemint.com/money/personal-finance/your-questions-answered-should-i-invest-in-single-stocks-or-index-funds-please-elaborate-11712571250792.html",
    "url_mobile": "https://www.livemint.com/money/personal-finance/your-questions-answered-should-i-invest-in-single-stocks-or-index-funds-please-elaborate/amp-11712571250792.html",
    "title": "Your Questions Answered : Should I invest in single stocks or index funds ? Please elaborate",
    "seendate": "20240409T043000Z",
    "socialimage": "https://www.livemint.com/lm-img/img/2024/04/08/600x338/green_1_1711190174251_1712573060382.jpg",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "View Market Dashboard Your Questions Answered: Should I invest in single stocks or index funds? Please elaborate Financial sector stocks have outperformed the market in the past year. Options for investing include picking individual stocks or investing in an index fund tracking a financial sector index. Pros and cons depend on goals, risk tolerance, and investment horizon. Kuvera Published 9 Apr 2024, 08:46 AM IST single stocks vs index funds Q. I am a senior jewellery designer working with a jewellery house in Jaipur. I have observed that the financial sector has been outperforming the broader market since the past one year. I am currently confused between investing in financial sector stocks individually or investing in an index mutual fund tracking a financial sector index. Can you please elaborate on the pros and cons of investing in an index fund tracking the financial sector? Krishna Trilokcand Vasvani, Jaipur, Rajasthan. Picking stocks individually vs. Index fund Financial sectors stocks have outperformed the broader market in the past one year. There are multiple ways to invest in the financial sector chief among them is either picking financial sector stocks individually or investing in an index fund tracking a financial sector index. In India there are multiple indices tracking the financial sector such as nifty PSU banking index, nifty private bank index, S&P BSE BANKEX, etc. Amongst, index mutual funds, nifty financial services index is one of the most tracked index. For the purposes of your question we will be restricting the scope of our answer to analysing investment in financial sector stocks individually vs. investing in an index mutual fund tracking nifty financial services index. Both options have their merits and demerits, and the right answer depends on the investor's goals, risk tolerance, and investment horizon. Picking financial stock individually Picking financial stocks individually means you are placing your bet on the performance of a few finance sector companies selected by you. Most investors will be able to research on less than 10 financial sector stocks and invest in two or three of them. This approach can be highly rewarding if the companies selected by you perform well, potentially offering higher returns than the market average. However, it also comes with much higher risks. The banking sector is sensitive to economic changes, regulatory policies, and interest rate fluctuations. The stocks selected by you will not only be susceptible to these factors, but to other factors such as their own operational performance and governance. Before picking financial stocks, investors should conduct thorough research, which includes analysing the companies’ financial statements, understanding their business model, assessing the quality of their management, and keeping abreast of industry trends and regulatory changes. This requires time, expertise, and a willingness to monitor the investment closely. Index mutual fund tracking nifty financial services index On the other hand, an index mutual fund tracking the nifty financial services Index offers a more diversified investment. Such a fund mirrors the composition and performance of the nifty financial services index, which includes a basket of stocks from the Indian financial services sector, not just banking but also other financial entities like insurance companies, non-banking financial companies (NBFCs), and housing finance firms. The nifty financial services index serves as a barometer for the industry's performance. This index, which is a subset of the Nifty 50 and comprises 20 companies, encompasses a broad range of companies, including banks, financial institutions, insurance companies, and other financial services providers. The top 10 constituents of the nifty financial services index are: HDFC Bank Ltd. ICICI Bank Ltd. State Bank of India Limited. Axis Bank Ltd. Kotak Mahindra Bank Ltd. Bajaj Finance Ltd. Bajaj Finserv Ltd. Shriram Finance Ltd. SBI Life Insurance Company Ltd. HDFC Life Insurance Company Ltd. The diversification inherent in an index mutual fund helps spread the risk across different companies and sub-sectors, reducing the impact of any single stock's poor performance. Moreover, index funds are passively managed, which typically results in lower expense ratios compared to actively managed funds. This makes them a cost-effective option for investors who are looking for exposure to the financial services sector without the need to select individual stocks. Nifty financial services index - How does it select stocks? To be considered for inclusion in this index, there are specific eligibility criteria that companies must meet: The company should be listed on the National Stock Exchange (NSE). It should form a part of the Nifty 500 universe, which represents the top 500 companies by market capitalization on the NSE. The company should belong to the financial services sector. It is preferable, though not mandatory, for the company to be traded on NSE’s Futures & Options (F&O) segment. The index is calculated using the free float market capitalization method, where the level of the index reflects the total market value of all the stocks in the index relative to a particular base market capitalization value. The nifty financial services index is rebalanced semi-annually, and it comprises 20 stocks that are selected based on their free float market capitalization within their respective sub-sectors. Choosing between individual stock picking vs. Index fund When deciding between picking a financial sector stock individually and an index mutual fund, investors should consider the following factors: Risk tolerance: Are you comfortable with the volatility associated with 2-3 stocks, or do you prefer the relative stability of a well-diversified portfolio? Investment horizon: Is your investment for the short term or long term? A small portfolio of 2-3 stocks may be suitable for those with a shorter horizon Research and monitoring: Do you have the time and expertise to research and monitor individual stocks, or would you prefer a hands-off approach? Costs: Are you mindful of the costs associated with managing your investments? Index funds often have lower fees than the costs incurred when trading individual stocks. If you are hiring a registered investment advisor for investing in stock individually it may cost you much more than investing in an index fund. Advantages of investing in a mutual fund tracking nifty financials services index Diversification within the financial sector: The nifty financial services index encompasses a wide range of companies within the financial sector, including banks, insurance companies, non-banking financial companies, and other financial services entities. By investing in a mutual fund that tracks this index, you gain exposure to a diversified portfolio of financial stocks, which can help mitigate risk while still capitalising on the growth potential of the sector. Cost-effectiveness : Index funds are known for their lower expense ratios compared to actively managed funds. This cost-efficiency is a significant advantage, as lower costs can lead to higher net returns over time. By tracking an index, these funds avoid the higher fees associated with active management, making them an economical choice for investors. Alignment with economic growth: The financial services sector is often closely aligned with the broader economic growth of a country. As the economy expands, so does the demand for financial services, from loans and credit facilities to insurance and investment products. A mutual fund tracking the nifty financial services index allows investors to potentially benefit from this economic progression. Professional management and passive strategy: Despite being a passive investment, a mutual fund tracking the nifty financial services index is still managed by professional fund managers. These experts ensure that the fund's portfolio mirrors the index as closely as possible, thereby aiming to minimise tracking error and maintain the fund's performance in line with the index. Liquidity : Mutual funds offer the advantage of liquidity, allowing investors to buy or sell their fund units with relative ease. This liquidity, combined with the typically lower volatility of index funds, makes them an attractive option for investors who value flexibility and stability. In conclusion, there is no one-size-fits-all answer to whether one should invest in the financial sector by picking stocks individually or an index mutual fund tracking the nifty financial services index. However, if you are an individual engaged in full-time employment investing in an index mutual fund tracking the nifty financial services Index can help you in saving time which you will require for market research in case of investing in stock on your own. Furthermore, investing in an index fund also frees you from: (a) Day to day tracking of the stock market. (b) Increasing or decreasing your allocation according to market conditions. (c) Doing research in relation to stock selection, etc. One should take into account his/her bandwidth and expertise before choosing either of the two options and then decide accordingly. Disclaimer: Investing in mutual funds involves risks, including potential loss of principal. Please consult with a financial advisor before making any investment decisions. Kuvera is a free direct mutual fund investing platform. Your Questions Answered Mintgenie Explainers Get Latest real-time updates Catch all the Instant Personal Loan , Business Loan , Business News , Money news , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates. Business News Money Personal Finance Your Questions Answered: Should I invest in single stocks or index funds? Please elaborate More Story Url has been added to your clipboard Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue"
  },
  {
    "url": "https://www.livemint.com/opinion/first-person/financial-sector-cybersecurity-at-the-helm-of-investor-protection-11712402454042.html",
    "url_mobile": "https://www.livemint.com/opinion/first-person/financial-sector-cybersecurity-at-the-helm-of-investor-protection/amp-11712402454042.html",
    "title": "Financial sector cybersecurity at the helm of investor protection",
    "seendate": "20240406T120000Z",
    "socialimage": "https://www.livemint.com/lm-img/img/2024/04/06/600x338/3-0-58230984-2BJP1XN-0_1679807674932_1712402860153.jpg",
    "domain": "livemint.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "View Market Dashboard Financial sector cybersecurity at the helm of investor protection The aggregation of personal and financial data through fintech platforms presents an attractive target for hackers, leading to concerns over data privacy and security. C.S. Mohapatra Published 6 Apr 2024, 05:08 PM IST Cybercriminals exploit vulnerabilities to access or corrupt sensitive data, posing significant risks to consumer trust and financial stability. The digitalized payment landscape, while making transactions more efficient and cost-effective, has unintendedly heightened the risk of cyber frauds and personal data misuse. Cybercriminals exploit vulnerabilities in the system, engaging in phishing attacks, exploiting software flaws, or deceiving users into revealing sensitive information. The aggregation of personal and financial data through fintech platforms presents an attractive target for hackers, leading to concerns over data privacy and security. Hacktivism, that combines \"hacking\" and \"activism\" to use hacking skills for promoting specified objectives, presents multifaceted challenges to India's financial sector, notably through operational disruptions from denial-of-service attacks and website defacement, exposing data security vulnerabilities that could be exploited for cybercrime. These activities pose regulatory and compliance risks besides inflicting reputational damage, undermining customer trust and potentially leading to financial losses. Also Read: How cyber insurance can provide a safety net in the face of growing cyber threat In the digitalized world, Application Programming Interfaces (APIs) are important elements of innovation, efficiency and seamless connectivity. These enables different software applications to communicate with each other, playing a crucial role in the functionality of the digital experiences of social media platforms like Facebook, Instagram, eCommerce platforms, YouTube, ChatGPT, etc. The increasing reliance on APIs, however, has escalated the risk of cyber threats, highlighting the critical need for advanced security measures, including the financial sector. APIs are the unsung heroes of the digital age, enabling the rapid exchange of data and functionality across diverse platforms. In the financial sector, APIs have been instrumental in driving mobile commerce and the Internet of Things (IoT), with Akamai estimating that APIs drive roughly 83% of internet traffic. The financial sector, a vital component of national infrastructure, has witnessed a surge in API-related cyberattacks. Cybercriminals exploit vulnerabilities to access or corrupt sensitive data, posing significant risks to consumer trust and financial stability. This widespread adoption underscores the urgency for robust API security mechanisms to safeguard sensitive financial data and consumer privacy. A proactive and well-coordinated cybersecurity posture, with an emphasis on resilience and collaboration with national cybersecurity bodies like CERT-In and specific financial sector organization, i.e., CSIRT-FIN to safeguard against the evolving threat landscape posed by hacktivism is thus essential. CSIRT-Fin and CERT-In have been instrumental in protecting India's financial sector through vigilant monitoring, advisories, and collaboration, yet the dynamic nature of cyber threats demands ongoing enhancements to their efforts. Besides, financial service providers and regulators have to allocate significant resources towards enhancing cybersecurity defences, including adopting advanced threat detection technologies, comprehensive employee training, and developing robust incident response strategies. AI: A Game-Changer in API Security Conventional security measures, while necessary, are increasingly insufficient against sophisticated cyber threats that target the business logic of APIs. AI-based security systems are a game-changer, as they are capable of analyzing vast amounts of data to identify patterns and detect anomalies that deviate from normal behavior and allows for the early detection of potential threats, including those that traditional security measures are likely to overlook. Government, regulatory authorities, and financial service providers, including fintech companies alike are collectively seized with a significant shift towards prioritizing cybersecurity initiatives for investor protection, marking a departure from conventional challenges to embrace a new paradigm where digital security is at the forefront of strategic planning. With cybersecurity steering the course of investor protection, these initiatives will underscore the commitment to shield investors' interests and assets in an increasingly digital financial realm. The Digital Personal Data Protection (DPDP) Act, 2023 is all set to bolster consumer protection in the financial sector against malicious threats by enforcing strict data privacy regulations, including explicit consent for data collection, data minimization, and stringent security measures to safeguard personal data. It mandates timely breach notifications, ensuring consumers can act swiftly to secure their information. Also Read: Mint Explainer: Concerns around Digital Personal Data Protection law The DPDP Act aims to create a more secure and privacy-conscious digital financial ecosystem, significantly reducing the risk of cyberattacks and data misuse. In addition, the adoption of AI and ML technologies offers a promising path forward as these technologies provide dynamic, intelligent systems capable of real-time monitoring and threat detection, ensuring that API security evolves in tandem with emerging threats. Way Forward It's crucial for organizations to integrate advanced technologies like AI for real-time critical threat detection, foster stronger public-private partnerships to leverage private sector expertise, and conduct more frequent cybersecurity drills to identify and mitigate vulnerabilities. Secondly, expanding awareness and training programmes can empower both organizations and consumers to navigate the digital landscape safely. Thirdly, modernizing the regulatory framework by financial sector regulators to reflect the latest cyber threats and ensuring compliance across the sector is the need of the hour. Additionally, strengthening domestic as also international collaboration for sharing threat intelligence and best practices can provide a preemptive edge against globally coordinated attacks. By adopting these strategies, we can significantly improve the resilience of India's financial sector against evolving cyber risks. Thus, the future of financial security lies in leveraging AI to develop adaptive, intelligent systems that can anticipate and neutralize cyber threats. Updating the curriculum, more digital literacy awareness programmes, case-study based learning, addressing different target groups by class-oriented module structure can help address cybersecurity issues. The National Strategy for Financial Education (NSFE) needs to be revamped to orient towards handling the modern issues and complexities of financial world. As digital financial services continue to underpin the fabric of financial sector today, ensuring their security against cyber threats has never been more important. Hence, there is an urgency of adopting AI-driven security measures by which the financial sector can navigate the complex cyber threat landscape with confidence, ensuring the integrity and resilience of its digital ecosystems, while simultaneously facilitating a robust and stable growth of the financial sector. (The author is a former official of the Indian Economic Service and IEPF Chair at National Council of Applied Economic Research, Views are personal.) Digital Exclusives Get Latest real-time updates Catch all the Business News , Market News , Breaking News Events and Latest News Updates on Live Mint. Download The Mint News App to get Daily Market Updates. Business News Opinion First Person Financial sector cybersecurity at the helm of investor protection More Story Url has been added to your clipboard Wait for it… Log in to our website to save your bookmarks. It'll just take a moment. Yes, Continue"
  },
  {
    "url": "https://economictimes.indiatimes.com/industry/banking/finance/banking/be-mindful-rbi-governor-das-flagged-this-to-banks-and-nbfcs-over-public-money-during-mpc-meeting/articleshow/109055198.cms",
    "url_mobile": "https://m.economictimes.com/industry/banking/finance/banking/be-mindful-rbi-governor-das-flagged-this-to-banks-and-nbfcs-over-public-money-during-mpc-meeting/amp_articleshow/109055198.cms",
    "title": "RBI MPC :  Be mindful ... RBI Governor Das flagged this to banks and NBFCs over public money during MPC meeting",
    "seendate": "20240405T070000Z",
    "socialimage": "https://img.etimg.com/thumb/msid-109056254,width-1200,height-630,imgsize-15520,overlay-economictimes/photo.jpg",
    "domain": "economictimes.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "ANI Reserve Bank of India governor Shaktikanta Das on Friday called upon financial entities like the NBFCs, banks to be mindful of the fact that they are dealing with public money. \"Let me emphasise that banks, NBFCs and other financial entities must continue to give the highest priority to quality of governance and adherence to regulatory guidelines,\" Das said. \"Financial sector players, by and large, operate with public money – be it of depositors in banks and select NBFCs or investors in bonds and other financial instruments. They should always be mindful of this,\" Das added. The RBI has kept a keen eye on evolving risks in the financial sector to mitigate few risks. Recently, the RBI acted stringently against fintech icon Paytm's banking arm Paytm Payments Bank for due to non-compliance and supervisory concerns. Reports say certain accounts were created without proper identification, potentially for money laundering. RBI also acted against IIFL Finance Ltd and JM Financial Products Ltd , asking them to cease and desist from disbursing gold loans and loans against shares, respectively. Live Events In December 2020, the RBI suspended HDFC Bank from sourcing new credit card customers after repeated technological outages. Rating agency S&P Global Ratings said in a report that the central bank is showing serious commitment to improving governance and transparency in the sector. These actions by the RBI, it said, will curtail lenders' over-exuberance, enhance compliance culture, and safeguard customers. However, these measures will lead to higher capital costs for institutions. \"India's regulator has underscored its commitment to strengthening the financial sector,\" said S&P Global credit analyst Geeta Chugh. \"But the increased regulatory risk could impede growth and raise the cost of capital for financial institutions.\" According to S&P, the RBI has diminishing tolerance for non-compliance, customer complaints, data privacy, governance, know-your-customer (KYC), and anti-money laundering issues. Add as a Reliable and Trusted News Source Add Now! (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on RBI MPC reserve bank of india rbi hdfc bank shaktikanta das paytm payments bank jm financial products ltd iifl finance ltd s&p global ratings paytm (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on RBI MPC reserve bank of india rbi hdfc bank shaktikanta das paytm payments bank jm financial products ltd iifl finance ltd s&p global ratings paytm (Catch all the Business News , Breaking News and Latest News Updates on The Economic Times .) Subscribe to The Economic Times Prime and read the ET ePaper online. ... more less"
  },
  {
    "url": "https://www.bizcommunity.com/article/fsca-b-bbee-commission-partner-to-transform-financial-sector-342908a",
    "url_mobile": "",
    "title": "FSCA , B - BBEE Commission partner to transform financial sector",
    "seendate": "20240402T130000Z",
    "socialimage": "https://biz-file.com/c/2404/732765-848x441.jpg",
    "domain": "bizcommunity.com",
    "language": "English",
    "sourcecountry": "South Africa",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "#Orchids&Onions: SAB drives a hard message home, KFC does ESG right Brendan Seery"
  },
  {
    "url": "https://timesofindia.indiatimes.com/city/mumbai/das-rbi-to-continue-with-proactive-steps/articleshow/108955756.cms",
    "url_mobile": "https://timesofindia.indiatimes.com/city/mumbai/das-rbi-to-continue-with-proactive-steps/amp_articleshow/108955756.cms",
    "title": "RBI Governor Shaktikanta Das : Das : Rbi To Continue With Proactive Steps | Mumbai News",
    "seendate": "20240402T021500Z",
    "socialimage": "https://static.toiimg.com/thumb/msid-108955754,width-1070,height-580,imgsize-281424,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "domain": "timesofindia.indiatimes.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "Edition IN IN US Sign In TOI Today's ePaper News City News mumbai News Das: RBI to continue with proactive steps Trending Tamil Nadu Flood Indore Medical College Javed Shroff Mumbai Lokhandwala Fire Bengaluru Murder Suicide Baba Siddique Murder Tamil Nadu Flood Indore Medical College Javed Shroff Mumbai Lokhandwala Fire Bengaluru Murder Suicide Baba Siddique Murder Tamil Nadu Flood Indore Medical College Javed Shroff Mumbai Lokhandwala Fire Bengaluru Murder Suicide Baba Siddique Murder This story is from April 2, 2024 Das: RBI to continue with proactive steps TNN / Apr 2, 2024, 04:22 IST Share AA + Text Size Small Medium Large Follow us Mumbai: RBI governor Shaktikanta Das underscored the central bank ’s commitment to proactive measures in response to contingencies. He said coordinating RBI’s monetary policy with govt’s fiscal policy has helped the economy. The governor’s comments come as the central bank has taken a series of measures to curb lending in digital and unsecured loans, and barred some finance companies from certain lending activity — a change from its earlier practice of merely imposing a penalty. In his speech at an event to commemorate RBI’s 90th anniversary, Das highlighted the central bank’s evolution from a resource allocator during the planning era to a full-service central bank in a market economy. He said that the “well-calibrated and coordinated monetary and fiscal policies between RBI and central govt have shielded the economy from the twin shocks of the pandemic and ongoing geopolitical hostilities”. “It is a matter of satisfaction that today our GDP growth is robust, inflation is moderating, financial sector is stable, the external sector remains resilient, and the forex reserves are at an all-time high,” Das added. “It has been our endeavour to promote a financial sector that is robust, resilient and future-ready. The path-breaking structural reforms, such as the enactment of the Insolvency and Bankruptcy Code and the adoption of flexible inflation targeting in recent years, have helped us deal more effectively with the challenges in the banking system...,” said Das. We also published the following articles recently 'Indian economy making new records when several economies are struggling': PM Modi at RBIs 90th anniversary ceremony PM Modi emphasizes India's goal of economic self reliance and financial independence in the next decade. He highlights the RBI's role in policy innovation, youth aspirations, and PSU bank revival, aiming for a globally recognized and stable financial sector. Actor Kishen Das gets engaged Actor Kishen Das got engaged to his best friend, drawing parallels to 'Thiruchitrambalam'. He shared engagement photos, sang songs. His recent project is 'Eerapadham Kaatru Mazhai' directed by Saleem R Baadshah, featuring Vetri and Deepthie Orintelu. RBI may set up agency to check illegal lending apps RBI plans to establish DIGITA agency to verify digital lending apps, combatting fraud. Google removed 2,200 loan apps after reviewing 3,500-4,000, suspending over 2,500, aiding in curbing fraudulent activities. End of Article FOLLOW US ON SOCIAL MEDIA Visual Stories Previous 9 easy-to-do yoga poses that improve memory and intelligence Lifestyle How to make South Indian-style Rava Masala Dosa at home Food 10 baby girl names that mean 'beauty' Lifestyle 10 most stylish sarees of Janhvi Kapoor Lifestyle 10 baby boy names that mean \"gift from god\" Lifestyle 10 India’s most visited natural destinations travel 10 places in the hills to visit in November before it gets too cold travel How to use Turmeric (Haldi) for weight loss Lifestyle 8 life lessons that humans can learn from animals Lifestyle 8 foods that Ratan Tata loved the most Food Next 1 2 3 Photostories 5 dry fruits that help reduce uric acid levels naturally From earning Rs 500 per month to making it to the Forbes list, having a net worth of approximately Rs 300 crores and more: Rags to riches story of Kapil Sharma Bigg Boss 18: Confirmed list of the contestants of Salman Khan hosted controversial show 8 animals that help Earth heal and how From 91 kg to 76 kg; Laughter Chefs fame Bharti Singh's inspiring weight loss journey Exclusive: Bhavya Gandhi on playing Prabhas in Pushpa Impossible: I had never imagined myself in a negative role 5 countries with the best anti-aircraft missile systems in the world Krushna Abhishek recalls his controversial elimination from Jhalak Dikkhla Jaa: Govinda mama was the guest and they evicted me from the show in front of him Schengen visa denials: 5 countries with the highest rejection rates Celebs who overcame childhood ailments to attain success​ Salman Khan-Aishwarya Rai, Ranbir Kapoor-Nargis Fakhri, R Madhavan-Dia Mirza: Unforgettable jodis who did only ONE film together 1 2 3 Hot Picks Election Date Announcement SCO Meeting LivePakistan US Election Timeline 2024 Bengaluru Rains Omar Abdullah Oath Ceremony Lawrence Bishnoi Hit List Stock Market Today TOP TRENDING Dearness Allowance Hike Maharashtra Election Schedule Elon Musk Wife Justin Trudeau Diddy List Prince Harry APJ Abdul Kalam Motivational Quotes RBI Summer Internship Noel Tata Kerala Lottery Result Trending Stories In City Entire Website Trudeau seeks support from old ally Britain, pro-Khalistan Sikhs sense opportunity Baba Siddiqui murder plot began 3 months ago, accused visited his home unarmed multiple times: Mumbai Police IMD warning for Karnataka: Government issues work-from-home advisory to IT-BT and private companies as heavy rain lash Bengaluru 'Allegations extremely serious and ... ': What US said on Canada's charge against India on Nijjar case Harry and Meghan 'trial separation': Prince reportedly leading separate life from 'control freak' Markle Kojagiri Purnima 2024: Date, Time, Puja Rituals and Significance of Kojagari Laxmi Puja Google CEO congratulates SpaceX CEO Elon Musk: ‘... I have to admit …’ When Elon Musk asked his ex-wife to come to his hotel room to check out 'rocket videos' Apple iPad 10th Gen (64GB, Wi-Fi) available for Rs 13,449 on Amazon; here’s how you can grab the deal Garena Free Fire MAX redeem codes for October 15: Win in-game goodies and rewards today Baba Siddique murder: How shooters learnt to operate guns through YoutTube videos DA hike: Diwali comes early for central govt employees Nobel winners decode why some nations succeed while others fail Omar Abdullah takes oath as J&K CM, Congress to stay out of govt Bengaluru-bound Akasa Air flight returns to Delhi after bomb threat India vs NZ Live: Two sessions washed out in Bengaluru The secret disease that makes you happy and leaves you tired Bishnoi wants aapka address…: Viral memes after Canadian PM targets India 'AK-47 rifles, a bedroom': Israel shares video of tunnel in Lebanon Stubble burning: SC slams Haryana, Punjab, summons chief secretaries About us Create Your Own Ad Terms of Use and Grievance Redressal Policy Privacy policy Advertise with us RSS Newsletter Feedback ePaper Sitemap Archives FOLLOW US ON Other Times Group News Sites The Economic Times Hindi Economic Times Navbharat Times Maharashtra Times Vijaya Karnataka Telugu Samayam Tamil Samayam Malayalam Samayam I am Gujarat TimesPoints Indiatimes Brand Capital Education Times Times Food Mumbai Mirror Bangalore Mirror Hindi Podcast Popular Categories Headlines Sports News Business News India News World News Bollywood News Health+ Tips Indian TV Shows Celebrity Photos Technology News Hot on the Web Karwa Chauth Bigg Boss 18 Contestants List Kapil Sharma Gunaratna Sadavarte Baba Siddiques Munawar Faruqui Vivek Oberoi Optical illusion Jigra Collection Broccoli vs Cauliflower Top Trends IND vs NZ Live Score Rohit Sharma Omar Abdullah Allan Lichtman Jharkhand Election Schedule Sachin Tendulkar Baba Siddique Maharashtra Election Full Schedule Bengaluru Schools Closed Kylian Mbappes Canadian Diplomat Ashes Schedule RBI Summer Internship Bahraich Violence Maharashtra Election Schedule Jharkhand Election Schedule Live Cricket Score Trending Topics Diwali Wishes Jigra Movie Review Fake Paneer Devara OTT Release Vettaiyan Collection Ram Gopal Lawrence Bishnoi Cow Ghee Bigg Boss 18 Salman Khan Shraddha Kapoor Ratan Tata Passed Away Nana Patekar Sharad Purnima Moonrise Time Swatantrya Veer Savarkar Sharad Purnima 2024 Top Load Washing Machines Best Premium Laptops Nonstick Cookware Sets Wordle Answer Living and entertainment ETimes Travel Destinations Cricbuzz.com TV Lifestyle Newspaper Subscription Food News Times Prime Whats Hot Services CouponDunia TechGig TimesJobs Bollywood News Times Mobile Gadgets Careers Colombia Latest News How Chennai Night Race swerved past challenges to zoom toward a brighter motorsports future Infosys to no longer send job offer letters and attachments, the company will ... Bigg Boss 18: Avinash Mishra evicted by housemates following major clash with Chum Darang; Eisha Singh and Alice Kaushik left stunned Happy Govardhan Puja 2023: Top 50 Wishes, Messages and Quotes to share with your loved ones Andre Chase Returns to NXT as Lexis King Defeats Oro Mensah in Gentleman’s Duel Ashes 2025-26 fixtures announced: Australia vs England series to begin at Perth 'Test cricket is nothing but...' - Indian players reveal what the red-ball format means to them WWE NXT Results and Highlights 10/15: Triple Threat No. 1 Contender match, Stephanie Vaquer vs. Wren Sinclair, and more Actress Helen Nelson aka Oviya files complaint against morphed viral video, takes legal action Raghav Juyal's VIDEO of getting his shoe lace tied by someone else in public goes viral, netizens react as they get disappointed! Oviya lodges police complaint over her private video leak 15-page letter circulating online accuses IBM China head of misconduct; here's what company said while confirming the letter 7 deadliest reptiles in the world from venomous snakes to turtles Wayanad bypoll fixed for November 13, Priyanka set for election debut World Cup Finals: Sonam Maskar saves the day for India October Full Moon 2024 Tonight: When and How to Watch Hunter's Moon? Watch: Two giant pandas Bao Li and Qing Bao arrive in Washington National Zoo GSEB Gujarat Board Exam Schedule 2025 Announced: Check complete time table for class 10th and 12th here Copyright © 2024 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service"
  },
  {
    "url": "https://www.news18.com/business/rbi-has-evolved-from-being-allocator-of-scarce-resources-to-market-economy-enabler-shaktikanta-das-8835340.html",
    "url_mobile": "https://www.news18.com/amp/business/rbi-has-evolved-from-being-allocator-of-scarce-resources-to-market-economy-enabler-shaktikanta-das-8835340.html",
    "title": "RBI Has Evolved From Being Allocator of Scarce Resources To Market Economy Enabler : Shaktikanta Das",
    "seendate": "20240401T064500Z",
    "socialimage": "https://images.news18.com/ibnlive/uploads/2024/04/shaktikanta-das-rbi-governor-2024-04-8adeece31e097cca33d6c17a1f6fc9de-16x9.jpg?impolicy=website",
    "domain": "news18.com",
    "language": "English",
    "sourcecountry": "India",
    "ticker": "XLF",
    "industry": "Financial",
    "search_keyword": "financial sector",
    "article_text": "RBI Has Evolved From Being Allocator of Scarce Resources To Market Economy Enabler: Shaktikanta Das Reported By : Mohammad Haris News18.com Last Updated: April 01, 2024, 11:45 IST RBI remains focused on ensuring stable, strong financial system that would act as a bedrock of India’s economic progress, says RBI Governor Shaktikanta Das Impact Shorts Big news, made easy Rapid Read Summarized by AI. + More Rapid Read Like this summary? Share Your Feedback Choose News18 on Google reset RBI Governor Shaktikanta Das. RBI Governor Shaktikanta Das on Monday said the Reserve Bank has seen evolution from being a central bank primarily concerned with the allocation of scarce resources during the planning period to now being an enabler for the market economy. “The Reserve Bank’s evolution as an institution has been closely intertwined with the development of the Indian economy, from being a central bank primarily concerned with the allocation of scarce resources, during the planning period, the Reserve Bank transitioned into being an enabler for the market economy. We are a full-service central bank, with our functions spanning multiple dimensions. It has been our endeavour to promote the financial sector, a financial sector that is robust, resilient, and future-ready,\" Das said, while speaking at the RBI@90 event marking 90 years of the central bank on April 1. Recommended Stories The RBI governor also said the path-breaking structure reforms such as the enactment of the Insolvency and Bankruptcy Code and the adoption of flexible inflation targetting in the recent years have helped us to deal with the challenges in the banking system and the task of maintaining price stability more effectively. top videos View all Swipe Left For Next Video View all He also said the RBI remains focused on ensuring stable, strong financial system that would act as a bedrock of India’s economic progress. “The Covid-19 pandemic and the ongoing geopolitics hostilities have tested the resilience of every economy in the world, including India. The well-calibrated and coordinated monetary and fiscal policies adopted in our country went a long way in shielding our economy from these shocks and helped us to emerge even stronger than before. It’s a matter of satisfaction that today our GDP growth is robust, inflation is moderating, the financial sector is stable, the external sector remains resilient, and the forex reserves are at an all-time high,\" the RBI governor said. About the Author Mohammad Haris Haris is Deputy News Editor (Business) at news18.com. He writes on various issues related to markets, economy and companies. Having a decade of experience in financial journalism, Haris has been previously asso... Read More Haris is Deputy News Editor (Business) at news18.com. He writes on various issues related to markets, economy and companies. Having a decade of experience in financial journalism, Haris has been previously asso... Read More Follow News18 on Google . Join the fun, play QIK games on News18 . Stay updated with all the latest business news, including market trends , stock updates , tax , IPO, banking finance , real estate, savings and investments. To Get in-depth analysis, expert opinions, and real-time updates. Also Download the News18 App to stay updated. tags : shaktikanta das view comments Location : New Delhi, India First Published: April 01, 2024, 11:29 IST News business RBI Has Evolved From Being Allocator of Scarce Resources To Market Economy Enabler: Shaktikanta Das Disclaimer: Comments reflect users’ views, not News18’s. Please keep discussions respectful and constructive. Abusive, defamatory, or illegal comments will be removed. News18 may disable any comment at its discretion. By posting, you agree to our Terms of Use and Privacy Policy . Loading comments... Read More"
  }
]